<html>
<head>
<link rel="stylesheet" type="text/css" href="../css/tupi.css" />
</head>
<body class="tupi_background2">
<center>
<b>[ Under Translation ]</b>
</center>
<p class="title">M&oacute;dulo de Ilustraci&oacute;n</p>
<p class="paragraph">
En este m&oacute;dulo pasar&aacute;s la mayor parte del tiempo cuando te encuentres trabajando con <b>Tup&iacute;</b>, sabes por qu&eacute;? aqu&iacute; es donde construyes cada marco de tu animaci&oacute;n y para ser m&aacute;s exactos, cada l&iacute;nea de cada personaje y de cada pieza del escenario en el que quieras contar tu historia.<br/>Dicho en otras palabras, si por ejemplo, quieres crear la animaci&oacute;n de un personaje caminando por una calle, es en esta pesta&ntilde;a donde deber&aacute;s dise&ntilde;ar al personaje y a cada una de las posiciones en las que este aparecer&aacute; mientras se mueve:
</p>
<center>
<img src="./images/illustration_shot.png"/>
<p class="paragraph">
<b>Fig #13.</b> Interfaz del M&oacute;dulo de Ilustraci&oacute;n  
</p>
</center>
<p class="paragraph">
<b>Tip:</b> Cada vez que desees consultar el <b>M&oacute;dulo de Ilustraci&oacute;n</b>, s&oacute;lo debes presionar la tecla <b>F9</b>.
</p>
<p class="paragraph">
En la secci&oacute;n anterior, dimos un vistazo a los componentes m&aacute;s generales de la interfaz de <b>Tup&iacute;</b>. Ahora demos una mirada un poco m&aacute;s detalla a cada recurso disponible desde este m&oacute;dulo:
</p>

<p class="paragraph">
<b>1. &Aacute;rea de Trabajo</b>
<p class="paragraph">
Piensa en el <i>&Aacute;rea de Trabajo</i> como un lienzo en blanco, el espacio del que disponemos para realizar las ilustraciones de cada uno de los marcos que har&aacute;n parte de la animaci&oacute;n. Cuenta con dos reglas gu&iacute;as en el borde superior y en el izquierdo. En el centro, cuenta con una forma rectangular de fondo blanco que simboliza las dimensiones del marco, o si lo prefieres, tu "hoja de papel". 
Al lado derecho encontraremos un panel din&aacute;mico que contiene las propiedades de la herramienta que se encuentre seleccionada en ese momento y en la parte inferior, un peque&ntilde;o conjunto de controles relacionados con el <i>&Aacute;rea de Trabajo</i>.<br/>
<b>Tip:</b> Aquello que no dibujes dentro del marco, no ser&aacute; visible en la animaci&oacute;n. 
</p>
<center>
<img src="./images/work_area.png"/>
<p class="paragraph">
<b>Fig #14.</b> &Aacute;rea de Trabajo 
</p>
</center>
<p class="paragraph">
<b>2. Panel Superior de Funciones de Edici&oacute;n</b>
<br/>
Ubicado en la parte superior izquierda, sobre el <i>&Aacute;rea de Trabajo</i>, este panel ofrece todas las funcionalidades b&aacute;sicas de edici&oacute;n usuales al momento de trabajar sobre una ilustraci&oacute;n: <i>Hacer</i>, <i>Deshacer</i>, <i>Copiar</i>, <i>Pegar</i>, <i>Cortar</i>, <i>Eliminar</i>, <i>Agrupar</i> y <i>Desagrupar</i>.<br/>    
Adicionalmente, ofrece dos opciones complementarias muy &uacute;tiles: una <i>Malla Gu&iacute;a</i> para el ilustrador, que puede activarse o desactivarse a voluntad, y el control del <i>Papel Cebolla</i>, funcionalidad que nos permite convertir el marco actual en semi-transparente, con el fin de ver los dibujos que tenemos tanto en marcos anteriores, como en marcos posteriores. En la secci&oacute;n "<a href="chapter2.html">Hagamos un ejemplo!</a>" profundizaremos en el uso de esta &uacute;ltima opci&oacute;n. 
</p>
<center>
<table>
<tr>
<td>
<img src="./images/edition_panel.png"/>
</td>
<td>
<img src="./images/edition_panel_small.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #15.</b> Panel Superior de Funciones de Edici&oacute;n 
</p>
</center>

<p class="paragraph">
<b>3. Panel de Herramientas</b>
<br/>
Este panel, se encuentra ubicado al borde izquierdo del <i>&Aacute;rea de Trabajo</i> y nos provee de todas las herramientas necesarias para dibujar y realizar operaciones especiales sobre nuestra ilustraci&oacute;n. Cada recurso se encuentra agrupado seg&uacute;n su naturaleza en los siguientes sub-men&uacute;s: 
<ul>
<li> Men&uacute; de Trazo: Este men&uacute; incluye todas las herramientas de dibujo, entre ellas: el <i>L&aacute;piz</i>, el <i>Borrador</i>, el <i>Rect&aacute;ngulo</i>, la <i>Elipse</i>, la <i>L&iacute;nea</i>, la <i>Polil&iacute;nea</i>, la opci&oacute;n de <i>Texto</i> y la futura funcionalidad de <i>Tweening</i>.</li>
<li> Men&uacute; de Selecci&oacute;n: Este men&uacute; incluye la opci&oacute;n de <i>Selecci&oacute;n de Nodos</i>, la cual permite modificar la forma y trayectoria de una figura a partir de nodos de edici&oacute;n y la opci&oacute;n de <i>Selecci&oacute;n de Objetos</i>, la cual permite mover, rotar o escalar cualquier figura que se seleccione desde el <i>&Aacute;rea de Trabajo</i>.</li> 
<li> Men&uacute; de Relleno: Este men&uacute; incluye las herramientas de <i>Relleno de Borde</i> y <i>Relleno de Interior</i> sobre los objetos seleccionados, a partir del color que se encuentre definido en la <i>Paleta de Colores</i> en ese momento.</li>
<li> Men&uacute; de Vista: Este men&uacute; agrupa la opci&oacute;n de <i>Lupa</i>, para acercar o alejar la vista del marco que se encuentra en edici&oacute;n y la herramienta de <i>Arrastre</i> (mejor conocida como "<i>Mano</i>"), que sirve para desplazar el punto de vista de un marco cuando este se encuentra ampliado.</li>
</ul>
<center>
<table>
<tr>
<td>
<img src="./images/toolbox.png"/>
</td>
<td>
<img src="./images/toolbox_small.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #16.</b> Panel de Herramientas 
</p>
</center>
</p>

<p class="paragraph">
<b>4. Barra Lateral Izquierda</b>
</p>

<p class="paragraph">
<b>Paleta de Colores</b>
<br/>
Como su nombre lo indica, este es el panel en donde escogemos el color con el que queremos trazar, independiente de la figura o forma que estemos trabajando. Es importante tener en cuenta que mientras no modifiquemos el color actual, absolutamente todo lo que dibujemos conservar&aacute; ese mismo color, hasta que seleccionemos uno diferente.
</p>
<center>
<table>
<tr>
<td>
<img src="./images/color_palette.png"/>
</td>
<td>
<img src="./images/color_palette_small.png"/>
</td>
</tr>
</table>
<p class="paragraph">
   <b>Fig #17.</b> Paleta de Colores
</p>
</center>
<p class="paragraph">
<b>Tip:</b> Ten en cuenta que adem&aacute;s de utilizar colores homog&eacute;neos, tambi&eacute;n puedes utilizar <i>Gradientes</i>, es decir, conjuntos de colores que se mezclan de manera progresiva sobre una misma figura, como en el siguiente ejemplo, en donde el gradiente comienza en un verde luminoso y termina en negro:
</p>
<center>
     <img src="./images/gradient.png"/>
     <p class="paragraph">
        <b>Fig #18.</b> Ejemplo de Gradiente 
     </p>
</center>
<p class="paragraph">
<b>Propiedades de Brocha</b>
<br/>
La <i>Brocha</i> en nuestro contexto, es el tipo de herramienta que usas para dibujar. Si quieres, puedes pensar en la <i>Brocha</i> como el tipo de punta que le vas a poner a tu l&aacute;piz. Este panel nos permite modificar caracter&iacute;sticas de la brocha, como su grosor, el tipo de bordes para los extremos de los trazos y la continuidad de la l&iacute;nea (por ejemplo, puedes realizar trazos punteados, si lo deseas).
</p>
<center>
<table>
<tr>
<td>
<img src="./images/brush_properties.png"/>
</td>
<td>
<img src="./images/brush_properties_small.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #19.</b> Propiedades de Brocha
</p>
</center>

<p class="paragraph">
<b>Librer&iacute;a de Objetos</b>
<br/>
La funci&oacute;n de este componente, es permitirnos almacenar una copia de aquellas figuras o im&aacute;genes que hacen parte de nuestro proyecto y que nos interesa volver a utilizar en otros marcos de la misma animaci&oacute;n o de otro proyecto. Este recurso es muy &uacute;til en animaciones donde sabes que algunos de los componentes que ya dibujaste van a aparecer una y otra vez.  
</p>
<center>
<table>
<tr>
<td>
<img src="./images/library.png"/>
</td>
<td>
<img src="./images/library_small.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #20.</b> Librer&iacute;a de Objetos
</p>
</center>

<p class="paragraph">
<b>5. Barra Lateral Derecha</b>
</p>

<p class="paragraph">
<b>Administrador de Escenas</b>
<br/>
Sabes qu&eacute; es una escena? Tratemos de dar una definici&oacute;n sencilla: piensa en una pel&iacute;cula o en un comercial de TV, has notado que siempre se componen de peque&ntilde;os fragmentos ordenados de tal forma que cuentan una historia? Estos fragmentos suelen ser reconocidos con facilidad por los cambios en la posici&oacute;n de la c&aacute;mara o el punto de vista del espectador, osea t&uacute;.<br/>
Teniendo claro este concepto, resulta f&aacute;cil describir este componente: a trav&eacute;s de este panel vamos a poder crear y eliminar cada una de las escenas que queremos incluir en nuestro proyecto de animaci&oacute;n.<br/>
<b>Tip:</b> Es importante que antes de empezar con tu proyecto de animaci&oacute;n, tengas muy claro cuales son las escenas que vas a desarrollar y en que orden las vas a crear. Pon mucha atenci&oacute;n a los consejos de la secci&oacute;n "<a href="first.html">Lo primero!</a>". 
</p>
<center>
<table>
<tr>
<td>
<img src="./images/scenes_manager.png"/>
</td>
<td>
<img src="./images/scenes_manager_small.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #21.</b> Administrador de Escenas
</p>
</center>

<p class="paragraph">
<b>Tabla de Exposici&oacute;n</b>
<br/>
La <i>Tabla de Exposici&oacute;n</i> es un recurso vital al momento de ilustrar cada uno de los "instantes" que hacen parte de tu animaci&oacute;n. A trav&eacute;s de ella, puedes adicionar o eliminar nuevos marcos y nuevas capas a cada una de tus escenas. Adem&aacute;s, desde este panel tienes el control para seleccionar los marcos que quieras editar en el <i>&Aacute;rea de Trabajo</i> a partir de un simple clic. Esta funcionalidad sumada a la opci&oacute;n de <i>Papel Cebolla</i> del <i>Panel de Funciones de Edici&oacute;n</i>, te ofrecer&aacute;n los elementos necesarios para que tus animaciones luzcan fluidas. Esto ser&aacute; mucho m&aacute;s f&aacute;cil de entender, despu&eacute;s de que revises el ejemplo del <a href="chapter2.html">pr&oacute;ximo cap&iacute;tulo</a>.
</p>
<center>
<table>
<tr>
<td>
<img src="./images/exposure_sheet.png"/>
</td>
<td>
<img src="./images/exposure_sheet_small.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #22.</b> Tabla de Exposici&oacute;n
</p>
</center>

<p class="paragraph">
<b>6. Barra Inferior</b>
</p>

<p class="paragraph">
<b>L&iacute;nea de Tiempo</b>
<br/>
Este componente es uno de los m&aacute;s emblem&aacute;ticos en el mundo de la animaci&oacute;n digital y es el m&aacute;s popular entre animadores. Cumple funciones similares a las de la <i>Tabla de Exposici&oacute;n</i>, con la diferencia de que a trav&eacute;s de este componente puedes previsualizar tu animaci&oacute;n. En el caso de <b>Tup&iacute;</b>, este componente se encuentra a&uacute;n en desarrollo, pero esperamos tenerlo listo en pr&oacute;ximas versiones. 
</p>
<center>
<table>
<tr>
<td>
<img src="./images/time_line.png"/>
</td>
<td>
<img src="./images/time_line_small.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #23.</b> L&iacute;nea de Tiempo 
</p>
</center>

</body>
</html>
