<html>
<head>
<link rel="stylesheet" type="text/css" href="../css/tupi.css" />
</head>
<body class="tupi_background3">
<center>
<b>[ Under Translation ]</b>
</center>
<p class="title">Iniciemos un proyecto</p>
<p class="paragraph">
Muy bien, es momento de abrir <b>Tup&iacute;</b> por primera vez. Independiente del entorno gr&aacute;fico en el que te encuentres trabajando, si ya tienes instalado el programa en tu computador, debes buscarlo en la secci&oacute;n de "<i>Gr&aacute;ficos</i>" de tu men&uacute; principal de aplicaciones: 
</p>
<center>
<img src="./images/launching_tupi.png"/>
<p class="paragraph">
<b>Fig #30.</b> Abriendo <b>Tup&iacute;</b> desde Ubuntu  
</p>
</center>
<p class="paragraph">
Una vez abierto el programa, ver&aacute;s una pantalla como esta en tu computador:
</p>
<center>
<img src="./images/first_mainwindow.png"/>
<p class="paragraph">
<b>Fig #31.</b> Pantalla de Inicio
</p>
</center>
<p class="paragraph">
En este punto, tienes dos opciones: Crear un nuevo proyecto o abrir uno ya existente. Como esta es nuestra primera vez, vamos a crear un nuevo proyecto dando clic en el &iacute;cono de nuevo: 
</p>
<center>
<img src="./images/new_project.png"/>
<p class="paragraph">
<b>Fig #32.</b> Creando un nuevo proyecto 
</p>
</center>
<p class="paragraph">
Sobre el cuadro de di&aacute;logo que aparece en pantalla, debemos ingresar la informaci&oacute;n b&aacute;sica del proyecto: un nombre para el archivo, el nombre del autor, la dimensi&oacute;n que queremos dar a nuestra animaci&oacute;n y la cantidad de marcos por segundo (FPS) con los que queremos trabajar inicialmente.<br/>
Para este ejemplo, simplemente vamos a llenar los dos primeros campos y a dejar los otros con sus valores por defecto:
</p>
<center>
<img src="./images/new_project_dialog.png"/>
<p class="paragraph">
<b>Fig #33.</b> Di&aacute;logo de configuraci&oacute;n de un nuevo proyecto 
</p>
</center>
<p class="paragraph">
Una vez demos clic en el bot&oacute;n <i>Aceptar</i>, el &aacute;rea de trabajo estar&aacute; disponible para empezar con nuestro proyecto. Nuestro punto de partida siempre ser&aacute; el <i>M&oacute;dulo de Ilustraci&oacute;n</i> y m&aacute;s espec&iacute;ficamente, el primer marco de la animaci&oacute;n. Muy bien, estamos listos para <a href="drawing.html">empezar a dibujar!</a>
</p>
</body>
</html>
