<html>
<head>
<link rel="stylesheet" type="text/css" href="../css/tupi.css" />
</head>
<body class="tupi_background3">
<center>
<b>[ Under Translation ]</b>
</center>
<p class="title">Stop Motion? es posible?</p>
<p class="paragraph">
Como ya lo mencionamos en la <a href="init.html">introducci&oacute;n</a> de este manual, <i>Stop Motion</i> es una t&eacute;cnica de animaci&oacute;n basada en fotograf&iacute;as. Vale la pena decir que los v&iacute;deos resultantes de este tipo de animaci&oacute;n suelen ser bastante divertidos. Muy bien, ahora la pregunta del mill&oacute;n: Puedo hacer <i>Stop Motion</i> con <b>Tup&iacute;</b>?<br/>
La respuesta corta es SI, sin embargo, el componente dedicado a este tema a&uacute;n necesita de mucho trabajo. Por el momento, la interfaz permite la realizaci&oacute;n de ejercicios de animaci&oacute;n sencillos, pero las metas a futuro son mucho m&aacute;s ambiciosas.<br/> 
Por ahora, veamos como crear un peque&ntilde;o v&iacute;deo usando esta t&eacute;cnica:
<ol>
<li> Consigue una c&aacute;mara fotogr&aacute;fica digital. Dado que este tipo de animaciones se basan en fotograf&iacute;as, la c&aacute;mara es de vital importancia.</li>
<li> Construye el gui&oacute;n de tu historia, siguiendo los consejos que mencionamos en el cap&iacute;tulo "<a href="first.html">Lo primero!</a>"</li>
<li> Consigue los recursos que necesitas para tu historia: objetos, personas, etc.</li>
<li> Fija tu c&aacute;mara en un punto fijo (ej. una mesa o un tr&iacute;pode) apuntando hacia el lugar donde vas a realizar tu escena y aseg&uacute;rate de que la c&aacute;mara no se pueda mover hacia los lados. Ubica tus recursos en la escena, tal y como quieres que se encuentren al comienzo de la animaci&oacute;n.</li>
<li> Comienza a tomar una foto por cada movimiento que realices sobre los objetos o personas que est&aacute;n en la escena, de acuerdo a lo definido en tu gui&oacute;n. Recuerda que cada movimiento debe ser peque&ntilde;o, pues de esto depende que al final, tu animaci&oacute;n luzca muy fluida.</li>
<li> Cuando hayas capturado cada uno de los momentos de la historia que requieres para tus escenas, conecta tu c&aacute;mara al computador y descarga todas las fotos en una carpeta.</li>
<li> Abre <b>Tup&iacute;</b> y <a href="new.html">crea un nuevo proyecto</a>.</li>
<li> Ahora selecciona el men&uacute; <i>Insertar</i> ubicado en la parte de arriba y escoge la opci&oacute;n <i>Arreglo de Im&aacute;genes</i>. Un cuadro de di&aacute;logo se abrir&aacute;, solicitando que selecciones el directorio en donde guardaste las fotos para tu animaci&oacute;n.</li>
<center>
<img src="./images/stop_motion01.png"/>
<p class="paragraph">
<b>Fig #63.</b> Opci&oacute;n de insertar un <i>Arreglo de Im&aacute;genes</i>
</p>
</center>
<li> Una vez presiones el bot&oacute;n <i>Aceptar</i>, el programa cargar&aacute; cada una de tus im&aacute;genes en un marco independiente y siguiendo el orden alfab&eacute;tico en que se encuentren los archivos dentro del directorio.</li> 
<center>
<img src="./images/stop_motion02.png"/>
<p class="paragraph">
<b>Fig #64.</b> Di&aacute;logo de selecci&oacute;n del directorio que contiene las im&aacute;genes
</p>
</center>
<li> Si tus im&aacute;genes son muy grandes, el programa se ver&aacute; forzado a redimensionarlas, pues si son muchas y todas son de un tama&ntilde;o superior a 1 MB, es muy probable que tu m&aacute;quina se quede sin memoria y el programa se bloquee.</li>
<center>
<img src="./images/stop_motion03.png"/>
<p class="paragraph">
<b>Fig #65.</b> Mensaje informativo al momento de insertar las im&aacute;genes  
</p>
</center>
<li> Cuando termine el proceso de importaci&oacute;n de im&aacute;genes, puedes darle un vistazo a tu proyecto en la pesta&ntilde;a de <i>Animaci&oacute;n</i> (la segunda en el <i>&Aacute;rea de Trabajo</i> de izquierda a derecha).</li>
<li> A partir de este punto, tienes dos opciones: puedes exportar tu proyecto como un archivo de v&iacute;deo, o puedes hacer algo de edici&oacute;n sobre las im&aacute;genes que desees utilizando las herramientas de ilustraci&oacute;n.</li>
<li> Si te gusta lo que viste y lo quieres convertir en v&iacute;deo, regresa a la pesta&ntilde;a de <i>Animaci&oacute;n</i> y presiona el bot&oacute;n <i>Exportar</i> ubicado en el panel inferior.</li> 
<li> Sigue los pasos habituales de exportaci&oacute;n, descritos en la secci&oacute;n anterior: "<a href="video_file.html">Creemos un archivo de v&iacute;deo</a>" y ya est&aacute;! Tu proyecto de <i>Stop Motion</i> es una realidad!  
</ol>
</p>
</body>
</html>
