<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>



  <meta http-equiv="content-type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="../css/tupi.css"><title></title></head><body class="tupi_background3">
  <p class="title">Engadindo novos fotogramas</p>

  <p class="paragraph">Con noso primeiro fotograma rematado, &#233; o momento de engadir o seguinte. Para facelo, imos empregar a <i>T&#225;boa de exposici&#243;ns</i>, situada &#225; dereita da nosa <i>&#193;rea de traballo</i>; co cursor do rato imos premer na posici&#243;n num. 2 da capa num. 1, tal e como se ve na imaxe:
</p>

  <center>
    <table>
      <tbody><tr>
        <td><img src="./images/sketching17.png"></td>

        <td><img src="./images/sketching18.png"></td>
      </tr>
    </tbody></table>

    <p class="paragraph"><b>Fig. 48</b> Engadindo un novo fotograma</p>
  </center>

  <p class="paragraph">Cada vez que necesitemos un novo fotograma para traballar, seguimos o 
mesmo procedemento. &#201; o momento de engadir a nosa bolboreta nunha nova 
posici&#243;n, mais antes, deberemos activar a opci&#243;n de <i>Papel cebola</i> un fotograma cara atr&#225;s:
<i></i></p>

  <center>
    <table>
      <tbody><tr>
        <td><img src="./images/sketching19.png"></td>

        <td><img src="./images/sketching20.png"></td>
      </tr>
    </tbody></table>

    <p class="paragraph"><b>Fig. 49</b> Activando o papel cebola</p>
  </center>

  <p class="paragraph">Grazas a este recurso, imos poder utilizar os fotogramas anteriores como
 gu&#237;a para saber onde debemos situar os obxectos ou personaxes que 
estamos animando. Notaches que antes de activar o <i>Papel cebola</i>, o fotograma num. 2 era totalmente branco? pois ben, agora vese  como se for papel transparente:
</p>

  <center>
    <img src="../images/sketching21.png">

    <p class="paragraph"><b>Fig. 50</b> Primeiro fotograma reflectido no segundo, grazas ao papel cebola</p>
  </center>

  <p class="paragraph">Base&#225;ndonos na informaci&#243;n do primeiro fotograma, debuxamos de novo a bolboreta, esta vez, un chisco m&#225;is adiante:
</p>

  <center>
    <img src="../images/sketching22.png">

    <p class="paragraph"><b>Fig. 51</b> Debuxando a bolboreta no segundo fotograma

</p></center><p class="paragraph">Ben, agora engadimos un terceiro fotograma, mais, para ter unha mellor 
idea sobre como ir debuxando o noso personaxe a medida que a animaci&#243;n 
avanza, tam&#233;n imos a activar a visibilidade de m&#225;is fotogramas cara 
atr&#225;s (10 para este exemplo) no noso cadro de control do <i>Papel cebola</i>:
</p>

  <center>
    <table>
      <tbody><tr>
        <td><img src="./images/sketching23.png"></td>

        <td><img src="./images/sketching24.png"></td>
      </tr>
    </tbody></table>

    <p class="paragraph"><b>Fig. 52</b> Engadindo un fotograma m&#225;is e 10 capas de cebola cara atr&#225;s</p>
  </center>

  <p class="paragraph"><b>Consello:</b> Lembra que podes activar a transparencia de fotogramas tanto cara 
adiante como cara atr&#225;s. Es libre de usar tantos como compran, o 
importante &#233; que aproveites esta funcionalidade para facer que as t&#250;as 
animaci&#243;ns se vexan tan <i>flu&#237;das</i> como for pos&#237;bel.</p>

  
<p>Sigamos agora co noso terceiro fotograma, seguindo exactamente os mesmos pasos que xa demos anteriormente:
</p>



  <center>
    <img src="../images/sketching25.png">

    <p class="paragraph"><b>Fig. 53</b> Debuxando a bolboreta no fotograma  num. 3</p>
  </center>

  <p class="paragraph">Neste punto, &#233; moi prob&#225;bel que che fagas unha preguntes: Cantos 
fotogramas vai precisar a mi&#241;a animaci&#243;n? Bo, &#233; unha moi boa pregunta 
que aprender&#225;s a responder ti mesmo, co tempo e con moita moita 
pr&#225;ctica. S&#243; coa experiencia, aprender&#225;s a calcular un valor aproximado 
de fotogramas para cada un dos teus proxectos. Polo de agora, 
debuxaremos tantos como sexa preciso para cumprir co proposto no noso 
gui&#243;n:
</p>

  <center>
    <img src="./images/sketching26.png">
<p class="paragraph"><b>Fig. 54</b> Debuxando a bolboreta no fotograma num. 6</p>
</center>

  <center>
    <img src="../images/sketching27.png">

    <p class="paragraph"><b>Fig. 55.</b> Debuxando a bolboreta no fotograma num. 9</p>
  </center>

  <center>
    <table>
      <tbody><tr>
        <td><img src="../images/sketching28.png"></td>

        <td><img src="../images/sketching29.png"></td>
      </tr>

      <tr>
        <td><img src="../images/sketching30.png"></td>

        <td><img src="../images/sketching31.png"></td>
      </tr>
    </tbody></table>

    <p class="paragraph"><b>Fig # 56.</b> Vista dos fotogramas num. 21, 31, 45 e 46</p>
  </center>

  <p class="paragraph"><b>Consello:</b> Para este pequeno proxecto foi necesario debuxar 73 fotogramas.</p>

  <p class="paragraph">Algo importante a ter en conta, &#233; que non debes agardar a debuxar o 
&#250;ltimo fotograma para poder ver como est&#225; a quedar a t&#250;a animaci&#243;n. De 
feito, &#233; un bo costume revisar o resultado cada certo n&#250;mero de 
fotogramas, para as&#237;, garantir que as ilustraci&#243;ns que est&#225;s plasmando a
 cada instante, correspondan realmente ao que tes nos miolos. <a href="preview_time.html">Bot&#233;moslle unha ollada!</a></p>
</body></html>
