<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>





  <meta http-equiv="content-type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="../css/tupi.css"><title></title></head><body class="tupi_background2">
<p class="title">M&#243;dulo de animaci&#243;n</p>
<p class="paragraph">&#201; neste m&#243;dulo no que pasar&#225;s a maior parte do tempo cando esteas a traballar con  <b>Tup&#237;</b>, sabes por que? aqu&#237; &#233; onde constr&#250;es cada fotograma da t&#250;a 
animaci&#243;n e, para seren m&#225;is precisos, cada li&#241;a de cada personaxe de 
cada peza do escenario no que queiras contar a t&#250;a historia.</p>
<p>Dito noutras palabras se, por exemplo, queres crear a animaci&#243;n 
dun personaxe cami&#241;ando por unha r&#250;a, &#233; nesta lapela onde deber&#225;s 
dese&#241;ar ao personaxe e cada unha das posici&#243;ns nas que este aparecer&#225; 
mentres se move: 
</p>
<p class="paragraph"></p>
<center>
    <img src="./images/illustration_shot.png">
<p class="paragraph"><b>Fig. 13</b> Interface do m&#243;dulo de animaci&#243;n</p>
</center>
<p class="paragraph"><b>Consello:</b> Cada vez que queiras ver o <b>M&#243;dulo de animaci&#243;n,</b> s&#243; ter&#225;s que premer a combinaci&#243;n <b>Ctrl + 1</b>.</p>
<center>
    <img src="./images/illustration_menu.png">
<p class="paragraph"><b>Fig. 14</b> Men&#250; de <b>M&#243;dulos</b>, acceso a <b>Animaci&#243;n</b></p>
</center>
<p class="paragraph">Na secci&#243;n anterior, bot&#225;moslle un ollo aos compo&#241;entes m&#225;is xerais da interface do <b>Tup&#237;</b>. Vexamos agora, cun pouco m&#225;is de detalle, cada un dos recursos </p>
<p class="paragraph"><b>1.</b> <b>&#193;rea de traballo</b></p>
<p class="paragraph">Pensa na <i>&#225;rea de traballo</i> como un lenzo en
branco, o espazo do que dispomos para realizar as ilustraci&#243;ns de cada
un dos fotogramas que ser&#225;n parte da animaci&#243;n. Disp&#243;n de d&#250;as regras
de gu&#237;a nos bordos superior e esquerdo. No centro, ten unha forma
rectangular de fondo branco que representa as dimensi&#243;ns do fotograma,
ou se o prefires, a t&#250;a &#171;folla de papel&#187;, do lado dereito atoparemos un
panel din&#225;mico que conten as propiedades da ferramenta que estea
seleccionada nese momento e, na parte inferior, un pequeno grupo de
controis relacionados coa <i>&#225;rea de traballo</i>.</p>
<p class="paragraph">
  <b>Consello:</b> Aquelo que debuxes fora do fotograma, non ser&#225; vis&#237;bel na animaci&#243;n.</p>
<center>
    <img src="./images/work_area.png">

    <p class="paragraph"><b>Fig. 15</b> &#193;rea de traballo</p>
  </center>
<p class="paragraph"><b>2.</b> <b>Panel superior de funci&#243;ns de edici&#243;n</b><br>
  Situado na parte superior esquerda, sobre a <i>&#225;rea de traballo</i>, este panel ofrece todas as funcionalidades b&#225;sicas de edici&#243;n habituais &#225; hora de traballar sobre unha ilustraci&#243;n: <i>Desfacer, Reface, Copiar, Pegar, Cortar, Eliminar, Agrupar e Desagrupar</i>.<br>
  Adicionalmente, ofrece d&#250;as opci&#243;ns complementarias moi &#250;tiles: unha <i>Grella de gu&#237;a</i> para o ilustrador, que pode activarse ou desactivarse a vontade, e o control do <i>Papel cebola</i>,
funcionalidade que perm&#237;tenos converter o fotograma actual en
semi-transparente, coa fin de poder ver os debuxos que temos tanto en
fotogramas anteriores, como en fotogramas posteriores. Na secci&#243;n &#171;<a href="chapter2.html">Vexamos un exemplo</a>&#187; afondaremos no uso desta &#250;ltima opci&#243;n.</p>
<center>
    <table>
      <tbody><tr><td style="vertical-align: top;"><img src="images/edition_panel.png"></td></tr>
<tr>
        

        <td><center><img src="./images/edition_panel_small.png"></center></td>
      </tr>
    </tbody></table>
<p class="paragraph"><b>Fig. 16</b> Panel superior de funci&#243;ns de edici&#243;n</p>
</center>
<p class="paragraph"><b>3.</b> <b>Panel de ferramentas</b><br>
  Este panel, situado no bordo esquerdo da <i>&#225;rea de traballo</i>forn&#233;cenos todas as ferramentas necesarias para debuxar e realizar 
operaci&#243;ns especiais sobre a nosa ilustraci&#243;n. Cada recurso est&#225; agrupado segundo a s&#250;a natureza nos seguintes sub-men&#250;s: 
</p>
<ul class="paragraph">
  <li><b>Menu de trazo:</b> Este men&#250; incl&#250;e todas as ferramentas de debuxo, entre elas: <i>Lapis, Tinta, Borrador, Rectangulo, Elipse, Li&#241;a,
    Polili&#241;a,</i> e a ferramenta de <i>Texto</i>.</li>
  <li><b>Men&#250; de selecci&#243;n:</b> Este men&#250; incl&#250;e a opci&#243;n de <i>Selecci&#243;n de nodo,</i> que perm&#237;tenos modificar a forma e a traxectoria duna figura a partir dos nodos de edici&#243;n e a opci&#243;n de <i>Selecci&#243;n de obxectos</i> que permite mover, rotar ou escalar calquera figura que se seleccione desde a <i>&#193;rea de traballo</i>.</li>
  <li><b>Men&#250; de recheo:</b> Este men&#250; incl&#250;e as ferramentas de <i>Recheo de bordo</i> e <i>Recheo de interior</i> sobre os obxectos seleccionados, a partir da cor que estea definida na <i>Paleta de cores</i> nese momento.</li>
  <li><b>View Menu:</b> Este men&#250; agrupa a opci&#243;n de <i>Lupa</i> , para acercar ou afastar a vista do fotograma que est&#225; en edici&#243;n e a ferramenta de <i>Arrastre</i> (m&#225;is co&#241;ecida como <i>&#171;Man&#187;</i>)), que serve para desprazar o punto de vista dun fotograma cando este est&#225; ampliado. </li>
<li><b>Men&#250; de interpolaci&#243;n:</b> a futura funcionalidade de <i>interpolaci&#243;n</i> (Tweening en ingl&#233;s)</li>
</ul>

  <center>
    <table>
      <tbody><tr>
        <td><img src="./images/toolbox.png"></td>

        <td><img src="./images/toolbox_small.png"></td>
      </tr>
    </tbody></table>
<p class="paragraph"><b>Fig. 17</b> Panel de ferramentas</p>
</center>

  <p class="paragraph"><b>4.</b> <b>Barra lateral esquerda</b></p>
<p class="paragraph"><b>Paleta de cores</b><br> Como ben indica o seu
nome, este &#233; o panel onde escollemos a cor coa que queremos trazar,
independente da figura ou forma coa que esteamos a traballar. &#201;
importante ter en conta que mentres non modifiquemos a cor actual,
absolutamente todo o que debuxemos conservar&#225; esa mesma cor, ata que
seleccionemos unha diferente.</p>
<center>
    <table>
      <tbody><tr>
        <td><img src="./images/color_palette.png"></td>

        <td><img src="./images/color_palette_small.png"></td>
      </tr>
    </tbody></table>
<p class="paragraph"><b>Fig. 18</b> Paleta de cores</p>
</center>
<p class="paragraph"><b>Consello:</b> Ten presente que ademais de utilizar cores homox&#233;neas, tam&#233;n podes utilizar <i>degradados</i>,
&#233; dicir, conxuntos de cores que se mesturan de xeito progresivo sobre
unha mesma figura, como no seguinte exemplo, no que o degradado comeza
cun verde luminoso e remata en negro:</p>
<center>
    <img src="./images/gradient.png">
<p class="paragraph"><b>Fig. 19</b> Exemplo de degradado</p>
</center>
<p class="paragraph"><b>Propiedades da pluma</b><br>A <i>pluma</i>
neste contexto, &#233; o tipo de ferramenta que usas para debuxar. Se
queres, podes pensar na pluma como o tipo de punta que lle vas a po&#241;er
ao teu lapis. Este panel perm&#237;tenos modificar as caracter&#237;sticas da
pluma, como o grosor, o tipo de bordos para os extremos dos trazos e a
continuidade da li&#241;a (por exemplo, podes facer trazos punteados, se as&#237;
o queres).</p>
<center>
    <table>
      <tbody><tr>
        <td><img src="./images/brush_properties.png"></td>

        <td><img src="./images/brush_properties_small.png"></td>
      </tr>
    </tbody></table>
<p class="paragraph"><b>Fig. 20</b> Propiedades da pluma</p>
</center>
<p class="paragraph"><b>Biblioteca de obxectos</b><br> A funci&#243;n deste
compo&#241;ente, &#233; permitirnos almacenar unha copia daquelas figuras ou
imaxes que forman parte do noso proxecto e que nos interesa volver a
utilizar noutros fotogramas da mesma animaci&#243;n ou doutro proxecto. Este
recurso &#233; moi &#250;til en animaci&#243;ns onde sabes que alg&#250;ns dos elementos
que xa debuxaches van a aparecer unha e outra vez.</p>
<center>
    <table>
      <tbody><tr>
        <td><img src="./images/library.png"></td>

        <td><img src="./images/library_small.png"></td>
      </tr>
    </tbody></table>

    <p class="paragraph"><b>Fig. 21</b> Biblioteca de obxectos</p>
  </center>

  <p class="paragraph"><b>5.</b> <b>Barra lateral dereita</b></p>
<p class="paragraph"><b>Administrador de escenas</b><br> Sabes o que &#233;
unha escena? Tentaremos dar unha definici&#243;n sinxela: pensa nun filme ou
nun anuncio da TV, fix&#225;cheste en que sempre se compo&#241;en de pequenos
fragmentos ordenados de tal xeito que contan unha historia? Estes
fragmentos adoitan seren reco&#241;ecidos doadamente polos cambios na
posici&#243;n da c&#225;mara ou el punto de vista do espectador, ou sexa, ti.<br>
Tendo claro este concepto, &#233; doado describir este compo&#241;ente: a trav&#233;s
deste panel vamos a poder crear e eliminar cada unha das escenas que
queremos inclu&#237;r no noso proxecto de animaci&#243;n.<br>
  <b>Consello:</b>
&#201; moi importante que antes de comezar co teu proxecto de animaci&#243;n,
te&#241;as moi claro cales son as escenas que vas a desenvolver e en que
orden as vas a crear. Pon moita atenci&#243;n aos consellos da secci&#243;n &#171;<a href="first.html">Primeiro o primeiro!</a>&#187;.</p>
<center>
    <table>
      <tbody><tr>
        <td><img src="./images/scenes_manager.png"></td>

        <td><img src="./images/scenes_manager_small.png"></td>
      </tr>
    </tbody></table>
<p class="paragraph"><b>Fig. 22</b> Administrador de escenas</p>
</center>
<p class="paragraph"><b>T&#225;boa de exposici&#243;ns</b><br>
  A <i>T&#225;boa de exposici&#243;ns</i>
&#233; un recurso moi importante no momento de ilustrar cada un dos
&#171;instantes&#187; que forman parte da t&#250;a animaci&#243;n. A trav&#233;s dela, podes
engadir ou eliminar novos fotogramas e novas capas a cada unha das t&#250;as
escenas. Ademais, desde este panel tes o control para seleccionar os
fotogramas que queiras editar na <i>&#193;rea de traballo</i> simplemente premendo nela. Esta funcionalidade sumada &#225; opci&#243;n de <i>papel cebola</i> do <i>Panel de funci&#243;ns de edici&#243;n</i>,
ofreceranche os elementos necesarios para que as t&#250;as animaci&#243;ns sexan
flu&#237;das. Isto ser&#225; moito m&#225;is doado de entender, despois de que vexas o
exemplo no <a href="chapter2.html">Cap&#237;tulo 2</a>.</p>
<center>
    <table>
      <tbody><tr>
        <td><img src="./images/exposure_sheet.png"></td>

        <td><img src="./images/exposure_sheet_small.png"></td>
      </tr>
    </tbody></table>
<p class="paragraph"><b>Fig. 23</b> T&#225;boa de exposici&#243;ns</p>
</center>
</body></html>