<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>



  <meta http-equiv="content-type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="../css/tupi.css"><title></title></head><body class="tupi_background3">
  <p class="title">Debuxando</p>

  <p class="paragraph">Cando nos atopemos a traballar no <i>M&#243;dulo de animaci&#243;n</i>, disporemos, automaticamente, do <i>lapis</i> como ferramenta de traballo e teremos ao noso dispor o primeiro fotograma da animaci&#243;n.
</p>

  <center>
    <img src="./images/sketching01.png">

    <p class="paragraph"><b>Fig. 36</b> Entrando no m&#243;dulo de animaci&#243;n</p>
  </center>

  <p class="paragraph">Agora, imos a trazar unha li&#241;a de gu&#237;a que defina cal vai seren a 
traxectoria da nosa bolboreta, segundo o definimos no gui&#243;n e 
aproveitando que a ferramenta <i>Lapis</i> xa est&#225; seleccionada:
</p>

  <center>
    <img src="./images/sketching02.png">

    <p class="paragraph"><b>Fig. 37</b> Trazando unha li&#241;a de gu&#237;a</p>
  </center>

  <p class="paragraph">Ten en conta que podes axustar a traxectoria da t&#250;a li&#241;a de gu&#237;a, empregando a opci&#243;n <i>Selecci&#243;n de nodos</i>, situada na barra de ferramentas:
</p>

  <center>
    <img src="./images/sketching03.png">

    <p class="paragraph"><b>Fig. 38</b> Activando a selecci&#243;n de nodos</p>
  </center>

  <p class="paragraph">Cando selecciones a li&#241;a que ves de trazar, verase as&#237;:</p>

  <center>
    <img src="./images/sketching04.png">

    <p class="paragraph"><b>Fig. 39</b> Activando a selecci&#243;n de nodos</p>
  </center>

  <p class="paragraph">Agora, modifica aqueles nodos onde a li&#241;a de gu&#237;a requira ser suavizada.
 O noso obxectivo &#233; conseguir que a curva que trazamos sexa o m&#225;is 
parecida pos&#237;bel &#225; traxectoria que queremos para a nosa bolboreta. Busca
 un resultado semellante a este:
</p>

  <center>
    <img src="./images/sketching05.png">

    <p class="paragraph"><b>Fig. 40</b> Li&#241;a de gu&#237;a corrixida</p>
  </center>

  <p class="paragraph">&#201; o momento de debuxar &#225; nosa protagonista. O primeiro que imos facer, &#233; axustar o grosor da li&#241;a ao noso gusto. Preme no bot&#243;n <i>Propiedades da pluma</i> situado na barra lateral esquerda:
</p>

  <center>
    <table>
      <tbody><tr>
        <td><img src="./images/sketching06.png"></td>

        <td><img src="./images/sketching07.png"></td>
      </tr>
    </tbody></table>

    <p class="paragraph"><b>Fig. 41</b> Propiedades da pluma</p>
  </center>

  <p class="paragraph">E axusta o valor do grosor do <i>trazo</i> conforme ao tipo de trazo co que queiras traballar:</p>

  <center>
    <img src="./images/sketching08.png">

    <p class="paragraph"><b>Fig. 42</b> Asignando un novo grosor ao trazo</p>
  </center>

  <p class="paragraph">Agora s&#243; necesitamos escoller a cor coa que queremos comezar a debuxar. Para elo, prememos no bot&#243;n <i>Paleta de cores</i>, situado na barra lateral esquerda:</p>

  <center>
    <table>
      <tbody><tr>
        <td><img src="./images/sketching10.png"></td>

        <td><img src="./images/sketching09.png"></td>
      </tr>
    </tbody></table>

    <p class="paragraph"><b>Fig. 43</b> Paleta de cores</p>
  </center>

  <p class="paragraph">Vamos a utilizar unha cor caf&#233; para o corpo e unha cor azul para as asas. Comecemos coa cor caf&#233;:</p>

  <center>
    <img src="./images/sketching11.png">

    <p class="paragraph"><b>Fig. 44</b> Seleccionando a cor caf&#233;</p>
  </center>

  <p class="paragraph">Moi ben, agora escollamos a ferramenta <i>lapis</i> e comecemos a trazar:
</p>

  <center>
    <table>
      <tbody><tr>
        <td><img src="./images/sketching13.png"></td>

        <td><img src="./images/sketching12.png"></td>
      </tr>
    </tbody></table>

    <p class="paragraph"><b>Fig. 45</b> Debuxando o corpo da bolboreta</p>
  </center>

  <p class="paragraph">Facemos o cambio da cor para as asas, e terminamos de trazar a primeira 
posici&#243;n da bolboreta. Lembra que a&#237;nda nos atopamos no fotograma num. 
1:
</p>

  <center>
    <table>
      <tbody><tr>
        <td><img src="./images/sketching14.png"></td>

        <td><img src="./images/sketching15.png"></td>
      </tr>
    </tbody></table>

    <p class="paragraph"><b>Fig. 46</b> Debuxando as asas da bolboreta</p>
  </center>

  <p class="paragraph"><b>Consello:</b> Por mor de que esta versi&#243;n a&#237;nda se atopa en desenvolvemento &#233; prob&#225;bel
 que o programa se peche de xeito inesperado nalgunhas ocasi&#243;ns. 
Recomend&#225;mosche que gardes os teus exercicios desde o inicio.
</p>

  <center>
    <img src="./images/sketching16.png">

    <p class="paragraph"><b>Fig. 47</b> Gardando o proxecto</p>
  </center>

  <p class="paragraph">Xa temos listo o primeiro fotograma de nosa animaci&#243;n, agora debemos crear os seguintes... <a href="adding_frames.html">Engadimos novos fotogramas</a></p>
</body></html>