<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>


  <meta http-equiv="content-type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="../css/tupi.css">
  <title></title>
</head><body class="tupi_background3">
  <p class="title">Primeiro o primeiro!</p>

  <p class="paragraph">Contemos unha historia! Xa tes a t&#250;a historia? Este &#233; o primeiro paso 
para crear un proxecto de animaci&#243;n. Os novatos adoitan comezar a 
debuxar sobre o primeiro fotograma do do &#171;M&#243;dulo de animaci&#243;n&#187;, sen ter 
nin a m&#225;is m&#237;nima idea do que vai acontecer no &#250;ltimo fotograma; esta, 
definitivamente, non &#233; unha boa estratexia para acadar bos resultados.
</p>

  <p class="paragraph">Como calquera outro tipo de proxecto, os de animaci&#243;n tam&#233;n requiren dun
 nivel m&#237;nimo de planificaci&#243;n. Antes de coller o lapis ou o rato do teu
 computador, ad&#237;calle un chisco de tempo a pensar no que queres facer e 
preg&#250;ntate: Cal &#233; a historia que quero contar? Non importa como de 
pequeno sexa o teu proxecto, inviste uns minutos para pensar nos 
detalles que formaran parte da t&#250;a animaci&#243;n, resolve preguntas como: 
Cales son os personaxes? Como se ver&#225;n? Por que lugar van a aparecer? 
Cara onde se van a desprazar? Cantas escenas vou inclu&#237;r? Canto m&#225;is 
longa sexa a t&#250;a animaci&#243;n, m&#225;is coidado debes ter coas respostas a 
todas estas preguntas.</p>

  <p class="paragraph">No caso dos animadores profesionais, o resultado desta planificaci&#243;n 
trad&#250;cese nun documento que se co&#241;ece como &#171;gui&#243;n&#187;, que non &#233; outra 
cousa que un texto onde se conta unha historia para que todo un equipo 
de traballo poida entendela e facela realidade. Vale, no teu caso, o teu
 equipo de traballo es ti mesmo, por&#233;n, non por iso debes desprezar a 
idea de escribir os teus propios gui&#243;ns, pois &#233; un bo exercicio para 
facerte un gran animador. Cando penses na importancia de escribir o 
gui&#243;n, pensa na importancia dos planos para un arquitecto ou das 
partituras para un m&#250;sico.
</p>

  <p class="paragraph">Para o noso exemplo, a idea que temos escollido &#233; sinxela abondo: imos 
crear unha animaci&#243;n moi simple dunha bolboreta mov&#233;ndose polo escenario
 seguindo unha traxectoria semellante &#225; da seguinte imaxe:
</p>

  <center>
    <img src="../images/butterfly.png">

    <p class="paragraph"><b>Fig. 31</b> Traxectoria da bolboreta (exemplo b&#225;sico)</p>
  </center>

  <p class="paragraph">A bolboreta aparecer&#225; polo lado esquerdo da pantalla e desaparecer&#225; pola
 dereita, nus poucos segundos. &#201; todo.
Seguramente pensar&#225;s que p&#243;dense constru&#237;r animaci&#243;ns moito m&#225;is 
complexas e interesantes, mais non esquezas que s&#243; se trata dun exemplo 
para que co&#241;ezas a ferramenta. Cando te&#241;as control sobre ela, agardamos 
que fagas grandes produci&#243;ns de animaci&#243;n e nos deixes co&#241;ecelas! &#201; 
importante que non o esquezas, como animador, acost&#250;mate a planificar os
 teus proxectos antes de po&#241;erte a debuxar como un louco.
<br>
  <br>Chegados aqu&#237;, n&#243;s xa temos listo un mini-gui&#243;n para o noso exemplo, as&#237; que <a href="new.html">imos al&#243;!</a></p>
</body></html>