<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>



  <meta http-equiv="content-type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="../css/tupi.css"><title></title></head><body class="tupi_background2">
  <p class="title">M&#243;dulo de axuda</p>
<p class="paragraph">Se est&#225;s a ler este paragrafo, ent&#243;n at&#243;paste no <b>M&#243;dulo de axuda</b>. As&#237; &#233;, a terceira lapela da <i>&#193;rea de traballo</i>
 corresponde a un pequeno manual mediante o que agardamos darche as 
m&#237;nimas pistas para que poidas gozar deste programa, creando as t&#250;as 
propias animaci&#243;ns.
</p>
<p class="paragraph">No lado dereito da <i>&#193;rea de traballo</i>, poder&#225;s ver a t&#225;boa de 
contidos deste manual. Para ir a unha secci&#243;n ou t&#237;tulo en particular, 
abonda con premer sobre o elemento que che interesa. 
</p>

  <center>
    <img src="./images/help_shot.png">

    <p class="paragraph"><b>Fig. 29</b> Interface do m&#243;dulo de axuda</p>
  </center>

  <p class="paragraph"><b>Consello:</b> Cada vez que queiras consultar o <b>M&#243;dulo de axuda</b>, s&#243; tes que premer a combinaci&#243;n <b>Ctrl + 3</b>. 

<b></b></p>

  <center>
    <img src="images/help_menu.png">

    <p class="paragraph"><b>Fig. 30</b> Men&#250; de <b>M&#243;dulos</b>, acceso a <b>Axuda</b></p>
  </center>

  <p class="paragraph">Lembra que se tes d&#250;bidas ou inquedanzas que non estean resoltas neste manual, podes buscar m&#225;is axuda na p&#225;xina do proxecto: <a href="http://www.maefloresta.com">http://www.maefloresta.com</a> Al&#237; poder&#225;s interactuar con outros usuarios e co equipo de desenvolvemento do <b>Tup&#237;</b>.
 Coa nosa comunidade, as t&#250;as achegas, ideas e suxesti&#243;ns podemos 
converter este proxecto nunha ferramenta profesional libre que permita o
 nacemento de milleiros de obras de arte animadas. Mais vaiamos paso a 
paso, &#233; o momento de <a href="first.html">ver un exemplo</a>.</p>
</body></html>