<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>


  <meta http-equiv="content-type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="../css/tupi.css">
  <title></title>
</head><body class="tupi_background5">
  <p class="title">Como colaborar</p>

  <p class="paragraph">Se queres axudar a que o <b>Tup&#237;</b> conv&#233;rtase na mellor ferramenta 
libre para a creaci&#243;n de proxectos de animaci&#243;n en 2D, existen moitas 
formas de facelo. Imos contarche algunhas delas: 
</p>

  <p class="paragraph"><b>Como animador</b></p>

  <ul class="paragraph">
    <li>Instala <b>Tup&#237;</b> no teu equipo e faite un experto creando animaci&#243;ns. 
</li>

    
  <li> F&#225;lalles aos teus amigos animadores sobre o <b>Tup&#237;.</b> 
  </li>


    

    <li>Crea manuais, v&#237;deos o calquera tipo de contido que sirva de axuda a outros animadores que desexan aprender.</li>
  <li>Crea e publica pequenos proxectos de animaci&#243;n na nosa galer&#237;a.</li>


    <li>Informa dos fallos que atopes no programa empregando a nosa p&#225;xina web.</li>

    <li>Participa nos nosos foros para preguntar polas t&#250;as d&#250;bidas ou para axudar a outros animadores.</li>
  <li>Faille unha doaz&#243;n ao proxecto. Desde 1 &#8364; ou 1 $ USD, calquera achega 
que fagas permitiranos contratar a m&#225;is. desenvolvedores, adquirir 
mellores equipos para programar e pagar o mantemento do noso sitio web. A
 t&#250;a axuda traducirase en ciclos de desenvolvemento m&#225;is curtos e 
mellores versi&#243;ns do <b>Tup&#237;</b>.</li>
</ul>

  <p class="paragraph"><b>Como desenvolvedor</b></p>

  <ul class="paragraph">
    <li>Descarga o c&#243;digo fonte do proxecto e est&#250;dao.
</li>

    <li>Usando a ferramenta &#171;<a href="http://www.stack.nl/%7Edimitri/doxygen/">Doxygen</a>&#187;, ax&#250;danos a documentar os compo&#241;entes do software de <b>Tup&#237;</b>.
<b></b></li>

    <li>Elabora e publica diagramas e axudas visuais que lle fagan doado de entender a outros programadores a arquitectura do <b>Tup&#237;</b> do xeito m&#225;is sinxelo e r&#225;pido. 
</li>

    <li>Consulta o informe de fallas e ax&#250;danos a corrixir os problemas dos que nos informan os animadores.</li>
  <li>Crea parches coas melloras e comp&#225;rteos co noso equipo de desenvolvemento. 
  </li>
  <li> Revisa o cronograma de actividades e axuda a incorporar algunha das novas funcionalidades que se atope pendente.
  </li>
</ul>
<p class="paragraph"><b>Como docente</b></p>

  <ul class="paragraph">
  <li>Convida aos teus alumnos a que co&#241;ezan e utilicen o <b>Tup&#237;</b>.</li>
<li>Invol&#250;crate na creaci&#243;n de animaci&#243;ns como parte das actividades nos teus cursos. 
</li>

    <li>Participa e incentiva aos teus alumnos na creaci&#243;n de pequenas animaci&#243;ns que sirvan como exemplo para outros alumnos.</li>

    <li>Desenvolve tutoriais e convida aos teus alumnos a que participen na s&#250;a creaci&#243;n.</li>
  </ul>

  <p class="paragraph">Independentemente do rol que escollas, todas as t&#250;as achegas como membro
 desta comunidade, ser&#225;n parte fundamental do proceso de desenvolvemento
 e mellora do <b>Tup&#237;</b>. &#218;nete ao equipo! 
</p>
</body></html>