<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>



  <meta http-equiv="content-type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="../css/tupi.css"><title></title></head><body class="tupi_background1">
  
<p class="title">Animaci&#243;n para principiantes</p>
<p class="paragraph">Animar &#233; un arte. Non. Animar &#233; un arte <i>divertido</i>. Tam&#233;n poder&#237;amos 
dicir que animar &#233; unha t&#233;cnica mediante a que lle das vida a personaxes
 ou obxectos, mais o certo &#233;, que animar &#233; moitas m&#225;is cousas... sobre 
de todo: &#233; maxia! Para falar de animaci&#243;n, debemos comezar por falar dos
 nosos ollos. Non &#233; estra&#241;o? Si, &#233;o... por&#233;n, a capacidade de xerar a 
sensaci&#243;n de animaci&#243;n xorde da nosa capacidade para ver, m&#225;is 
especificamente da forma na que vemos. Ver &#233; unha ciencia! 
</p>
<p class="paragraph">Imaxina que tes unha morea de fotograf&#237;as, agora imaxina que comezas a 
ollalas, unha por unha, tan r&#225;pido como poidas. Cada vez que te 
concentras nunha foto, os teus ollos capturan a informaci&#243;n e env&#237;ana ao
 teu cerebro para que este a procese e ti a poidas interpretar: vexo 
unha casa, vexo un barco, vexo ao meu t&#237;o!, etc. Normalmente as persoas 
creen que &#171;ver&#187; &#233; simplemente abrir os ollos, mais na realidade, cada 
vez que &#171;ollas&#187; prod&#250;cese un gran intercambio de informaci&#243;n entre os 
teus ollos e o teu cerebro, para que ti sintas que &#171;ves&#187;. Este proceso 
no &#233; doado de percibir xa que sucede nun espazo de tempo moi pequeno, 
moito menos dun segundo. 
</p>
<p class="paragraph">Agora ben, vexamos que acontece cando colles a morea de fotograf&#237;as e 
comezas a repasalas de maneira r&#225;pida, unha por unha: por cada imaxe que
 pos diante dos teus ollos, o teu cerebro comeza a facer unha 
interpretaci&#243;n dela, por&#233;n, xa que est&#225;s substitu&#237;ndo cada imaxe por 
unha nova, se  fas &#225; velocidade axeitada, o teu cerebro no alcanza a 
interpretar a totalidade da primeira foto e por&#233;n ten de comezar a 
interpretar a imaxe seguinte. Cando o fluxo de fotos &#233; grande abondo e 
pasa a gran velocidade, o teu cerebro comeza a mesturar a informaci&#243;n 
dunha imaxe, coa que lle segue e coa que lle segue, xerando a sensaci&#243;n 
de movemento, &#233; ent&#243;n cando sucede a maxia e podemos falar de animaci&#243;n.
 </p>
<p class="paragraph">Calculase que o ollo humano s&#243; &#233; quen de diferenciar ata 24 imaxes se 
tenta velas, unha tras outra, durante un segundo. Se o n&#250;mero de imaxes &#233;
 igual ou superior a 24, ent&#243;n o ollo comeza a percibir que os elementos
 que compo&#241;en a imaxe comezan a adquirir movemento. 
Un momento. Quere dicir isto que un filme non &#233; m&#225;is que unha enorme 
morea de fotograf&#237;as que pasan fronte aos meus ollos a moita velocidade?
 A resposta curta &#233;: Si! Por&#233;n, debemos ter en conta que un filme &#233; algo
 un chisco m&#225;is complexo, pois &#233; contido audio-visual, o que significa 
que tam&#233;n incl&#250;e son e unha gran cantidade de detalles t&#233;cnicos que 
deixaremos para m&#225;is adiante. 
</p>
<p class="paragraph">No mundo da animaci&#243;n, cada imaxe que a comp&#243;n, co&#241;ecese como fotograma 
(frame en ingl&#233;s), as&#237; pois, a velocidade coa que se proxecta un filme 
m&#237;dese en fotogramas por segundo (en ingl&#233;s: Frames Per Second ou FPS). 
Cantos m&#225;is fotogramas te&#241;a unha animaci&#243;n, a ilusi&#243;n de movemento ser&#225; 
moito maior e cantos menos te&#241;a, a sensaci&#243;n de fluidez irase perdendo. 
</p>
<p class="paragraph">Na actualidade, contamos cunha gran variedade de t&#233;cnicas de animaci&#243;n, 
coas que podemos crear contidos como os que vemos en filmes e v&#237;deos. 
Estas son algunhas das t&#233;cnicas: 
</p>
<ul class="paragraph">
  <li><b>Animaci&#243;n 2D:</b> Tratase dunha t&#233;cnica baseada en planos para a creaci&#243;n dos fotogramas 
que ser&#225;n parte da animaci&#243;n. Ei! un momento, Que &#233; un plano? Cando 
penses nun plano, pensa nunha superficie uniforme, semellante a unha 
folla de papel, a un campo de f&#250;tbol, ao chan da t&#250;a casa ou incluso, 
pensa nunha parede. Sei que semella estra&#241;o, m&#225;is un plano non &#233; m&#225;is 
que unha superficie plana. Agora, en termos un pouco m&#225;is complexos, un 
plano &#233; unha &#225;rea de traballo na que contas con d&#250;as dimensi&#243;ns para 
desprazarte; se o desexas, podes pensar nesas d&#250;as dimensi&#243;ns como 
arriba-abaixo e esquerda-dereita. Esas d&#250;as dimensi&#243;ns, son as que 
forman o termo 2D (d&#250;as dimensi&#243;ns) que emprega a xente cando fala de 
Animaci&#243;n 2D, por certo, unha das primeiras t&#233;cnicas de animaci&#243;n da 
historia. Se observas os bordos dunha folla de papel e te concentras no 
bordo inferior e no bordo esquerdo, decataraste de que son como d&#250;as 
li&#241;as rectas que se cruzan no canto inferior esquerdo. Esas d&#250;as li&#241;as 
rectas son as que determinan o plano sobre o que podes debuxar e 
co&#241;&#233;cense tecnicamente como eixos (en matem&#225;ticas, adoitan chamalos eixo
 X e eixo Y). Resumindo, cando penses en animaci&#243;n 2D, pensa en debuxos 
animados realizados sobre unha superficie plana a partir dos trazos 
creados por un debuxante ben sexa sobre un papel, ou  xa sexa desde un 
programa de computador para animaci&#243;n 2D. Bos exemplos desta t&#233;cnica son
 a maior&#237;a de series de TV que podes ver en <a href="http://en.wikipedia.org/wiki/Cartoon_Network">Cartoon Network &#174;</a> , as&#237; como todos os cl&#225;sicos de <a href="http://en.wikipedia.org/wiki/Walt_Disney_Classics">Walt Disney Company &#174;</a>. Bot&#233;moslle un ollo a outro exemplo:<br></li>
<li style="list-style-type: none; list-style-image: none; list-style-position: outside; display: inline;">
      <center>
        <img src="../images/cibertito.png">

        <p class="paragraph"><b>Fig. 1</b> Corto Animado &#171;<b>Cibertito&#8217;s Crash&#187;</b>. T&#233;cnica: Animaci&#243;n 2D</p>
      </center>
    </li>

    <li><b>Animaci&#243;n 3D:</b> Esta t&#233;cnica &#233; algo semellante &#225; anterior, coa diferenza de que xa non 
falamos de d&#250;as dimensi&#243;ns, sen&#243;n de tres. Unha forma sinxela de pensar 
en 3D es pensar en arriba-abaixo, esquerda-dereita e adiante-atr&#225;s. Polo
 que falamos de tres eixos; (en matem&#225;ticas, adoitan chamalos eixo X, 
eixo Y e eixo Z). A diferenza da t&#233;cnica 2D, a animaci&#243;n en tres 
dimensi&#243;ns s&#243; se pode realizar a trav&#233;s de programas de computador 
especializados, que son os que se encargan de facer todos os c&#225;lculos 
necesarios para xerar cada fotograma que comp&#243;n unha animaci&#243;n. 
Empregando esta t&#233;cnica, o creador non se adica a ilustrar figuras, 
sen&#243;n a modelar obxectos e estruturas xeom&#233;tricas que despois articular&#225;
 para que poidan moverse dentro de cada fotograma da escena en 
construci&#243;n. A animaci&#243;n 3D &#233; moito m&#225;is complexa que a animaci&#243;n 2D, xa
 que o software adicado a iso debe facer os c&#225;lculos por cada punto no 
espazo, que forma parte de cada imaxe. Estes c&#225;lculos incl&#250;en: cor, 
iluminaci&#243;n e textura, entre outros. Todo isto trad&#250;cese en centos de 
miles de operaci&#243;ns matem&#225;ticas (algunhas veces mill&#243;ns!) &#233; dicir, en 
moooooito traballo! Afortunadamente, quen o fai &#233; o computador e non o 
animador. Os mellores exemplos de animaci&#243;n 3D podes atopalos en 
pel&#237;culas como: &#171;<a href="http://en.wikipedia.org/wiki/Toy_story">Toy Story&#187;</a>,
    "<a href="http://en.wikipedia.org/wiki/Finding_nemo">Buscando a Nemo</a>" e en cortos como &#171;<a href="http://en.wikipedia.org/wiki/Big_Buck_Bunny">Big Buck
    Bunny</a>&#187;, do que salientamos o seguinte fotograma: 
</li>

    <li style="list-style-type: none; list-style-image: none; list-style-position: outside; display: inline;">
      <center>
        <img src="../images/bunny.png">

        <p class="paragraph"><b>Fig. 2</b> Corto animado &#171;<b>Big
        Buck Bunny</b>&#187;. T&#233;cnica: Animaci&#243;n 3D</p>
      </center>
    </li>

    <li><b>Stop Motion:</b> Esta t&#233;cnica basease en xogar con fotograf&#237;as. Se tes unha c&#225;mara 
dixital, ser&#225; o &#250;nico que necesites para poder comezar! O procedemento &#233;
 moi sinxelo, basicamente consiste en tomar una serie de fotograf&#237;as de 
xeito continuo sobre unha escena mentres se fan pequenos cambios sobre 
os elementos que a compo&#241;en. Complexo? Non, de verdade que non o &#233;... 
propo&#241;o un exemplo moi sinxelo! Toma una pelota ou calquera obxecto que 
queiras e situao sobre unha t&#225;boa. Sit&#250;a a t&#250;a c&#225;mara nunha posici&#243;n 
fixa enfocando cara a t&#225;boa e aseg&#250;rate de que non se poida mover 
accidentalmente, este punto &#233; clave para lograr un bo efecto de 
animaci&#243;n. Ten en conta que todas as fotos que vamos a tirar, ser&#225;n 
capturadas desde a mesma posici&#243;n e co mesmo &#225;ngulo. Coloca a pelota nun
 bordo da t&#225;boa e tira a primeira foto coa pelota na s&#250;a posici&#243;n 
inicial, m&#243;vea un chisco nunha direcci&#243;n, mais s&#243; un chisco, e tira 
outra foto. M&#243;vea outra vez outro chisco na mesma direcci&#243;n e tira outra
 foto. Repite este procedemento varias veces ata que a &#250;ltima foto sexa a
 da pelota no outro bordo da t&#225;boa. Moi ben, agora olla a pantalla da 
t&#250;a c&#225;mara e comeza a pasar todas as fotos desde a primeira ata a &#250;ltima
 seguindo sempre o mesmo ritmo entre cada foto. Notar&#225;s como se percibe a
 sensaci&#243;n de que a pelota m&#243;vese cara o bordo. Iso &#233; Stop Motion! Dous 
bos exemplos da t&#233;cnica de Stop Motion podes atopalos nos filmes &#171;<a href="http://en.wikipedia.org/wiki/Corpse_Bride">A noiva cad&#225;ver</a>&#187; e &#171;<a href="http://en.wikipedia.org/wiki/The_Nightmare_Before_Christmas">Pesadelo antes do Nadal</a>&#187;. Observa a seguinte imaxe, &#233; un exemplo moi sinxelo: 
</li><li style="list-style-type: none; list-style-image: none; list-style-position: outside; display: inline;"><center>

        <p class="paragraph"><b>Fig. 3</b> Corto animado &#171;<b>El
        Gran Escape&#187;</b>. T&#233;cnica: Stop Motion</p>
      </center>
    </li>
  </ul>
<p class="paragraph">Moi ben, agora que xa temos un pouco m&#225;is claro o concepto de animaci&#243;n, vexamos de que se trata Tup&#237;!
 
Imos al&#243;, a nosa definici&#243;n &#233; b&#225;sica abondo: tratase de Software Libre 
para o dese&#241;o e a creaci&#243;n de animaci&#243;n en 2D. Un proxecto desenvolvido 
por animadores, para animadores e que agora, nesta nova etapa vive en 
constante evoluci&#243;n.<br>
Queres aprender a utilizalo? Que est&#225;s a agardar? <a href="components.html">Comecemos!</a></p>
</body></html>