<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>



  <meta http-equiv="content-type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="../css/tupi.css"><title></title></head><body class="tupi_background3">
  <p class="title">Iniciemos un proxecto</p>

  <p class="paragraph">Este &#233; o momento de abrir o <b>Tup&#237;</b> por primeira vez. 
Independentemente do entorno gr&#225;fico no que te atopes a traballar, se xa
 tes instalado o programa no teu computador, debes buscalo na secci&#243;n de
 <b>Gr&#225;ficos</b> do men&#250; principal de aplicativos:
</p>

  <center>
    <img src="./images/launching_tupi.png">

    <p class="paragraph"><b>Fig. 32</b> Abrindo o <b>Tup&#237;</b> desde Ubuntu</p>
  </center>

  
<p>Una vez aberto o programa, ver&#225;s unha pantalla como esta no teu computador:
</p>



  <center>
    <img src="./images/first_mainwindow.png">

    <p class="paragraph"><b>Fig. 33</b> Pantalla de inicio</p>
  </center>

  <p class="paragraph">Neste punto, tes d&#250;as opci&#243;ns: Crear un novo proxecto ou abrir un xa 
existente. Como esta &#233; a nosa primeira vez, imos crear un novo proxecto 
premendo na icona de <b>Novo proxecto</b>:
</p>

  <center>
    <img src="./images/new_project.png">

    <p class="paragraph"><b>Fig. 34</b> Creando un novo proxecto</p>
  </center>

  <p class="paragraph">No cadro de di&#225;logo que aparece na pantalla, debemos introducir a 
informaci&#243;n b&#225;sica do proxecto: un nome para o ficheiro, o nome do 
autor, a dimensi&#243;n que lle queremos dar &#225; nosa animaci&#243;n e a cantidade 
de fotogramas por segundo (FPS) cos que queremos traballar inicialmente.
<br></p>
<p>Para este exemplo, s&#243; imos encher os dous primeiros campos e deixar os outros cos seus valores predeterminados:
</p>



  <center>
    <img src="./images/new_project_dialog.png">

    <p class="paragraph"><b>Fig. 35</b> Di&#225;logo de configuraci&#243;n dun novo proxecto</p>
  </center>

  <p class="paragraph">Ao premer no bot&#243;n <b>Aceptar</b>, a &#225;rea de traballo estar&#225; dispo&#241;&#237;bel para comezar co noso proxecto. O punto de partida ser&#225; sempre o <i>M&#243;dulo de animaci&#243;n</i> e m&#225;is especificamente, o primeiro fotograma da animaci&#243;n. Moi ben, estamos listos para&nbsp;&nbsp;<a href="drawing.html">comezar a debuxar!</a></p>
</body></html>