<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>

  <meta http-equiv="content-type" content="text/html; charset=US-ASCII">
  <link rel="stylesheet" type="text/css" href="../css/tupi.css"></head><body class="tupi_background1">
<p class="title">A nosa visi&#243;n e a Licenza</p>
<p class="paragraph">Como proxecto de software, a nosa filosof&#237;a
basease en compartir e difundir o co&#241;ecemento, garantindo o acceso a
calquera persoa que desexe usar, copiar ou modificar o c&#243;digo fonte de <b>Tup&#237;</b> En funci&#243;n destas directivas, temos escollido licenciar este software baixo os termos da licenza GPL (versi&#243;n 3). Polo que, <b>Tup&#237;</b> &#233; Software Libre e estades todos convidados a participar e vincularse a este proxecto.</p>
<p class="paragraph">Podes consultar o contido orixinal da Licenza en: <a href="http://fsf.org/">http://fsf.org/</a></p>
<p class="subtitle">A seguir vai unha traduci&#243;n <span style="font-weight: bold;">non oficial</span> ao galego</p>
<p class="subtitle">This is an unofficial translation of the GNU General Public License into galician. It was not published by
the Free Software Foundation, and does not legally state the distribution terms for software that uses the
GNU GPL only the original English text of the GNU GPL does that. However, we hope that this translation
will help galician speakers understand the GNU GPL better.</p>
<p class="subtitle"> 

A presente &#233; unha traduci&#243;n non oficial da licenza p&#250;blica xeral de GNU ao galego. Non foi publicada pola
Fundaci&#243;n para o Software Libre nin estabelece legalmente os termos de difusi&#243;n para o software que se rexa
pola licenza p&#250;blica xeral de GNU (GNU GPL, polas s&#250;as siglas en ingl&#233;s); a &#250;nica que o fai &#233; a versi&#243;n
orixinal en ingl&#233;s da GNU GPL. No entanto, esperamos que esta traduci&#243;n axude as e os galegofalantes a
comprender mellor a GNU GPL.</p>
<p class="subtitle">

LICENZA P&#218;BLICA XERAL DE GNU</p>
<p class="subtitle">

Versi&#243;n 3, 29 de xu&#241;o de 2007</p>
<p class="subtitle">

Copyright (C) 2007 Free Software Foundation, Inc.</p>
<p class="subtitle">

Autor&#237;zase a reproduci&#243;n e difusi&#243;n das copias do presente documento de licenza, pero proh&#237;bese a
modificaci&#243;n de calquera das s&#250;as partes.</p>
<p class="subtitle">

Pre&#225;mbulo</p>
<p class="subtitle">

A licenza p&#250;blica xeral de GNU (GNU GPL, polas s&#250;as siglas en ingl&#233;s) &#233; unha licenza libre e gratu&#237;ta con
dereito de copia para software (soporte l&#243;xico) e outros tipos de obras.</p>
<p class="subtitle">

As licenzas para a maior&#237;a do software e outras obras de &#237;ndole pr&#225;ctica est&#225;n dese&#241;adas para privar &#225;s
persoas da liberdade para difundir e modificar as obras. Pola contra, a licenza p&#250;blica xeral de GNU garante
a libre distribuci&#243;n e modificaci&#243;n de todas as versi&#243;ns dun programa, co fin de asegurarlle a dita liberdade 
a todas as persoas usuarias. Na Fundaci&#243;n para o Software Libre utilizamos a Licenza P&#250;blica Xeneral de GNU 
para a maior&#237;a do noso software; tam&#233;n se lle aplica a calquera outra obra publicada desta maneira polos seus 
autores ou autoras. Vostede tam&#233;n pode aplicala aos seus programas.</p>
<p class="subtitle">

Cando falamos de software libre, refer&#237;monos &#225; liberdade, non ao prezo. As nosas licenzas p&#250;blicas xerais
est&#225;n dese&#241;adas para garantirlle a vostede a liberdade de distribu&#237;r copias de software libre (e cobrar por
elas, se as&#237; o desexa), obter o c&#243;digo fonte, ou ter a posibilidade de obtelo, modificar o software ou
utilizar partes del en novos programas libres, e saber que pode facer estas cousas.</p>
<p class="subtitle">

Para protexer os seus dereitos, necesitamos evitar que outras persoas ou entidades lle neguen estes dereitos
ou lle pidan que renuncie a eles. Por tanto, no caso de que vostede distrib&#250;a ou modifique este software,
ter&#225; certas responsabilidades co fin de garantir a liberdade de uso.</p>
<p class="subtitle">

Por exemplo, se vostede distrib&#250;e copias dun programa desta natureza, xa sexa de forma gratu&#237;ta ou a cambio
de di&#241;eiro, debe estender &#225;s persoas destinatarias do software (soporte l&#243;xico) as mesmas liberdades que lle 
foron outorgadas a vostede. Debe asegurarse de que  tam&#233;n reciban ou te&#241;an a posibilidade de obter o c&#243;digo 
fonte. E debe mostrarlles os presentes termos co fin de que co&#241;ezan os seus dereitos.</p>
<p class="subtitle">

As persoas ou entidades desenvolvedoras que utilizan a GNU GPL seguen dous pasos para protexer os dereitos
que vostede recibe: (1) declarar os dereitos de autor&#237;a do software, e (2) ofrecerlle esta licenza para que 
vostede poida copiar, distribu&#237;r e/ou modificar o software legalmente.</p>
<p class="subtitle">

Para protexer o desenvolvemento e a autor&#237;a, a GPL explica claramente que non se ofrecen garant&#237;as por este
software libre. Polo ben do p&#250;blico usuario e da protecci&#243;n da autor&#237;a, a GPL esixe que as versi&#243;ns modificadas 
se identifiquen como tales, de modo que os problemas que poidan conter estas versi&#243;ns non se lles atrib&#250;an 
erroneamente &#225;s persoas desenvolvedoras  de versi&#243;ns anteriores.</p>
<p class="subtitle">

Existen alg&#250;ns dispositivos dese&#241;ados para negarlles &#225;s persoas usuarias o acceso para instalar ou executar
versi&#243;ns modificadas do software que conte&#241;en, mentres que a industria pode facelo. Isto &#233; esencialmente
incompat&#237;bel co obxectivo de protexer a liberdade das persoas usuarias para modificar o software. O patr&#243;n
sistem&#225;tico de tal abuso d&#225;se na &#225;rea de produtos para o uso por parte de persoas a nivel individual,
precisamente unha &#225;rea na cal se volve m&#225;is inacept&#225;bel. Por tanto, dese&#241;amos esta versi&#243;n da GPL co fin de
prohibir a pr&#225;ctica en tales produtos. No caso de que eses problemas xurdisen noutras esferas, existe pola 
nosa parte unha vontade de atender a este tipo de casos en futuras versi&#243;ns da GPL, segundo se requira para 
protexer a liberdade das persoas usuarias.</p>
<p class="subtitle">

Por &#250;ltimo, todos os programas se ven ameazados constantemente por patentes de software. Os estados non
deber&#237;an permitirlles &#225;s patentes restrinxir o desenvolvemento e o uso de software en computadores para fins
xerais, pero, no caso de que isto suceda, desexamos evitar o risco especial de que as patentes que se lle
apliquen a un programa libre efectivamente outorguen tal exclusividade. Para logralo, a GPL garante a
imposibilidade do uso das patentes para apropiarse dun programa e restrinxir devandita liberdade.</p>
<p class="subtitle">

A continuaci&#243;n, incl&#250;ense os termos e condici&#243;ns particulares para a reproduci&#243;n, distribuci&#243;n e
modificaci&#243;n do software.</p>
<p class="subtitle">

TERMOS E E CONDICI&#211;NS</p>
<p class="subtitle">0. Definici&#243;ns</p>
<p class="subtitle">

Por "licenza" ent&#233;ndese a versi&#243;n 3 da licenza p&#250;blica xeral de GNU.</p>
<p class="subtitle">

O termo "copyright" (dereitos de autor&#237;a) tam&#233;n se estende &#225;s leis que protexen estes dereitos para outros
tipos de obras, tales como dese&#241;os de circu&#237;tos integrados sobre placas semicondutoras.</p>
<p class="subtitle">

Por "programa" ent&#233;ndese calquera obra inclu&#237;da nesta licenza sobre a que se poidan exercer dereitos de
autor&#237;a. Para referirnos a cada persoa licenciataria, utilizamos o termo "vostede". As persoas licenciatarias
ou destinatarias poden ser persoas ou organizaci&#243;ns.</p>
<p class="subtitle">

Por modificar unha obra ent&#233;ndese o proceso de copiar ou adaptar unha obra en forma parcial ou total dun
modo que requira autorizaci&#243;n de copyright e que non sexa a reproduci&#243;n dunha copia exacta. A obra resultante
&#233; unha versi&#243;n modificada da obra anterior ou unha obra baseada na a obra anterior.</p>
<p class="subtitle">

Por obra cuberta ent&#233;ndese o programa sen modificaci&#243;ns ou unha obra baseada no programa.</p>
<p class="subtitle">

Por propagar unha obra ent&#233;ndese calquera acci&#243;n sobre ela que, no caso de non ter autorizaci&#243;n, puidese
implicar responsabilidade, xa sexa de forma directa ou indirecta, de infrinxir as leis de dereitos de autor&#237;a 
aplic&#225;beis, salvo que tal acci&#243;n se realice nun computador ou se modifique unha copia privada. A propagaci&#243;n 
incl&#250;e a reproduci&#243;n, distribuci&#243;n (con ou sen modificaci&#243;ns), divulgaci&#243;n e, nalg&#250;ns pa&#237;ses, outras 
actividades tam&#233;n.</p>
<p class="subtitle">

Por transmitir unha obra ent&#233;ndese calquera tipo de propagaci&#243;n que lle permita a unha terceira persoa ou
entidade facer ou recibir copias. A mera interacci&#243;n cunha persoa usuaria a trav&#233;s dunha rede inform&#225;tica,
cando non se transfire unha copia, non se considera unha transmisi&#243;n.</p>
<p class="subtitle">

Unha interface de persoa usuaria interactiva mostra avisos legais apropiados na medida en que, dun modo
pr&#225;ctico e ben vis&#237;bel, (1) mostre un aviso de copyright apropiado e (2) informe a persoa usuaria de que non
se ofrecen garant&#237;as pola obra (salvante que efectivamente se ofrezan garant&#237;as) e que as persoas licenciatarias 
poden transmitir a obra conforme as disposici&#243;ns desta licenza, ademais de mostrar a forma en que se pode 
consultar unha copia desta licenza. Se a interface presenta unha lista de comandos da persoa usuaria ou 
opci&#243;ns, tales como un men&#250;, a lista debe inclu&#237;r un &#237;tem vis&#237;bel que cumpra con este criterio.</p>
<p class="subtitle">1. C&#243;digo fonte</p>
<p class="subtitle">

O c&#243;digo fonte dunha obra &#233; o formato preferido da obra para realizar modificaci&#243;ns nela. Por c&#243;digo obxecto
ent&#233;ndese calquera formato dunha obra que non sexa c&#243;digo fonte.</p>
<p class="subtitle">

Unha interface est&#225;ndar &#233; unha interface que pode ser unha norma oficial, segundo o defina un organismo de
normas reco&#241;ecido, ou ben, no caso de interfaces espec&#237;ficas para unha linguaxe de programaci&#243;n particular,
unha interface de uso xeneralizado entre as persoas desenvolvedoras que traballan con esa linguaxe.</p>
<p class="subtitle">

As bibliotecas de sistema dunha obra execut&#225;bel comprenden calquera cousa, non sendo a obra na s&#250;a totalidade,
que (a) incl&#250;a na forma normal de empaquetamento do compo&#241;ente principal, pero que non sexa por si mesma o
compo&#241;ente principal, e (b) sirva unicamente para permitir o uso da obra con tal compo&#241;ente principal ou
para implementar unha interface est&#225;ndar para a cal exista a disposici&#243;n do p&#250;blico unha implementaci&#243;n en 
forma de c&#243;digo fonte. Un compo&#241;ente principal, neste contexto, &#233; un compo&#241;ente fundamental (n&#250;cleo, sistema 
de xanelas, etc.) do sistema operativo espec&#237;fico (se houber) no que funcione a obra execut&#225;bel, ou un 
compilador utilizado para producir a obra, ou un int&#233;rprete de c&#243;digo obxecto utilizado para executalo.</p>
<p class="subtitle">

A fonte correspondente para unha obra en c&#243;digo obxecto ref&#237;rese a todo o c&#243;digo fonte necesario para xerar,
instalar e (para unha obra execut&#225;bel) executar o c&#243;digo obxecto e modificar a obra, inclu&#237;das as secuencias
de comandos para controlar esas actividades. Con todo, non incl&#250;e as bibliotecas de sistema da obra, as&#237; como
tampouco ferramentas de aplicaci&#243;n xeral ou programas libres xeralmente dispo&#241;&#237;beis que se utilicen sen
modificaci&#243;ns para realizar esas actividades pero que non formen parte da obra. Por exemplo, a fonte
correspondente incl&#250;e os arquivos de definici&#243;n de interface asociados aos arquivos fonte para a obra, as&#237;
como o c&#243;digo fonte para as bibliotecas compartidas e os subprogramas vinculados de forma din&#225;mica requiridos
especificamente conforme ao seu dese&#241;o, por exemplo, mediante a comunicaci&#243;n de datos intr&#237;nseca ou o
control de fluxo entre eses subprogramas e outras partes da obra.</p>
<p class="subtitle">

A fonte correspondente non necesita inclu&#237;r nada que as persoas usuarias poidan rexenerar automaticamente
doutras partes da fonte correspondente.</p>
<p class="subtitle">

A fonte correspondente para unha obra en c&#243;digo fonte &#233; esa mesma obra.</p>
<p class="subtitle">2. Permisos b&#225;sicos</p>
<p class="subtitle">

Todos os dereitos que se outorgan conforme a esta licenza out&#243;rganse coa protecci&#243;n do copyright que ampara
o programa e son irrevog&#225;beis cando se cumpran as condici&#243;ns estabelecidas. Esta licenza autoriza en forma
expresa e ilimitada a executar o programa sen modificaci&#243;ns. O produto obtido a partir da execuci&#243;n dunha
obra amparada est&#225; cuberto por esta licenza unicamente se o produto, dado o seu contido, constit&#250;e unha obra
amparada. Esta licenza reco&#241;ece os seus dereitos de uso razo&#225;bel e outros equivalentes, conforme as leis de
copyright.</p>
<p class="subtitle">

Vostede pode crear, executar e propagar obras amparadas que non transmita, sen condici&#243;ns na medida en que a
s&#250;a licenza siga vixente dalgunha outra maneira. Vostede pode transmitir obras amparadas a terceiras persoas
co &#250;nico fin de que estes realicen modificaci&#243;ns exclusivamente para vostede, ou que lle proporcionen os
medios para executar esas obras, con tal de que vostede cumpra cos termos desta licenza no que respecta &#225;
transmisi&#243;n de calquera material que exceda o seu control do copyright. Quen desta maneira creen ou executen 
as obras amparadas para vostede deben facelo exclusivamente no seu nome, baixo a s&#250;a direcci&#243;n e control e 
sobre a base de termos que lles prohiban facer copias do seu material protexido por dereitos de autor&#237;a f&#243;ra 
da relaci&#243;n que mante&#241;en con vostede. <br>
</p>
<p class="subtitle">A transmisi&#243;n baixo calquera outra circunstancia perm&#237;tese unicamente conforme &#225;s condici&#243;ns que se describen
a continuaci&#243;n. Proh&#237;bese sublicenciar; a secci&#243;n 10 fai que sexa innecesario. <br>
</p>
<p class="subtitle">3. Protecci&#243;n dos dereitos legais das persoas usuarias fronte &#225; Lei antievasi&#243;n</p>
<p class="subtitle">

Ningunha obra amparada se considerar&#225; parte dunha medida tecnol&#243;xica efectiva conforme a calquera lei
aplic&#225;bel que cumpra as obrigas do artigo 11 do tratado de copyright OMPI (Organizaci&#243;n Mundial da Propiedade
Intelectual, WIPO polas s&#250;as siglas en ingl&#233;s) adoptado o 20 de decembro de 1996 ou a leis similares que
prohiban ou restrinxan a evasi&#243;n de devanditas medidas.</p>
<p class="subtitle">

Cando vostede transmite unha obra amparada, renuncia a calquera facultade legal de prohibir a evasi&#243;n de
medidas tecnol&#243;xicas na medida en que a evasi&#243;n se realice ao facer uso dos dereitos que se outorgan conforme
a esta licenza con respecto &#225; obra amparada, e nega calquera intenci&#243;n de restrinxir o uso ou a modificaci&#243;n
da obra como unha forma de facer valer, en contra das persoas usuarias da obra, os seus dereitos legais ou
os dereitos legais de terceiras partes para prohibir a evasi&#243;n de medidas tecnol&#243;xicas. <br>
</p>
<p class="subtitle">4. Transmisi&#243;n de copias literais</p>
<p class="subtitle">

Vostede pode transmitir copias literais do c&#243;digo fonte do programa tal cal o reciba, por calquera medio,
coa condici&#243;n de que publique dun modo vis&#237;bel e adecuado un aviso de copyright apropiado en cada copia;
mante&#241;a intactos todos os avisos que estabelecen que esta licenza e calquera termo non-permisivo que se
agregue conforme &#225; secci&#243;n 7 se lle aplican ao c&#243;digo; mante&#241;a intactos todos os avisos mediante os cales
se nega calquera tipo de garant&#237;a; e lles proporcione a todas as persoas destinatarias unha copia desta
licenza xunto co programa.</p>
<p class="subtitle">

Vostede pode cobrar o prezo que vostede desexe ou non cobrar nada por cada copia que transmita, e pode
ofrecer mantemento ou protecci&#243;n de garant&#237;a a cambio dunha tarifa.</p>
<p class="subtitle">


5. Transmisi&#243;n de versi&#243;ns modificadas do c&#243;digo fonte</p>
<p class="subtitle">

Vostede pode transmitir unha obra baseada no programa, ou as modificaci&#243;ns para producilo a partir do
programa, en forma de c&#243;digo fonte conforme os termos da secci&#243;n 4, coa condici&#243;n de que tam&#233;n cumpra con
todas as condici&#243;ns que se incl&#250;en a continuaci&#243;n:</p>
<p style="margin-left: 40px;" class="subtitle">

    * a) A obra debe conservar avisos vis&#237;beis que estabelezan que a modificou e que incl&#250;a a data
 correspondente. <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* b) A obra debe conservar avisos vis&#237;beis que estabelezan que se realiza conforme a esta licenza e a
 todas as condici&#243;ns que se agreguen baixo a secci&#243;n 7. Este requirimento modifica o requirimento da secci&#243;n
 4 que estabelece que se deben manter intactos todos os avisos. <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* c) Debe outorgar unha licenza pola obra completa, en forma &#237;ntegra, conforme a esta licenza, a
 calquera terceira persoa que adquira unha copia. Por tanto, esta licenza, xunto con calquera termo adicional
 aplic&#225;bel da secci&#243;n 7, apl&#237;caselle &#225; obra na s&#250;a totalidade e a todas as s&#250;as partes, independentemente do 
 modo en que se empaqueten. Esta licenza non autoriza para outorgar licenzas para a obra de ning&#250;n outro modo, 
 pero non invalida esa autorizaci&#243;n se vostede a recibiu por separado. <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* d) Se a obra tivese interfaces de usuario ou usuaria interactivas, cada unha delas deber&#225; mostrar os
 avisos legais apropiados. No entanto, se o programa tivese interfaces interactivas que non mostraren avisos
 legais apropiados, non necesita inclu&#237;los.</p>
<p class="subtitle">

Denom&#237;nase conxunto &#225; compilaci&#243;n dunha obra cuberta con outras obras diferentes e independentes que pola s&#250;a
natureza non sexan extensi&#243;ns da obra cuberta nin se combinen con ela para formar un programa m&#225;is grande nun 
volume dun medio de distribuci&#243;n ou almacenamento, se a compilaci&#243;n e o copyright consecuente non se utilizan 
para restrinxir o acceso ou os dereitos legais das persoas usuarias da compilaci&#243;n al&#233;n do que permitan as obras 
individuais. A inclusi&#243;n dunha obra inclu&#237;da nun conxunto non implica que esta licenza se lle aplique &#225;s outras 
partes do conxunto.</p>
<p class="subtitle">


6. Transmisi&#243;n de c&#243;digos que non son c&#243;digos fonte

Vostede pode transmitir unha obra cuberta en c&#243;digo obxecto conforme os termos das secci&#243;ns 4 e 5, a
condici&#243;n de que tam&#233;n transmita a fonte correspondente lex&#237;bel por m&#225;quina conforme os termos desta licenza, 
dalgunha das seguintes maneiras: <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* a) Transmisi&#243;n do c&#243;digo obxecto dentro dun produto f&#237;sico (inclu&#237;dos medios f&#237;sicos de distribuci&#243;n)
 ou incorporado a este, acompa&#241;ado da fonte correspondente nun medio f&#237;sico duradeiro habitual para o
 intercambio de software. <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* b) Transmisi&#243;n do c&#243;digo obxecto dentro dun produto f&#237;sico (inclu&#237;dos medios f&#237;sicos de distribuci&#243;n)
 ou incorporado a este, acompa&#241;ado dunha oferta escrita, que sexa v&#225;lida por un prazo m&#237;nimo de tres anos e
 polo tempo que vostede ofreza repostos ou servizo t&#233;cnico para ese modelo do produto, para proporcionarlle
 a calquera persoa que pos&#250;a o c&#243;digo obxecto (1) unha copia da fonte correspondente para todo o software do
 produto que estea cuberto por esta licenza, nun medio f&#237;sico duradeiro habitual para o intercambio de
 software, a cambio dun prezo que non exceda o custo razo&#225;bel da acci&#243;n f&#237;sica de transmitir esta fonte, ou
 (2) acceso &#225; copia da fonte correspondente desde un servidor de rede sen custo ning&#250;n. <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* c) Transmisi&#243;n de copias individuais do c&#243;digo obxecto xunto cunha copia da oferta escrita para
 proporcionar a fonte correspondente. Esta opci&#243;n perm&#237;tese unicamente en ocasi&#243;ns e para fins non comerciais,
 e s&#243; na medida en que vostede reciba o c&#243;digo obxecto cunha oferta desta natureza, conforme &#225; subsecci&#243;n 6b. <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* d) Transmisi&#243;n do c&#243;digo obxecto ofrecendo acceso desde un lugar determinado (en forma gratu&#237;ta ou
 onerosa) e ofrecendo un acceso equivalente &#225; fonte correspondente do mesmo xeito e desde o mesmo lugar sen
 custo adicional. Non &#233; necesario que lles esixa &#225;s persoas destinatarias que copien a fonte correspondente
 xunto co c&#243;digo obxecto. Se o lugar ofrecido para copiar o c&#243;digo obxecto fose un servidor de rede, a fonte 
correspondente poder&#225; estar nun servidor diferente (operado por vostede ou por unha terceira persoa) que ofreza 
posibilidades de reproduci&#243;n equivalentes, coa condici&#243;n de que se incl&#250;an, xunto co c&#243;digo obxecto, instruci&#243;ns 
claras para atopar a fonte correspondente. Independentemente de qu&#233; servidor aloxa a fonte correspondente, vostede 
mant&#233;n a obriga de se asegurar de que estea dispo&#241;&#237;bel polo tempo que sexa necesario para satisfacer estes 
requirimentos. <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* e) Transmisi&#243;n do c&#243;digo obxecto mediante transferencia entre persoas usuarias (peer to peer), coa
 condici&#243;n de que se lles informe da situaci&#243;n do c&#243;digo obxecto e a fonte correspondente da obra para o
 p&#250;blico en xeral sen custo ning&#250;n conforme &#225; subsecci&#243;n 6d.</p>
<p class="subtitle">

Non se precisa inclu&#237;r unha parte separ&#225;bel do c&#243;digo obxecto, de c&#243;digo fonte exclu&#237;do da fonte
correspondente como unha biblioteca de sistemas, para transmitir o c&#243;digo obxecto da obra.</p>
<p class="subtitle">

Por produto de persoa usuaria ent&#233;ndese (1) un produto de consumo, que &#233; calquera ben persoal tanx&#237;bel que
se utilice habitualmente para fins persoais, familiares ou dom&#233;sticos, ou (2) calquera cousa que se dese&#241;e
ou comercialice para a s&#250;a incorporaci&#243;n nunha vivenda. Ao determinar se un produto &#233; un produto de consumo, 
os casos dubidosos deber&#225;n resolverse a prol da cobertura. Para un produto espec&#237;fico que recibe unha persoa 
usuaria particular, un uso habitual &#233; o uso com&#250;n ou t&#237;pico que se lle adoita dar a ese tipo de produto, 
independentemente da condici&#243;n da persoa usuaria particular ou da forma en que a persoa usuaria particular 
utilice o produto ou das expectativas propias ou doutras persoas respecto do uso do produto. Un produto 
consid&#233;rase un produto de consumo independentemente de que que se lle poida dar usos substanciais de &#237;ndole 
comercial, industrial ou alleos ao consumo, non sendo que eses usos representen o &#250;nico modo significativo de
utilizar o produto.</p>
<p class="subtitle">

Por informaci&#243;n de instalaci&#243;n dun produto de usuario ou usuaria ent&#233;ndese calquera m&#233;todo, procedemento,
clave de autorizaci&#243;n ou outro tipo de informaci&#243;n requirida para instalar e executar versi&#243;ns modificadas
dunha obra cuberta en tal produto de usuario ou usuaria a partir dunha versi&#243;n modificada da s&#250;a fonte
correspondente. A informaci&#243;n debe ser suficiente para garantir que o funcionamento continuo do c&#243;digo
obxecto modificado non se vexa afectado ou imposibilitado s&#243; polo feito de se ter realizado a modificaci&#243;n.</p>
<p class="subtitle">

No caso de que vostede transmita o c&#243;digo obxecto dunha obra conforme a esta secci&#243;n nun produto de usuario
ou usuaria, xunto co produto da persoa usuaria ou especificamente para o seu uso nun produto de usuario ou
usuaria, e a transmisi&#243;n se produza como parte dunha transacci&#243;n mediante a cal os dereitos de posesi&#243;n e
uso deste produto de persoa usuaria se lle transfiran &#225; persoa destinataria por un prazo limitado ou
ilimitado independentemente das particularidades da transacci&#243;n), a fonte correspondente transmitida conforme
a esta secci&#243;n deber&#225; ir acompa&#241;ada da informaci&#243;n de instalaci&#243;n. Con todo, este requirimento non se lle
aplicar&#225; no caso de que nin vostede nin unha terceira persoa conserven a capacidade para instalar o c&#243;digo
obxecto modificado no produto de usuario ou usuaria (por exemplo, que a obra se instalase en memoria ROM).</p>
<p class="subtitle">

O requirimento de proporcionar informaci&#243;n de instalaci&#243;n non implica a necesidade de seguir provendo
servizo t&#233;cnico, garant&#237;as ou actualizaci&#243;ns para unha obra que sexa modificada ou instalada pola persoa
destinataria ou para o produto de persoa usuaria no cal a modificou ou instalou. Poder&#225; negarse o acceso a
unha rede cando a modificaci&#243;n en si mesma poida afectar dun modo adverso e substancial o funcionamento da
rede ou infrinxa as normas e os protocolos de comunicaci&#243;n a trav&#233;s da rede.</p>
<p class="subtitle">

A fonte correspondente que se transmita e a informaci&#243;n de instalaci&#243;n que se proporcione conforme a esta
secci&#243;n deber&#225;n presentarse nun formato sobre o cal exista documentaci&#243;n p&#250;blica (e cunha implementaci&#243;n
dispo&#241;&#237;bel para o p&#250;blico en c&#243;digo fonte) e non deber&#225;n requirir ningunha clave ou contrasinal especial
para o seu desempaquetado, lectura ou reproduci&#243;n.</p>
<p class="subtitle">


7. Termos adicionais</p>
<p class="subtitle">

Os permisos adicionais son termos que complementan os termos desta licenza ao permitir excepci&#243;ns a unha ou
m&#225;is condici&#243;ns. Os permisos adicionais que se lle aplican ao programa na s&#250;a totalidade deber&#225;n tratarse
coma se formasen parte desta licenza, na medida en que sexan v&#225;lidos conforme as leis aplic&#225;beis. No caso de
que os permisos adicionais se apliquen unicamente a unha parte do programa, esta parte poder&#225; utilizarse por
separado conforme a eses permisos, pero o programa na s&#250;a totalidade seguir&#225; rex&#233;ndose de acordo con esta
licenza independentemente dos permisos adicionais.</p>
<p class="subtitle">

Cando vostede transmita unha copia dunha obra cuberta, poder&#225; optar por eliminar calquera permiso adicional
da copia ou de calquera parte dela (en certos casos, cando vostede modifique a obra, poder&#225;n estabelecerse
permisos adicionais para requirir a s&#250;a eliminaci&#243;n). Ten autorizaci&#243;n para inclu&#237;r permisos adicionais nun
material que vostede agregue a unha obra cuberta e sobre o cal vostede pos&#250;a ou poida outorgar permisos de
copyright apropiados.</p>
<p class="subtitle">

Independentemente de calquera outra disposici&#243;n desta licenza, respecto do material que vostede agregue a
unha obra cuberta, vostede poder&#225; (na medida en que o autoricen as persoas titulares dos dereitos de
copyright do dito material) complementar os termos desta licenza cos seguintes termos: <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* a) Ausencia de garant&#237;as ou limitaci&#243;n da responsabilidade al&#233;n dos termos das secci&#243;ns 15 e 16 desta
 licenza; ou <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* b) Obriga de conservaci&#243;n de atribuci&#243;ns de autor&#237;a ou avisos legais razo&#225;beis espec&#237;ficos no dito
 material ou nos avisos legais apropiados que se mostren nas obras que o conte&#241;an; ou <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* c) Prohibici&#243;n de terxiversaci&#243;n da orixe do material, ou requirimento de que nas versi&#243;ns modificadas
 deste material se indique dun modo razo&#225;bel que son diferentes da versi&#243;n orixinal; ou <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* d) Limitaci&#243;n do uso dos nomes das persoas licenciadoras ou autoras do material para fins publicitarios;
 ou <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* e) Negativa respecto do outorgamento de dereitos conforme as leis de marcas para o uso de certos nomes
 comerciais, marcas de produtos ou marcas de servizos; ou <br>
</p>
<p style="margin-left: 40px;" class="subtitle">* f) Requirimento de indemnizaci&#243;n das persoas licenciadoras ou autoras do material por parte de calquera
 persoa que transmita o material (ou versi&#243;ns del modificadas) baixo presunci&#243;ns contractuais de
 responsabilidade das e dos destinatarios por calquera responsabilidade que esas presunci&#243;ns contractuais
 impo&#241;an directamente sobre as e os licenciadores e sobre os autores ou autoras do material. <br>
</p>
<p class="subtitle">Calquera outro termo adicional non permisivo considerarase unha restrici&#243;n adicional no contexto da secci&#243;n
10. No caso de que o programa, tal cal vostede o recibiu, ou calquera parte del conte&#241;a un aviso que indique 
que se rexe segundo esta licenza xunto cun termo que constit&#250;a unha restrici&#243;n adicional, poder&#225; eliminar o 
termo. No caso de que un documento de licenza conte&#241;a unha restrici&#243;n adicional pero permita a extensi&#243;n da 
licenza ou a transmisi&#243;n do programa conforme a esta licenza, vostede poderalle agregar &#225; obra cuberta calquera 
material conforme os termos dese documento de licenza, coa condici&#243;n de que a restrici&#243;n adicional non se mante&#241;a 
tras a extensi&#243;n da licenza ou a transmisi&#243;n do programa.</p>
<p class="subtitle">

No caso de que vostede agregue termos a unha obra cuberta conforme a esta secci&#243;n, deber&#225; inclu&#237;r nos
arquivos fonte correspondentes unha declaraci&#243;n dos termos adicionais que se lle aplican aos arquivos ou un
aviso que indique a localizaci&#243;n dos termos aplic&#225;beis.</p>
<p class="subtitle">

Poderanse estabelecer termos adicionais, sexan estes permisivos ou non permisivos, nunha licenza escrita
independente, ou a modo de excepci&#243;ns; sexa como for, aplicaranse os requirimentos mencionados anteriormente.</p>
<p class="subtitle">


8. Anulaci&#243;n</p>
<p class="subtitle">

Vostede non est&#225; autorizado para propagar ou modificar unha obra cuberta de ning&#250;n outro modo que non se
estipule nesta licenza. Calquera intento non autorizado por propagala ou modificala considerarase nulo e
levar&#225; a anulaci&#243;n autom&#225;tica dos dereitos que lle outorgou esta licenza (inclu&#237;da calquera licenza de
patente outorgada conforme o par&#225;grafo terceiro da secci&#243;n 11).</p>
<p class="subtitle">

No entanto, no caso de que deixe de violar as cl&#225;usulas desta licenza, unha persoa titular de dereitos de
copyright particular poder&#225; restitu&#237;rlle a licenza (a) de forma provisoria, at&#233; tanto tal titular dea por
finalizada a s&#250;a licenza de forma expresa e definitiva, e (b) de forma permanente, se esa persoa  titular
non notifica a infracci&#243;n por alg&#250;n medio razo&#225;bel antes dos 60 d&#237;as posteriores &#225; anulaci&#243;n.</p>
<p class="subtitle">

As&#237; tam&#233;n, a licenza que lle outorgue unha persoa titular de dereitos de copyright particular restituir&#225;selle
de forma permanente se a persoa titular lle notificar a infracci&#243;n por alg&#250;n medio razo&#225;bel, esta for a
primeira vez que vostede recibise unha notificaci&#243;n de violaci&#243;n desta licenza (por calquera obra) emitida
por esa persoa titular, e vostede emendase a infracci&#243;n nun prazo de 30 d&#237;as a partir da recepci&#243;n da
notificaci&#243;n.</p>
<p class="subtitle">

A extinci&#243;n dos seus dereitos conforme a esta secci&#243;n non anula as licenzas daquelas terceiras persoas &#225;s
que vostede lles outorgou copias ou dereitos conforme esta licenza. No caso de que os seus dereitos se
anulen e non se lle restit&#250;an de forma permanente, vostede non estar&#225; capacitado para recibir novas licenzas 
para o mesmo material conforme &#225; secci&#243;n 10.</p>
<p class="subtitle">


9. Aceptaci&#243;n innecesaria para a posesi&#243;n de copias</p>
<p class="subtitle">

Vostede non ten a obriga de aceptar esta licenza para poder recibir ou executar unha copia do programa.
De modo similar, a propagaci&#243;n secundaria dunha obra amparada que se produza unicamente como consecuencia
dunha transferencia entre persoas usuarias (peer to peer) co fin de recibir unha copia tampouco require
aceptaci&#243;n. No entanto, esta licenza &#233; o &#250;nico que o autoriza a propagar ou modificar calquera obra cuberta. 
No caso de que vostede non acepte esta licenza, os actos anteriores representar&#225;n unha violaci&#243;n das leis de 
copyright. Por tanto, ao modificar ou propagar unha obra cuberta, vostede expresa a s&#250;a aceptaci&#243;n desta 
licenza para facelo.</p>
<p class="subtitle">


10. Traspaso autom&#225;tico de licenza a destinatarios ou destinatarias subseguintes</p>
<p class="subtitle">

Cada vez que vostede transmite unha obra cuberta, o destinatario ou destinataria recibe automaticamente das
persoas licenciadoras orixinais unha licenza para executar, modificar e propagar a obra conforme esta licenza.
Vostede non &#233; respons&#225;bel de asegurar o cumprimento desta licenza por parte de terceiras persoas.</p>
<p class="subtitle">

Unha transacci&#243;n entre entidades &#233; unha transacci&#243;n mediante a cal se lle transfire o control dunha
organizaci&#243;n ou de todo o patrimonio dunha organizaci&#243;n, se subdivide unha organizaci&#243;n ou se fusionan d&#250;as
ou m&#225;is organizaci&#243;ns. No caso de que a propagaci&#243;n dunha obra cuberta se deba a unha transacci&#243;n entre
entidades, cada parte da transacci&#243;n que reciba unha copia da obra tam&#233;n recibir&#225; todas as licenzas para a
obra que o predecesor ou predecesora da parte tiver ou puider outorgar conforme o par&#225;grafo anterior, m&#225;is o
dereito de recibir do seu predecesor ou predecesora a fonte correspondente da obra, se o predecesor ou
predecesora a ten no seu poder ou pode obtela con esforzos razo&#225;beis.</p>
<p class="subtitle">

Vostede non pode impor restrici&#243;ns adicionais para o exercicio dos dereitos que se outorgan ou consolidan
conforme esta licenza. Por exemplo, vostede non pode impor tarifas, dereitos de autor&#237;a ou outros cargos a
cambio do exercicio dos dereitos que se outorgan conforme esta licenza, as&#237; como tampouco pode iniciar
acci&#243;ns legais (inclu&#237;das demandas e contestaci&#243;ns a demandas nun proceso legal) sobre a base dunha
infracci&#243;n de patentes por crear, usar, comercializar, ofrecer para a venda ou importar o programa ou
calquera parte del.</p>
<p class="subtitle">

11. Patentes</p>
<p class="subtitle">

Un colaborador ou colaboradora &#233; unha persoa ou entidade titular de dereitos de copyright que autoriza o uso
conforme esta licenza do programa ou dunha obra sobre a cal se basee o programa. A obra con licenza outorgada
desta maneira denom&#237;nase versi&#243;n en colaboraci&#243;n do colaborador ou colaboradora.</p>
<p class="subtitle">

Os dereitos de patente fundamentais dun colaborador ou colaboradora son todos os dereitos de patente baixo a
titularidade ou o control da persoa colaboradora, xa sexa porque os adquiriu tras o outorgamento desta licenza 
ou a partir dela, que poidan infrinxirse dalg&#250;n modo permitido por esta licenza para crear, usar ou vender a s&#250;a 
versi&#243;n en colaboraci&#243;n, pero non incl&#250;en dereitos que se poder&#237;an infrinxir unicamente como consecuencia de 
modificaci&#243;ns posteriores &#225; versi&#243;n en colaboraci&#243;n. Para os efectos desta definici&#243;n, o control incl&#250;e o dereito 
de outorgar sublicenzas de patente dun modo consonte cos requirimentos desta licenza.</p>
<p class="subtitle">

Cada colaborador ou colaboradora out&#243;rgalle a vostede unha licenza de patente internacional non exclusiva
libre de dereitos de autor&#237;a conforme os dereitos de patente fundamentais da ou do colaborador para crear,
usar, comercializar, ofrecer &#225; venda, importar e executar, modificar e propagar dalg&#250;n outro modo o contido da
s&#250;a versi&#243;n en colaboraci&#243;n.</p>
<p class="subtitle">

Nos tres par&#225;grafos que se incl&#250;en a continuaci&#243;n, unha licenza de patente &#233; calquera contrato ou acordo
expreso, independentemente da s&#250;a denominaci&#243;n, mediante o cal se conve&#241;a non exercer dereitos de patente
(como, por exemplo, unha autorizaci&#243;n expresa para facer uso dunha patente ou unha cl&#225;usula que estabeleza
que non se iniciar&#225;n acci&#243;ns legais por infrinxir os dereitos de patente). Por outorgar unha licenza de
patente desta natureza a outra parte ent&#233;ndese o acto de celebrar un contrato ou acordo mediante o cal se
conv&#233;n non exercer dereitos de patente en contra da dita parte.</p>
<p class="subtitle">

No caso de que vostede transmita unha obra amparada, sabendo que est&#225; suxeita a unha licenza de patente, e a
fonte correspondente da obra non estiver dispo&#241;&#237;bel para a s&#250;a reproduci&#243;n, en forma gratu&#237;ta e conforme os
termos desta licenza, a trav&#233;s dun servidor de rede de acceso p&#250;blico ou outro medio igualmente acces&#237;bel,
vostede deber&#225; (1) po&#241;er a fonte correspondente a disposici&#243;n do destinatario ou destinataria subseguinte,
(2) renunciar ao beneficio da licenza de patente para esta obra en particular, ou ben (3) tomar as medidas
necesarias para estender a licenza de patente aos destinatarios e destinatarias subseguintes dun modo acorde
cos requirimentos desta licenza. A frase sabendo que est&#225; suxeita a unha licenza de patente significa que
vostede efectivamente sabe que, de non ser pola licenza de patente, a transmisi&#243;n da obra cuberta nun pa&#237;s
ou o uso que puider darlle   as persoas destinatarias &#225; obra amparada nun pa&#237;s infrinxir&#237;an unha ou m&#225;is
patentes identific&#225;beis no dito pa&#237;s que vostede considera v&#225;lidas por diversas raz&#243;ns.</p>
<p class="subtitle">

No caso de que, en relaci&#243;n cunha transacci&#243;n ou contrato individual, vostede transmitise unha obra amparada
ou a difundise conseguindo a s&#250;a transmisi&#243;n e outorgase a algunhas das partes que reciban a obra amparada
unha licenza de patente que as autorizase a usar, difundir, modificar ou transmitir unha copia espec&#237;fica da
obra cuberta, a licenza de patente que vostede outorgue estenderase automaticamente a todos os destinatarios
e destinatarias da obra cuberta e &#225;s obras que se baseen nela.</p>
<p class="subtitle">

Unha licenza de patente consid&#233;rase discriminatoria cando non incl&#250;e dentro do seu &#225;mbito de amparo un ou m&#225;is
dos dereitos que se outorgan especificamente conforme a esta licenza, prohibe o uso de devanditos dereitos ou
se outorga como condici&#243;n de que non se usen os ditos dereitos. Vostede non debe transmitir unha obra cuberta
se fose unha das partes dun acordo con outra entidade ou persoa que se dedicase &#225; distribuci&#243;n de software,
conforme ao cal vostede debese pagarlle &#225; outra entidade ou persoa pola actividade que vostede realice con
respecto &#225; transmisi&#243;n da obra e esa entidade ou persoa outorgase a calquera das partes que reciban de vostede
a obra cuberta unha licenza de patente discriminatoria (a) en relaci&#243;n coas copias da obra cuberta
transmitidas por vostede (ou as copias que se fagan desas copias), ou (b) principalmente para compilaci&#243;ns
ou produtos espec&#237;ficos que conte&#241;an a obra cuberta e en relaci&#243;n con estes, a menos que vostede celebrase
o contrato ou que a patente se outorgase antes do 28 de marzo de 2007.</p>
<p class="subtitle">

Ningunha disposici&#243;n desta licenza deber&#225; interpretarse como excluente ou limitativa de ningunha licenza
impl&#237;cita ou outras defensas legais contra infracci&#243;ns &#225;s que, doutro xeito, vostede puidese ter dereito
conforme &#225; lei de propiedade intelectual vixente.</p>
<p class="subtitle">


12. Protecci&#243;n da liberdade de terceiras partes</p>
<p class="subtitle">

No caso de que lle fosen impostas condici&#243;ns (xa sexa por unha orde xudicial, un contrato ou dalg&#250;n outro
modo) que contradixesen as condici&#243;ns desta licenza, vostede non quedar&#225; eximido de cumprir as condici&#243;ns
desta licenza. No caso de que non poida transmitir unha obra cuberta dun modo que lle permita cumprir
simultaneamente coas obrigas estabelecidas por esta licenza e calquera outra obriga pertinente, non poder&#225;
transmitila de ning&#250;n modo. Por exemplo, no caso de que vostede acepte termos que o obriguen a cobrar dereitos
de autor&#237;a por redistribuci&#243;n a daqueles aos que vostede transmita o programa, a &#250;nica forma de satisfacer
tanto estes requirimentos como esta licenza ser&#225; absterse de transmitir o programa.</p>
<p class="subtitle">


13. Uso conxunto coa licenza p&#250;blica xeral Affero de GNU</p>
<p class="subtitle">

Independentemente de calquera outra disposici&#243;n desta licenza, vostede ten permiso para vincular ou combinar
calquera obra cuberta cunha obra con licenza outorgada conforme &#225; versi&#243;n 3 da licenza p&#250;blica xeral Affero
de GNU nunha &#250;nica obra combinada e transmitir a obra resultante. Os termos desta licenza seguir&#225;n 
aplic&#225;ndoselle &#225; parte que corresponda &#225; obra cuberta, pero os requirimentos especiais da secci&#243;n 13 da 
licenza p&#250;blica xeral Affero de GNU sobre a interacci&#243;n a trav&#233;s dunha rede aplicar&#225;nselle &#225; combinaci&#243;n como
tal.</p>
<p class="subtitle">


14. Revisi&#243;ns desta licenza</p>
<p class="subtitle">

A Fundaci&#243;n para o Software Libre poder&#225; publicar revisi&#243;ns e/ou versi&#243;ns novas da licenza p&#250;blica xeral de
GNU de cando en vez. Tales versi&#243;ns ser&#225;n de natureza semellante &#225; versi&#243;n actual, pero poder&#225;n diferir canto
aos detalles para afrontar novos problemas ou coidados.</p>
<p class="subtitle">

Cada versi&#243;n recibir&#225; un n&#250;mero de versi&#243;n que a distinga. No caso de que o programa especifique que se rexe
por unha versi&#243;n determinada da licenza p&#250;blica xeral de GNU ou calquera versi&#243;n posterior, vostede poder&#225;
optar por adoptar os termos e condici&#243;ns desta versi&#243;n espec&#237;fica ou de calquera versi&#243;n posterior que
publique a Fundaci&#243;n para o Software Libre.No caso de que o Programa non especifique un n&#250;mero de versi&#243;n da
licenza p&#250;blica xeral de GNU, vostede poder&#225; rexerse por calquera versi&#243;n que publique a Fundaci&#243;n para o
Software Libre.</p>
<p class="subtitle">

Se o programa especifica que un apoderado ou apoderada pode decidir que versi&#243;ns da licenza p&#250;blica xeral de
GNU poden aplicarse no futuro, a declaraci&#243;n p&#250;blica do apoderado ou apoderada sobre a aceptaci&#243;n dunha
versi&#243;n determinada autorizarao a vostede, de forma permanente, a optar por tal versi&#243;n para o programa.</p>
<p class="subtitle">

Poida que as versi&#243;ns posteriores da licenza se lle outorguen permisos adicionais ou diferentes. No entanto,
non se lles impor&#225;n obrigas adicionais a ningunha persoa autora ou titular de dereitos de copyright como
resultado da adopci&#243;n da versi&#243;n posterior que vostede elixa.</p>
<p class="subtitle">

15. Carencia de garant&#237;as</p>
<p class="subtitle">

O PROGRAMA OFR&#201;CESE SEN NING&#218;N TIPO DE GARANT&#205;AS, NA MEDIDA EN QUE O PERMITAN AS LEIS APLIC&#193;BEIS. SALVANTE
DISPOSICI&#211;N CONTRARIA POR ESCRITO, OS OU AS TITULARES DE DEREITOS DE AUTOR&#205;A E/OU OUTRAS PARTES PROV&#201;N O
PROGRAMA "TAL CAL" SEN GARANT&#205;AS DE NING&#218;N TIPO, XA SEXAN EXPRESAS OU IMPL&#205;CITAS, INCLU&#205;DAS, A&#205;NDA QUE NON
DE FORMA TAXATIVA, AS GARANT&#205;AS IMPL&#205;CITAS DE VALOR COMERCIAL E APTITUDE PARA UN PROP&#211;SITO DETERMINADO.
VOSTEDE ASUME TODOS OS RISCOS CON RESPECTO &#193; CALIDADE E O DESEMPE&#195;&#8216;O DO PROGRAMA. NO CASO DE QUE O PROGRAMA
TIVESE DEFECTOS, VOSTEDE ASUME O CUSTO DE TODAS AS ACTIVIDADES DE MANTEMENTO, REPARACI&#211;N OU CORRECCI&#211;N.</p>
<p class="subtitle">

16. Limitaci&#243;n da responsabilidade</p>
<p class="subtitle">

EN NING&#218;N CASO, SALVO QUE AS&#205; O DISPO&#195;&#8216;AN AS LEIS APLICABLES OU UN CONTRATO POR ESCRITO, UNHA PERSOA TITULAR
DE DEREITOS DE AUTOR&#205;A OU UNHA TERCEIRA PARTE QUE MODIFIQUE E/OU TRANSMITA O PROGRAMA SEGUNDO SE AUTORIZA
ANTERIORMENTE SER&#193; RESPONS&#193;BEL PERANTE VOSTEDE DE CALQUERA DANO, INCLU&#205;DOS OS DANOS XERAIS, ESPECIAIS,
FORTU&#205;TOS OU DERIVADOS, QUE POIDAN XURDIR DO USO OU A INCAPACIDADE DE USO DO PROGRAMA (INCLU&#205;DOS, A&#205;NDA QUE
NON EXCLUSIVAMENTE, A PERDA DE INFORMACI&#211;N, A SUBMINISTRACI&#211;N DE INFORMACI&#211;N IMPRECISA OU AS PERDAS QUE POIDAN
SUFRIR VOSTEDE OU TERCEIRAS PARTES OU A INCAPACIDADE DO PROGRAMA PARA INTERACTUAR CON OUTROS PROGRAMAS),
A&#205;NDA CANDO ESTE OU ESTA TITULAR OU TERCEIRA PARTE FOSE ADVERTIDA DA POSIBILIDADE DE TALES DANOS.</p>
<p class="subtitle">


17. Interpretaci&#243;n das secci&#243;ns 15 e 16</p>
<p class="subtitle">

No caso de que as cl&#225;usulas de ausencia de garant&#237;as e limitaci&#243;n da responsabilidade anteriores carecesen de
validez legal a nivel local conforme os seus termos, os xulgados deber&#225;n aplicar as leis locais que m&#225;is se
asimilen a unha exenci&#243;n absoluta de calquera responsabilidade civil en relaci&#243;n co programa, salvo que unha
copia do programa estea acompa&#241;ada dunha garant&#237;a ou presunci&#243;n de responsabilidade a cambio dunha tarifa.</p>
<p class="subtitle">

FIN DE TERMOS E CONDICI&#211;NS</p>
<p class="subtitle">

Como aplicar estes termos aos seus programas novos</p>
<p class="subtitle">

Se vostede desenvolve un programa novo e desexa que o p&#250;blico lle atope a maior utilidade pos&#237;bel, a mellor
maneira de logralo &#233; facer deste un software libre para que todos o poidan redistribu&#237;r e modificar conforme
a estes termos.</p>
<p class="subtitle">

Para facelo, achegue os seguintes avisos ao programa. O m&#225;is seguro &#233; engadilos ao comezo de cada arquivo
fonte co fin de que se estabeleza dun modo efectivo a exclusi&#243;n de garant&#237;as. As&#237; mesmo, cada arquivo deber&#237;a
inclu&#237;r a li&#241;a do copyright e unha ligaz&#243;n &#225; localizaci&#243;n do aviso completo.</p>
<p class="subtitle">


Copyright (C)</p>
<p class="subtitle">

Este programa &#233; software libre: vostede pode redistribu&#237;lo e/ou modificalo conforme os termos da licenza
p&#250;blica xeral de GNU publicada pola Fundaci&#243;n para o Software Libre, xa sexa a versi&#243;n 3 desta licenza ou
(&#225; s&#250;a elecci&#243;n) calquera versi&#243;n posterior.</p>
<p class="subtitle">

Este programa distrib&#250;ese co desexo de que lle resulte &#250;til, pero SEN GARANT&#205;AS DE NING&#218;N TIPO; nin sequera
coas garant&#237;as impl&#237;citas de VALOR COMERCIAL OU APTITUDE PARA UN PROP&#211;SITO DETERMINADO. Para m&#225;is informaci&#243;n,
consulte a licenza p&#250;blica xeral de GNU.</p>
<p class="subtitle">

Xunto con este programa, deb&#233;rase inclu&#237;r unha copia da licenza p&#250;blica xeral de GNU.</p>
<p class="subtitle">

De non ser as&#237;, vexa en .</p>
<p class="subtitle">

Incl&#250;a tam&#233;n informaci&#243;n de contacto que lles permita &#225;s persoas destinatarias comunicarse con vostede, xa
sexa por correo electr&#243;nico ou convencional.</p>
<p class="subtitle">

Se o programa admite a interacci&#243;n entre terminais, aseg&#250;rese de que mostre un breve aviso como o que se
incl&#250;e a continuaci&#243;n cando se inicie en modo interactivo:</p>
<p class="subtitle">

Copyright (C) <br>
</p>
<p class="subtitle">Este programa proporci&#243;nase SEN GARANT&#205;AS DE NING&#218;N TIPO; para m&#225;is informaci&#243;n escriba 'show w'.</p>
<p class="subtitle">

Este programa &#233; software libre e vostede pode redistribu&#237;lo consonte certas condici&#243;ns; para m&#225;is informaci&#243;n,
escriba 'show c'.</p>
<p class="subtitle">


Os comandos hipot&#233;ticos 'show w' e 'show c' deber&#237;an mostrar as partes correspondentes da licenza p&#250;blica
xeral. De m&#225;is est&#225; dicir que os comandos do seu programa poden ser diferentes; para unha interface gr&#225;fica
de persoa usuaria, deber&#237;a utilizar un cadro de di&#225;logo do tipo Acerca de.</p>
<p class="subtitle">

No caso de que traballe como programador ou programadora para unha entidade empregadora ou estabelecemento
educativo, aseg&#250;rese tam&#233;n de que asinen unha renuncia de copyright para o programa, se fose necesario. Para
m&#225;is informaci&#243;n verbo deste respecto e sobre como aplicar e cumprir a GNU GPL, vexa en . <br>
</p>
<p class="subtitle">A licenza p&#250;blica xeral de GNU non autoriza a inclusi&#243;n do seu programa en programas de propiedade privada.
Se o seu programa fose unha biblioteca de subrutinas, poida que considere m&#225;is &#250;til permitir a vinculaci&#243;n de
aplicaci&#243;ns de propiedade privada coa biblioteca. Se vostede desexar facer isto, utilice a licenza p&#250;blica
xeral reducida de GNU en lugar desta licenza. Pero primeiro, por favor, lea a informaci&#243;n que se incl&#250;e en .</p>
<p class="subtitle">FIN DOS TERMOS E CONDICI&#211;NS<br>
<http: www.gnu.org="" philosophy="" why-not-lgpl.html=""></http:></p>
</body></html>