<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>


  <meta http-equiv="content-type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="../css/tupi.css">
  <title></title>
</head><body class="tupi_background3">Stop Motion? &#233; pos&#237;bel!

  <p class="paragraph">Como xa lo mencionamos na <a href="init.html">introduci&#243;n</a> deste manual, <i>Stop Motion</i> &#233; unha t&#233;cnica de animaci&#243;n baseada en 
fotograf&#237;as. Debemos dicir que os v&#237;deos resultantes deste tipo de 
animaci&#243;n adoitan seren moi divertidos. Vale, e agora a pregunta do 
mill&#243;n: podo facer <i>Stop Motion</i> co <b>Tup&#237;</b>?
A resposta curta &#233; SI, por&#233;n, o compo&#241;ente adicado a este tema a&#237;nda 
precisa de moito traballo. Polo momento, a interface permite a 
realizaci&#243;n de exercicios de animaci&#243;n sinxelos, mais as metas cara ao 
futuro son moito m&#225;is ambiciosas.</p>
<p class="paragraph">Vexamos como crear un pequeno v&#237;deo usando esta t&#233;cnica:
</p>


  <ol>
    <li class="paragraph">Consegue unha c&#225;mara fotogr&#225;fica dixital. Xa que este tipo de animaci&#243;ns bas&#233;anse en fotograf&#237;as, a c&#225;mara &#233; o m&#225;is importante.
</li>

    <li class="paragraph">Escribe o gui&#243;n da t&#250;a historia, seguindo os consellos que mencionamos no &#171;<a href="first.html">primeiro cap&#237;tulo</a>&#187;.</li>

    <li class="paragraph">Consegue os recursos que necesitas para a t&#250;a historia: obxectos, persoas, etc.
</li>

    <li class="paragraph">Asegura a t&#250;a c&#225;mara nun punto fixo (ex. unha t&#225;boa ou un tr&#237;pode) 
enfocando (apuntando) cara o lugar onde vas a facer a t&#250;a escena e 
aseg&#250;rate de que a c&#225;mara non se poida mover cara os lados. Sit&#250;a os 
recursos na escena, tal e como queres que se atopen no comezo da 
animaci&#243;n.
</li>

    <li class="paragraph">Comeza a tirar unha foto por cada movemento que fagas sobre os obxectos 
ou persoas que est&#225;n na escena, sempre de acordo ao definido no gui&#243;n. 
Lembra que cada movemento debe ser moi pequeno, xa que disto depender&#225; 
que ao final a animaci&#243;n se vexa flu&#237;da e non a chimpos.
</li>

    <li class="paragraph">Cando te&#241;as capturado cada un dos momentos da historia que requires para
 as escenas, conecta a c&#225;mara &#225; computadora e descarga todas as fotos 
nun una cartafol.
</li>
  <li class="paragraph">Abre o <b>Tup&#237;</b> e <a href="new.html">crea un novo proxecto</a> .</li>
<li class="paragraph">Agora selecciona o men&#250; <i>Inserir</i> situado na parte de arriba e escolle a opci&#243;n <i>Contedor de imaxes</i>. Abrirase un cadro de di&#225;logo, solicitando que selecciones o directorio onde gardaches as fotos para a animaci&#243;n.


      <center>
        <img src="./images/stop_motion01.png">
    <p class="paragraph"><b>Fig. 65</b> Opci&#243;n de inserir un contedor (secuencia) de imaxes&gt;</p>
</center>
    </li>

    <li class="paragraph">Ao premer no bot&#243;n <i>Aceptar</i>, o programa cargar&#225; cada unha das 
imaxes nun fotograma independente e seguindo a orden alfab&#233;tica na que 
se atopen os ficheiros no directorio.


      <center>
        <img src="./images/stop_motion02.png">
    <p class="paragraph"><b>Fig. 66</b> Dialogo de selecci&#243;n do directorio que conten as imaxes</p>
</center>
    </li>

    <li class="paragraph">ISe as imaxes son moi grandes, o programa verase forzado a 
redimensionalas, xa que de seren moitas e todas son dun tama&#241;o superior a
 1 MB, &#233; moi prob&#225;bel que a t&#250;a m&#225;quina se quede sen memoria e o 
programa se bloquee.


      <center>
        <img src="./images/stop_motion03.png">
    <p class="paragraph"><b>Fig. 67</b> Mensaxe informativo no momento de inserir as imaxes</p>
</center>
    </li>

    <li class="paragraph">Cando remate o proceso de importaci&#243;n de imaxes, podes botarlle unha ollada ao teu proxecto na lapela de <i>Animaci&#243;n</i> (<b>Ctrl + 2</b>).&nbsp;</li>

    <li class="paragraph">A partires deste punto, tes d&#250;as opci&#243;ns: podes exportar o teu proxecto 
como un ficheiro de v&#237;deo, ou podes facer algo de edici&#243;n sobre as 
imaxes que desexes empregando as ferramentas de ilustraci&#243;n.
</li>

    <li class="paragraph">Se che gusta o que viches e o queres converter en v&#237;deo, volve a lapela de <i>Animaci&#243;n</i> e preme no bot&#243;n <b>Exportar</b> situado no panel inferior.
</li>

    <li class="paragraph">Segue os pasos habituais de exportaci&#243;n, descritos na secci&#243;n anterior:&nbsp; &#171;<a href="video_file.html">Creemos un ficheiro de v&#237;deo</a>&#187; e xa est&#225;! O teu proxecto de <i>Stop Motion</i> &#233; unha realidade!
</li>
  </ol>
</body></html>