<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>


  <meta http-equiv="content-type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="../css/tupi.css">
  <title></title>
</head><body class="tupi_background3">
  <p class="title">Creemos un ficheiro de v&#237;deo</p>

  <p class="paragraph">Una vez consideres que todo est&#225; listo para publicar a t&#250;a obra de arte,
 &#233; o momento de crear o ficheiro de v&#237;deo. Para elo, debes entrar no <b>M&#243;dulo de reproduci&#243;n</b> e premer sobre o bot&#243;n <b>Exportar</b>.
</p>

  <center>
    <img src="./images/exporting01.png">

    <p class="paragraph"><b>Fig. 60</b> Opci&#243;n Exportar no Modulo de reproduci&#243;n</p>
  </center>

  <p class="paragraph">Ter&#225;s un cadro de di&#225;logo que axudarache durante todo o proceso de 
exportaci&#243;n. O primeiro que debes escoller, &#233; o formato no que queres o 
v&#237;deo da t&#250;a animaci&#243;n:
</p>

  <center>
    <img src="./images/exporting02.png">

    <p class="paragraph"><b>Fig. 61</b> Di&#225;logo de selecci&#243;n de formato</p></center>
<p>A seguir, debes seleccionar as escenas que queres exportar. Neste caso, tratase s&#243; dunha:
</p>



  <center>
    <img src="./images/exporting03.png">

    <p class="paragraph"><b>Fig. 62</b> Di&#225;logo de selecci&#243;n de escenas</p>
  </center>

  <p class="paragraph">Finalmente, selecciona o nome do ficheiro, a ruta onde queres exportalo e
 se o desexas, podes cambiar a dimensi&#243;n &#225; que queres que se cree o 
v&#237;deo:
</p>

  <center>
    <img src="./images/exporting04.png">

    <p class="paragraph"><b>Fig. 63</b> Di&#225;logo de creaci&#243;n do ficheiro</p>
  </center>

  <p class="paragraph">Una vez que premas o bot&#243;n <b>Exportar</b>, o teu v&#237;deo estar&#225; listo 
para ser visto por todo o mundo! Se o desexas, podes publicalo na nosa 
galer&#237;a de proxectos, s&#243; tes que escribirnos comentando o teu desexo de 
facelo p&#250;blico, seguindo as nosas instruci&#243;ns.
</p>

  <center>
    <img src="./images/final_video.png">

    <p class="paragraph"><b>Fig. 64</b> V&#237;deo final</p>
  </center>
<p class="paragraph">You can view the source file of this
  project, which you can find <a href="http://www.maefloresta.com/portal/files/butterfly.tup">aqu&#237;</a> as&#237; como o ficheiro de <a href="http://www.maefloresta.com/portal/files/butterfly.avi">v&#237;deo listo para ver</a>. Non se trata dunha obra de arte revolucionaria, mais agardamos que che motive a crear grandes proxectos!
</p>
</body></html>