<html>
<head>
<link rel="stylesheet" type="text/css" href="../css/tupi.css" />
</head>
<body class="tupi_background2">
<center><b>[ Under Translation ]</b></center>
<p class="title">Main Components</p>
<p class="paragraph">
<b>Tupi</b> is a suite of tools for 2D animation created for 8-100 years old children. When you think of <b>Tupi</b>, think of it as a toolbox full of different components, each designed for a specific task. Now, let's take a look at each of the parts that make our work environment, this is the first step you must take to start using <b>Tupi</b>. 
</p>
<p class="paragraph">
<b>Note:</b><i> Because we are still in a beta phase of this development, it is likely that some options and/or features within the interface are modified or change of place with every release, much of the information found in this manual is subject to correction in future versions.</i> 
</p>
<p class="paragraph">
The following is a typical display of the running application: 
</p>
<center>
<img src="./images/tupi_gui.png"/>
<p class="paragraph">
<b>Fig #4.</b> <b>Tupi</b>'s GUI
</p>
</center>
<p class="paragraph">
Now, let's take a closer look to its components: 
</p>
<center>
<p class="paragraph">
<img src="./images/tupi_gui_components.png"/>
<p class="paragraph">
<b>Fig #5.</b> Diagram of the <b>Tupi</b>'s Components
</p>
</center>
<ol>
<li class="item"> <b>Top Side Menu:</b> it is the conventional menu located at the top side of most programs. It is separated by categories (<i>File</i>, <i>Edit</i>, <i>Insert</i>, <i>Window</i>, <i>Modules</i> and <i>Help</i>), all options of the program. 
<center>
<img src="./images/top_menu.png"/>
<p class="paragraph">
<b>Fig #6.</b> Barra de Men&uacute; Superior 
</p>
</center>
</li>
<li class="item"> <b>Panel de Funciones B&aacute;sicas:</b> se encuentra compuesto por botones asociados a las tareas b&aacute;sicas en la administraci&oacute;n de archivos del programa tales como: Crear nuevo proyecto, abrir proyecto existente, guardar, guardar como y cerrar proyecto actual.
<center>
<img src="./images/basic_panel.png"/>
<p class="paragraph">
<b>Fig #7.</b> Panel de Funciones B&aacute;sicas 
</p>
</center>
</li>
<li class="item"> <b>&Aacute;rea de Trabajo:</b> es el &aacute;rea principal de la aplicaci&oacute;n, es decir, el espacio donde dise&ntilde;as, construyes y visualizas tus animaciones. El &aacute;rea de trabajo se encuentra conformada por cuatro pesta&ntilde;as, cada una de las cuales contiene uno de los siguientes m&oacute;dulos:
<center>
<img src="./images/tabs.png"/>
<p class="paragraph">
<b>Fig #8.</b> Pesta&ntilde;as de las &aacute;reas de trabajo 
</p>
</center>
<ul>
<li class="item"><b>M&oacute;dulo de Ilustraci&oacute;n:</b> a trav&eacute;s de su interfaz, en este m&oacute;dulo construyes los gr&aacute;ficos que har&aacute;n parte de cada marco que estar&aacute; contenido en tu animaci&oacute;n. En otras palabras, este m&oacute;dulo no es otra cosa m&aacute;s que un peque&ntilde;o editor de gr&aacute;ficos vectoriales muy sencillo (&iexcl;por ahora!). 
</li>
<li class="item"><b>M&oacute;dulo de Animaci&oacute;n:</b> b&aacute;sicamente, se trata de un visor que puedes consultar en cualquier momento para darte una idea de como est&aacute; quedando tu animaci&oacute;n. 
</li>
<li class="item"><b>M&oacute;dulo de Ayuda:</b> este es el m&oacute;dulo que precisamente est&aacute;s consultando en este momento. 
</li>
<li class="item"><b>M&oacute;dulo de Noticias:</b> es una ventana directa a nuestra cuenta en <a href="http://www.twitter.com">Twitter</a>. As&iacute; podr&aacute;s estar enterado de las &uacute;ltimas noticias sobre este proyecto, como el lanzamiento de nuevas versiones, las funcionalidades implementadas en la versi&oacute;n de desarrollo, novedades, etc.
<br/>
</li>
</ul>
</li>
<li class="item"> <b>Barra Lateral Izquierda:</b> en este componente se encuentran tres botones asociados a algunas funcionalidades del m&oacute;dulo de ilustraci&oacute;n: 
<center>
<img src="./images/left_bar.png"/>
<p class="paragraph">
<b>Fig #9.</b> Barra Lateral Izquierda
</p>
</center>
<ul>
<li class="item"> <b>Paleta de colores:</b> este bot&oacute;n despliega un panel a trav&eacute;s del cual puedes escoger el color o gradiente que quieras utilizar al momento de pintar con cualquier tipo de brocha. 
</li>
<li class="item"> <b>Propiedades de Brocha:</b> este bot&oacute;n despliega un panel con las propiedades actuales de la brocha, como por ejemplo, el grueso de la misma y algunas caracter&iacute;sticas del trazo. 
</li>
<li class="item"> <b>Librer&iacute;a de objetos:</b> este bot&oacute;n despliega un panel con la interfaz de administraci&oacute;n de objetos de la librer&iacute;a asociada al proyecto. Si tienes un objeto o una imagen en particular que quieras almacenar y reutilizar en diferentes marcos de tu animaci&oacute;n, este componente te ser&aacute; de mucha utilidad. 
<br/>
</li>
</ul>
</li>
<li class="item"> <b>Barra Lateral Derecha:</b> similar a la izquierda, s&oacute;lo que contiene botones asociados al proceso de animaci&oacute;n:
<center>
<img src="./images/right_bar.png"/>
<p class="paragraph">
<b>Fig #10.</b> Barra Lateral Derecha
</p>
</center>
<ul>
<li class="item"> <b>Manejador de Escenas:</b> este bot&oacute;n despliega un panel que permite la administraci&oacute;n de las escenas que componen una animaci&oacute;n. A&uacute;n no sabes qu&eacute; es una escena? No te preocupes, m&aacute;s adelante hablaremos de ello.
</li>
<li class="item"> <b>Tabla de Exposici&oacute;n:</b> este bot&oacute;n despliega un panel que permite visualizar la tabla de exposici&oacute;n de cada escena. Aunque suena complejo, esta tabla en realidad simplemente es una lista de los marcos sobre los cuales vas a ilustrar tu animaci&oacute;n. A trav&eacute;s de este componente, puedes administrar las capas y los marcos de tu proyecto. &iquest;Ya sabes qu&eacute; es una capa? Veamos una definici&oacute;n sencilla: imagina que tomas un poco de pintura roja y cubres una hoja de papel con este color y dejas que se seque, luego aplicas color verde sobre la misma hoja, esperas un rato y entonces aplicas azul. A pesar de que al final, tu hoja lucir&aacute; del &uacute;ltimo color que usaste, en realidad sabes que debajo hay otros colores. Piensa en cada uno de esos colores, como capas, es decir, niveles de pintura que t&uacute; mismo defines sobre un marco. Las capas son muy &uacute;tiles para lograr cierto tipo de efectos y t&eacute;cnicas que descubrir&aacute;s con la pr&aacute;ctica. 
</li>
<li class="item"> <b>Manual de Ayuda:</b> este bot&oacute;n despliega el manual que est&aacute;s consultando en este momento.
<br/>
</li>
</ul>
</li>
<li class="item"> <b>Barra Inferior:</b> sobre esta regi&oacute;n encontrar&aacute;s un s&oacute;lo bot&oacute;n, se trata de la opci&oacute;n que activa el panel de la <i>L&iacute;nea de Tiempo</i>. Este herramienta, bastante utilizada por animadores de otros programas, te permite administrar capas y marcos, adem&aacute;s de visualizar la forma en que se desenvuelven los fragmentos de tu animaci&oacute;n en tiempo real.
<center>
<img src="./images/bottom_bar.png"/>
<p class="paragraph">
<b>Fig #11.</b> Barra Inferior 
</p>
</center>
</li>
<li class="item"> <b>Panel de Propiedades:</b> esta zona se crea temporalmente cada vez que haces clic sobre uno de los botones que se encuentran en las barras laterales o en la inferior. Aunque en la imagen inicial (<b>Fig. #5</b>), el panel aparece en la parte derecha de la interfaz, dependiendo de donde se encuentre el bot&oacute;n que escojas, puede aparecer del lado izquierdo o inclusive, en la parte inferior. Si vuelves a dar clic sobre el bot&oacute;n que inicialmente escogiste, entonces el panel de propiedades se cierra. 
<br/>
</li>
<li class="item"> <b>Barra de Estado:</b> ubicada en la parte inferior del programa, esta barra por ahora s&oacute;lo cumple una misi&oacute;n: desplegar las coordenadas (x,y) en las que se encuentra el cursor del rat&oacute;n a medida que se mueve sobre el <i>&Aacute;rea de Trabajo</i> en el <a href="illustration.html"><i>M&oacute;dulo de Ilustraci&oacute;n</i></a>. 
<center>
<img src="./images/status_bar.png"/>
<p class="paragraph">
<b>Fig #12.</b> Barra de Estado
</p>
</center>
</li>
</ol>
</body>
</html>
