<html>
<head>
<link rel="stylesheet" type="text/css" href="../css/tupi.css" />
</head>
<body class="tupi_background1">
<center><b>[ Under Translation ]</b></center>
<p class="title">Nuestra Visi&oacute;n y Licencia</p>
<p class="paragraph">
Como proyecto de software, nuestra filosof&iacute;a se basa en compartir y difundir
conocimiento, garantizando el acceso a cualquier persona que desee usar, copiar
o modificar el c&oacute;digo fuente de <b>Tup&iacute;</b>.
En funci&oacute;n de estas directivas, hemos escogido licenciar este software bajo
los t&eacute;rminos de la licencia GPL (ver 3). Por tanto, <b>Tup&iacute;</b> es Software Libre y
todos est&aacute;n invitados a participar y vincularse a este proyecto.
</p>
<p class="paragraph">
Este es el contenido legal de nuestra licencia:
</p>
<p class="subtitle">
LICENCIA P&Uacute;BLICA GENERAL DE GNU
</p>
<p class="paragraph">
Versi&oacute;n 3, 29 de junio de 2007
</p>
<p class="paragraph">
Copyright &#169; 2007 Free Software Foundation, Inc. &#60;<b><a href="http://fsf.org">http://fsf.org/</a></b>&#62;
</p>
<p class="paragraph">
Se autoriza la reproducci&oacute;n y distribuci&oacute;n de las copias del presente documento de licencia, pero se proh&iacute;be la modificaci&oacute;n de cualquiera de sus partes.
</p>
<p class="subtitle">
Pre&aacute;mbulo
</p>
<p class="paragraph">
La Licencia P&uacute;blica General de GNU (GNU GPL, por sus siglas en ingl&eacute;s) es una licencia libre y gratuita con derecho de copia para software y otros tipos de obras.
</p>
<p class="paragraph">
Las licencias para la mayor&iacute;a del software y otras obras de &iacute;ndole pr&aacute;ctica est&aacute;n dise&ntilde;adas para privarle de la libertad para distribuir y modificar las obras. Por el contrario, la Licencia P&uacute;blica General de GNU garantiza la libre distribuci&oacute;n y modificaci&oacute;n de todas las versiones de un programa, a fin de asegurarle dicha libertad a todos los usuarios. En la Fundaci&oacute;n para el Software Libre utilizamos la Licencia P&uacute;blica General de GNU para la mayor&iacute;a de nuestro software; tambi&eacute;n se aplica a cualquier otra obra publicada de esta manera por sus autores. Usted tambi&eacute;n puede aplicarla a sus programas.
</p>
<p class="paragraph">
Cuando hablamos de software libre, nos referimos a la libertad, no al precio. Nuestras Licencias P&uacute;blicas Generales est&aacute;n dise&ntilde;adas para garantizarle a usted la libertad de distribuir copias de software libre (y cobrar por ellas, si as&iacute; lo desea), obtener el c&oacute;digo fuente, o tener la posibilidad de obtenerlo, modificar el software o utilizar partes del mismo en nuevos programas libres, y saber que puede hacer estas cosas.
</p>
<p class="paragraph">
Para proteger sus derechos, necesitamos evitar que otros le nieguen estos derechos o le pidan que renuncie a los mismos. Por lo tanto, en el caso de que usted distribuya o modifique este software, tendr&aacute; ciertas responsabilidades a fin de garantizar la libertad de los dem&aacute;s.
</p>
<p class="paragraph">
Por ejemplo, si usted distribuye copias de un programa de esta naturaleza, ya sea en forma gratuita o a cambio de dinero, debe extender a los destinatarios del software las mismas libertades que le fueron otorgadas a usted. Debe asegurarse de que ellos tambi&eacute;n reciban o tengan la posibilidad de obtener el c&oacute;digo fuente. Y debe mostrarles los presentes t&eacute;rminos a fin de que conozcan sus derechos.
</p>
<p class="paragraph">
Los desarrolladores que utilizan la GNU GPL siguen dos pasos para proteger los derechos que usted recibe: (1) declarar los derechos de autor del software, y (2) ofrecerle esta Licencia para que usted pueda copiar, distribuir y/o modificar el software legalmente.
</p>
<p class="paragraph">
A fin de proteger a los desarrolladores y autores, la GPL explica claramente que nos se ofrecen garant&iacute;as por este software libre. Por el bien de los usuarios y de los autores, la GPL exige que las versiones modificadas se identifiquen como tales, de modo que los problemas que puedan contener estas versiones no se atribuyan err&oacute;neamente a los autores de versiones anteriores.
</p>
<p class="paragraph">
Existen algunos dispositivos dise&ntilde;ados para negarles a los usuarios el acceso para instalar o ejecutar versiones modificadas del software que contienen, aunque el fabricante pueda hacerlo. Esto es esencialmente incompatible con el objetivo de proteger la libertad de los usuarios para modificar el software. El patr&oacute;n sistem&aacute;tico de tal abuso se da en el &aacute;rea de productos para el uso por parte de individuos, precisamente un &aacute;rea en la cual se vuelve m&aacute;s inaceptable. Por lo tanto, hemos dise&ntilde;ado esta versi&oacute;n de la GPL a fin de prohibir la pr&aacute;ctica para dichos productos. En el caso de que dichos problemas surgieran en otras esferas, hemos tomado los recaudos necesarios para extender esta disposici&oacute;n a dichas esferas en futuras versiones de la GPL, seg&uacute;n se requiera para proteger la libertad de los usuarios.
</p>
<p class="paragraph">
Por &uacute;ltimo, todos los programas se ven amenazados constantemente por patentes de software. Los Estados no deber&iacute;an permitirles a las patentes restringir el desarrollo y el uso de software en computadoras para fines generales, pero, en el caso de que esto suceda, deseamos evitar el riesgo especial de que las patentes que se apliquen a un programa libre efectivamente otorguen tal exclusividad. Para lograrlo, la GPL garantiza la imposibilidad del uso de las patentes para apropiarse de un programa y restringir dicha libertad.
</p>
<p class="paragraph">
A continuaci&oacute;n, se incluyen los t&eacute;rminos y condiciones particulares para la reproducci&oacute;n, distribuci&oacute;n y modificaci&oacute;n del software.
</p>
<p class="subtitle">
T&Eacute;RMINOS Y CONDICIONES
</p>
<p class="subtitle">
0. Definiciones.
</p>
<p class="paragraph">
Por &#34;esta Licencia&#34; se entiende la versi&oacute;n 3 de la Licencia P&uacute;blica General de GNU.
</p>
<p class="paragraph">
El t&eacute;rmino &#34;copyright&#34; tambi&eacute;n se extiende a las leyes que protegen los derechos de autor para otros tipos de obras, tales como dise&ntilde;os de circuitos integrados sobre substrato semiconductor.
</p>
<p class="paragraph">
Por &#34;el Programa&#34; se entiende cualquier obra incluida en esta Licencia sobre la que se puedan ejercer derechos de autor. Para referirnos a cada licenciatario, utilizamos el t&eacute;rmino &#34;usted&#34;. Los &#34;licenciatarios&#34; y &#34;destinatarios&#34; pueden ser individuos u organizaciones.
</p>
<p class="paragraph">
Por &#34;modificar&#34; una obra se entiende el proceso de copiar o adaptar una obra en forma parcial o total de un modo que requiera autorizaci&oacute;n de copyright y que no sea la reproducci&oacute;n de una copia exacta. La obra resultante es una &#34;versi&oacute;n modificada&#34; de la obra anterior o una obra &#34;basada en&#34; la obra anterior.
</p>
<p class="paragraph">
Por &#34;obra amparada&#34; se entiende el Programa sin modificaciones o una obra basada en el Programa.
</p>
<p class="paragraph">
Por &#34;propagar&#34; una obra se entiende cualquier acci&oacute;n sobre la misma que, en el caso de no tener autorizaci&oacute;n, pudiera hacerlo responsable, ya sea en forma directa o indirecta, de infringir las leyes de derechos de autor aplicables, salvo que dicha acci&oacute;n se realice en una computadora o se modifique una copia privada. La propagaci&oacute;n incluye la reproducci&oacute;n, distribuci&oacute;n (con o sin modificaciones), divulgaci&oacute;n y, en algunos pa&iacute;ses, otras actividades tambi&eacute;n.
</p>
<p class="paragraph">
Por &#34;transmitir&#34; una obra se entiende cualquier tipo de propagaci&oacute;n que le permita a un tercero hacer o recibir copias. La mera interacci&oacute;n con un usuario a trav&eacute;s de una red inform&aacute;tica, cuando no se transfiere una copia, no se considera una transmisi&oacute;n.
</p>
<p class="paragraph">
Una interfaz de usuario interactiva muestra &#34;avisos legales apropiados&#34; en la medida en que, de un modo pr&aacute;ctico y bien visible, (1) muestre un aviso de copyright apropiado y (2) le informe al usuario que no se ofrecen garant&iacute;as por la obra (salvo que efectivamente se ofrezcan garant&iacute;as) y que los licenciatarios pueden transmitir la obra conforme a las disposiciones de esta Licencia, adem&aacute;s de mostrar la forma en que se puede consultar una copia de esta Licencia. Si la interfaz presenta una lista de comandos del usuario u opciones, tales como un men&uacute;, dicha lista debe incluir un &iacute;tem visible que cumpla con este criterio.
</p>
<p class="subtitle">
1. C&oacute;digo fuente.
</p>
<p class="paragraph">
El &#34;c&oacute;digo fuente&#34; de una obra es el formato preferido de la obra para realizar modificaciones en la misma. Por &#34;c&oacute;digo objeto&#34; se entiende cualquier formato de una obra que no sea c&oacute;digo fuente.
</p>
<p class="paragraph">
Una &#34;interfaz est&aacute;ndar&#34; es una interfaz que puede ser una norma oficial, seg&uacute;n lo defina un organismo de normas reconocido, o bien, en el caso de interfaces espec&iacute;ficas para un lenguaje de programaci&oacute;n particular, una interfaz de uso generalizado entre los desarrolladores que trabajan con dicho lenguaje.
</p>
<p class="paragraph">
Las &#34;bibliotecas de sistemas&#34; de una obra ejecutable comprenden cualquier cosa, salvo la obra en su totalidad, que (a) se incluya en la forma normal de empaquetamiento de un Componente Importante, pero que no forme parte del Componente Importante, y (b) sirva &uacute;nicamente para permitir el uso de la obra con dicho Componente Importante o para implementar una Interfaz Est&aacute;ndar para la cual haya a disposici&oacute;n del p&uacute;blico una implementaci&oacute;n en forma de c&oacute;digo fuente. Un &#34;Componente Importante&#34;, en este contexto, es un componente fundamental (n&uacute;cleo, sistema de ventanas, etc.) del sistema operativo espec&iacute;fico (si hubiera) en el que funcione la obra ejecutable, o un compilador utilizado para producir la obra, o un int&eacute;rprete de c&oacute;digo objeto utilizado para ejecutarlo.
</p>
<p class="paragraph">
La &#34;Fuente Correspondiente&#34; para una obra en c&oacute;digo objeto refiere a todo el c&oacute;digo fuente necesario para generar, instalar y (para una obra ejecutable) ejecutar el c&oacute;digo objeto y modificar la obra, incluidas las secuencias de comandos para controlar dichas actividades. Sin embargo, no incluye las Bibliotecas de Sistemas de la obra, as&iacute; como tampoco herramientas de aplicaci&oacute;n general o programas libres generalmente disponibles que se utilicen sin modificaciones para realizar dichas actividades pero que no formen parte de la obra. Por ejemplo, la Fuente Correspondiente incluye los archivos de definici&oacute;n de interfaz asociados a los archivos fuente para la obra, as&iacute; como el c&oacute;digo fuente para las bibliotecas compartidas y los subprogramas vinculados en forma din&aacute;mica requeridos espec&iacute;ficamente conforme a su dise&ntilde;o, por ejemplo, mediante la comunicaci&oacute;n de datos intr&iacute;nseca o el control de flujo entre esos subprogramas y otras partes de la obra.
</p>
<p class="paragraph">
La Fuente Correspondiente no necesita incluir nada que los usuarios puedan regenerar autom&aacute;ticamente de otras partes de la Fuente Correspondiente.
</p>
<p class="paragraph">
La Fuente Correspondiente para una obra en c&oacute;digo fuente es esa misma obra.
</p>
<p class="subtitle">
2. Permisos b&aacute;sicos.
</p>
<p class="paragraph">
Todos los derechos que se otorgan conforme a esta Licencia se otorgan por el t&eacute;rmino del copyright que ampara al Programa y son irrevocables siempre y cuando se cumplan las condiciones establecidas. Esta Licencia lo autoriza en forma expresa e ilimitada a ejecutar el Programa sin modificaciones. El producto obtenido a partir de la ejecuci&oacute;n de una obra amparada est&aacute; cubierto por esta Licencia &uacute;nicamente si el producto, dado su contenido, constituye una obra amparada. Esta Licencia reconoce sus derechos de uso razonable y otros equivalentes, conforme a las leyes de copyright.
</p>
<p class="paragraph">
Usted puede crear, ejecutar y propagar obras amparadas que no transmita, sin condiciones en la medida en que su licencia siga vigente de alguna otra manera. Usted puede transmitir obras amparadas a terceros con el &uacute;nico fin de que &eacute;stos realicen modificaciones exclusivamente para usted, o que le proporcionen los medios para ejecutar dichas obras, siempre y cuando usted cumpla con los t&eacute;rminos de esta Licencia en lo que respecta a la transmisi&oacute;n de cualquier material que exceda su control del copyright. Aqu&eacute;llos que de esta manera creen o ejecuten las obras aparadas para usted deben hacerlo exclusivamente en su nombre, bajo su direcci&oacute;n y control y sobre la base de t&eacute;rminos que les proh&iacute;ban hacer copias de su material protegido por derechos de autor fuera de la relaci&oacute;n que mantienen con usted.
</p>
<p class="paragraph">
La transmisi&oacute;n bajo cualquier otra circunstancia se permite &uacute;nicamente conforme a las condiciones que se describen a continuaci&oacute;n. Se proh&iacute;be sublicenciar; la secci&oacute;n 10 hace que sea innecesario.
</p>
<p class="subtitle">
3. Protecci&oacute;n de los derechos legales de los usuarios frente a la Ley Anti-Evasi&oacute;n.
</p>
<p class="paragraph">
Ninguna obra amparada se considerar&aacute; parte de una medida tecnol&oacute;gica efectiva conforme a cualquier ley aplicable que cumpla las obligaciones del art&iacute;culo 11 del tratado de copyright WIPO adoptado el 20 de diciembre de 1996 o a leyes similares que proh&iacute;ban o restrinjan la evasi&oacute;n de dichas medidas.
</p>
<p class="paragraph">
Cuando usted transmite una obra amparada, renuncia a cualquier facultad legal de prohibir la evasi&oacute;n de medidas tecnol&oacute;gicas en la medida en que dicha evasi&oacute;n se realice al hacer uso de los derechos que se otorgan conforme a esta Licencia con respecto a la obra amparada, y niega cualquier intenci&oacute;n de restringir el uso o la modificaci&oacute;n de la obra como una forma de hacer valer, en contra de los usuarios de la obra, sus derechos legales o los derechos legales de terceros para prohibir la evasi&oacute;n de medidas tecnol&oacute;gicas.
</p>
<p class="subtitle">
4. Transmisi&oacute;n de copias exactas.
</p>
<p class="paragraph">
Usted puede transmitir copias exactas del c&oacute;digo fuente del Programa tal cual lo reciba, en cualquier medio, siempre y cuando publique de un modo llamativo y adecuado un aviso de copyright apropiado en cada copia; mantenga intactos todos los avisos que establecen que esta Licencia y cualquier t&eacute;rmino no-permisivo que se agregue conforme a la secci&oacute;n 7 se aplican al c&oacute;digo; mantenga intactos todos los avisos mediante los cuales se niega cualquier tipo de garant&iacute;a; y les proporcione a todos los destinatarios una copia de esta Licencia junto con el Programa.
</p>
<p class="paragraph">
Usted puede cobrar el precio que usted desee o no cobrar nada por cada copia que transmita, y puede ofrecer soporte o protecci&oacute;n de garant&iacute;a a cambio de una tarifa.
</p>
<p class="subtitle">
5. Transmisi&oacute;n de versiones modificadas del c&oacute;digo fuente.
</p>
<p class="paragraph">
Usted puede transmitir una obra basada en el Programa, o las modificaciones para producirlo a partir del Programa, en forma de c&oacute;digo fuente conforme a los t&eacute;rminos de la secci&oacute;n 4, siempre y cuando tambi&eacute;n cumpla con todas las condiciones que se incluyen a continuaci&oacute;n:
</p>
<ul>
<li class="item">a) La obra debe conservar avisos llamativos que establezcan que usted la ha modificado e incluyan la fecha correspondiente.</li>
<li class="item">b) La obra debe conservar avisos llamativos que establezcan que la misma se realiza conforme a esta Licencia y a todas las condiciones que se agreguen bajo la secci&oacute;n 7. Este requerimiento modifica el requerimiento de la secci&oacute;n 4 que establece que se deben &#34;mantener intactos todos los avisos&#34;.</li>
<li class="item">c) Usted debe otorgar una licencia por la obra completa, en forma &iacute;ntegra, conforme a esta Licencia, a cualquier tercero que adquiera una copia. Por lo tanto, esta Licencia, junto con cualquier t&eacute;rmino adicional aplicable de la secci&oacute;n 7, se aplica a la obra en su totalidad y a todas sus partes, independientemente del modo en que se las empaquete. Esta Licencia no lo autoriza a otorgar licencias para la obra de ning&uacute;n otro modo, pero no invalida dicha autorizaci&oacute;n si usted la ha recibido por separado.</li>
<li class="item">d) Si la obra tuviera interfaces de usuario interactivas, cada una de ellas deber&aacute; mostrar Avisos Legales Apropiados. No obstante, si el Programa tuviera interfaces interactivas que no mostraran Avisos Legales Apropiados, usted no necesita incluirlos.</li>
</ul>
<p class="paragraph">
Se denomina &#34;conjunto&#34; a la compilaci&oacute;n de una obra amparada con otras obras diferentes e independientes que por su naturaleza no sean extensiones de la obra amparada ni se combinen con ella para formar un programa m&aacute;s grande en un volumen de un medio de distribuci&oacute;n o almacenamiento, si la compilaci&oacute;n y el copyright consiguiente no se utilizan para restringir el acceso o los derechos legales de los usuarios de la compilaci&oacute;n m&aacute;s all&aacute; de lo que permitan las obras individuales. La inclusi&oacute;n de una obra amparada en un conjunto no implica que esta Licencia se aplique a las otras partes del conjunto.
</p>
<p class="subtitle">
6. Transmisi&oacute;n de c&oacute;digos que no son c&oacute;digos fuente.
</p>
<p class="paragraph">
Usted puede transmitir una obra amparada en c&oacute;digo objeto conforme a los t&eacute;rminos de las secciones 4 y 5, siempre y cuando tambi&eacute;n transmita la Fuente Correspondiente legible por m&aacute;quina conforme a los t&eacute;rminos de esta Licencia, de alguna de las siguientes maneras:
</p>
<p class="paragraph">
<ul>
<li class="item">a) Transmisi&oacute;n del c&oacute;digo objeto dentro de un producto f&iacute;sico (incluidos medios f&iacute;sicos de distribuci&oacute;n) o incorporado a &eacute;ste, acompa&ntilde;ado de la Fuente Correspondiente en un medio f&iacute;sico duradero habitual para el intercambio de software.</li>
<li class="item">b) Transmisi&oacute;n del c&oacute;digo objeto dentro de un producto f&iacute;sico (incluidos medios f&iacute;sicos de distribuci&oacute;n) o incorporado a &eacute;ste, acompa&ntilde;ado de una oferta escrita, que sea v&aacute;lida por un plazo m&iacute;nimo de tres a&ntilde;os y por el tiempo que usted ofrezca repuestos o soporte t&eacute;cnico para ese modelo del producto, para proporcionarle a cualquier persona que posea el c&oacute;digo objeto (1) una copia de la Fuente Correspondiente para todo el software del producto que est&eacute; amparado por esta Licencia, en un medio f&iacute;sico duradero habitual para el intercambio de software, a cambio de un precio que no exceda el costo razonable de la acci&oacute;n f&iacute;sica de transmitir esta fuente, o (2) acceso para la copia de la Fuente Correspondiente desde un servidor de red sin costo alguno.</li>
<li class="item">c) Transmisi&oacute;n de copias individuales del c&oacute;digo objeto junto con una copia de la oferta escrita para proporcionar la Fuente Correspondiente. Esta opci&oacute;n se permite &uacute;nicamente en ocasiones y para fines no comerciales, y s&oacute;lo en la medida en que usted haya recibido el c&oacute;digo objeto con una oferta de esta naturaleza, conforme a la subsecci&oacute;n 6b.</li>
<li class="item">d) Transmisi&oacute;n del c&oacute;digo objeto ofreciendo acceso desde un lugar determinado (en forma gratuita u onerosa) y ofreciendo un acceso equivalente a la Fuente Correspondiente del mismo modo y desde el mismo lugar sin costo adicional. No es necesario que les exija a los destinatarios que copien la Fuente Correspondiente junto con el c&oacute;digo objeto. Si el lugar ofrecido para copiar el c&oacute;digo objeto fuera un servidor de red, la Fuente Correspondiente podr&aacute; estar en un servidor diferente (operado por usted o un tercero) que ofrezca posibilidades de reproducci&oacute;n equivalentes, siempre y cuando se incluyan, junto al c&oacute;digo objeto, instrucciones claras para localizar la Fuente Correspondiente. Independientemente de qu&eacute; servidor albergue la Fuente Correspondiente, usted mantiene la obligaci&oacute;n de asegurarse de que el mismo est&eacute; disponible por el tiempo que sea necesario para satisfacer estos requerimientos.</li>
<li class="item">e) Transmisi&oacute;n del c&oacute;digo objeto mediante transferencia entre usuarios (peer to peer), siempre y cuando les informe a los usuarios la ubicaci&oacute;n del c&oacute;digo objeto y la Fuente Correspondiente de la obra para el p&uacute;blico en general sin costo alguno conforme a la subsecci&oacute;n 6d.</li>
</ul>
</p>
<p class="paragraph">
No se necesita incluir una parte separable del c&oacute;digo objeto, cuyo c&oacute;digo fuente se excluya de la Fuente Correspondiente como una biblioteca de sistemas, para transmitir el c&oacute;digo objeto de la obra.
</p>
<p class="paragraph">
Por &#34;producto de usuario&#34; se entiende (1) un &#34;producto de consumo&#34;, que es cualquier bien personal tangible que se utilice habitualmente para fines personales, familiares o dom&eacute;sticos, o (2) cualquier cosa que se dise&ntilde;e o comercialice para su incorporaci&oacute;n en una vivienda. Al determinar si un producto es un producto de consumo, los casos dudosos deber&aacute;n resolverse a favor del amparo. Para un producto espec&iacute;fico que recibe un usuario particular, un &#34;uso habitual&#34; es el uso com&uacute;n o t&iacute;pico que se le suele dar a ese tipo de producto, independientemente de la condici&oacute;n del usuario particular o de la forma en que el usuario particular utilice el producto o de las expectativas propias o de terceros con respecto al uso del producto. Un producto se considera un producto de consumo independientemente de que que se le pueda dar usos sustanciales de &iacute;ndole comercial, industrial o ajena al consumo, salvo que dichos usos representen el &uacute;nico modo significativo de utilizar el producto.
</p>
<p class="paragraph">
Por &#34;informaci&oacute;n de instalaci&oacute;n&#34; de un producto de usuario se entiende cualquier m&eacute;todo, procedimiento, clave de autorizaci&oacute;n u otro tipo de informaci&oacute;n requerida para instalar y ejecutar versiones modificadas de una obra amparada en dicho producto de usuario a partir de una versi&oacute;n modificada de su Fuente Correspondiente. La informaci&oacute;n debe ser suficiente para garantizar que el funcionamiento continuo del c&oacute;digo objeto modificado no se vea afectado o imposibilitado por el solo hecho de haberse realizado la modificaci&oacute;n.
</p>
<p class="paragraph">
En el caso de que usted transmita el c&oacute;digo objeto de una obra conforme a esta secci&oacute;n en un producto de usuario, junto con un producto de usuario o espec&iacute;ficamente para su uso en un producto de usuario, y la transmisi&oacute;n se produzca como parte de una transacci&oacute;n mediante la cual los derechos de posesi&oacute;n y uso del producto de usuario se transfieran al destinatario por un plazo limitado o ilimitado (independientemente de las particularidades de la transacci&oacute;n), la Fuente Correspondiente transmitida conforme a esta secci&oacute;n deber&aacute; ir acompa&ntilde;ada de la informaci&oacute;n de instalaci&oacute;n. Sin embargo, este requerimiento no se aplicar&aacute; en el caso de que ni usted ni un tercero conserven la capacidad para instalar el c&oacute;digo objeto modificado en el producto de usuario (por ejemplo, que la obra se haya instalado en memoria ROM).
</p>
<p class="paragraph">
El requerimiento de proporcionar informaci&oacute;n de instalaci&oacute;n no implica la necesidad de seguir proveyendo soporte t&eacute;cnico, garant&iacute;as o actualizaciones para una obra que haya sido modificada o instalada por el destinatario o para el producto de usuario en el cual se la haya modificado o instalado. Podr&aacute; negarse el acceso a una red cuando la modificaci&oacute;n en s&iacute; misma pueda afectar de un modo adverso y sustancial el funcionamiento de la red o infrinja las normas y los protocolos de comunicaci&oacute;n a trav&eacute;s de la red.
</p>
<p class="paragraph">
La Fuente correspondiente que se transmita y la informaci&oacute;n de instalaci&oacute;n que se proporcione conforme a esta secci&oacute;n deber&aacute;n presentarse en un formato sobre el cual exista documentaci&oacute;n p&uacute;blica (y con una implementaci&oacute;n disponible para el p&uacute;blico en c&oacute;digo fuente) y no deber&aacute;n requerir ninguna clave o contrase&ntilde;a especial para su desempaquetamiento, lectura o reproducci&oacute;n.
</p>
<p class="subtitle">
7. T&eacute;rminos adicionales.
</p>
<p class="paragraph">
Los &#34;permisos adicionales&#34; son t&eacute;rminos que complementan los t&eacute;rminos de esta Licencia al permitir excepciones a una o m&aacute;s condiciones. Los permisos adicionales que se aplican al Programa en su totalidad deber&aacute;n tratarse como si formaran parte de esta Licencia, en la medida en que sean v&aacute;lidos conforme a las leyes aplicables. En el caso de que los permisos adicionales se apliquen &uacute;nicamente a una parte del Programa, esta parte podr&aacute; utilizarse por separado conforme a dichos permisos, pero el Programa en su totalidad seguir&aacute; rigi&eacute;ndose de acuerdo a esta Licencia independientemente de los permisos adicionales.
</p>
<p class="paragraph">
Cuando usted transmita una copia de una obra amparada, podr&aacute; optar por eliminar cualquier permiso adicional de dicha copia o de cualquier parte de la misma (en ciertos casos, cuando usted modifique la obra, podr&aacute;n establecerse permisos adicionales para requerir la eliminaci&oacute;n de los mismos). Tiene autorizaci&oacute;n para incluir permisos adicionales en un material que usted haya agregado a una obra amparada y sobre el cual usted posea o pueda otorgar permisos de copyright adecuados.
</p>
<p class="paragraph">
Independientemente de cualquier otra disposici&oacute;n de esta Licencia, con respecto al material que usted agregue a una obra amparada, usted podr&aacute; (en la medida en que lo autoricen los titulares de los derechos de copyright de dicho material) complementar los t&eacute;rminos de esta Licencia con los siguientes t&eacute;rminos:
</p>
<p class="paragraph">
<ul>
<li class="item">a) Ausencia de garant&iacute;as o limitaci&oacute;n de la responsabilidad m&aacute;s all&aacute; de los t&eacute;rminos de las secciones 15 y 16 de esta Licencia; o</li>
<li class="item">b) Obligaci&oacute;n de conservaci&oacute;n de atribuciones de autor&iacute;a o avisos legales razonables espec&iacute;ficos en dicho material o en los avisos legales apropiados que se muestren en las obras que lo contengan; o</li>
<li class="item">c) Prohibici&oacute;n de tergiversaci&oacute;n del origen del material, o requerimiento de que en las versiones modificadas de dicho material se indique de un modo razonable que son diferentes de la versi&oacute;n original; o</li>
<li class="item">d) Limitaci&oacute;n del uso de los nombres de los licenciantes o autores del material para fines publicitarios; o</li>
<li class="item">e) Negativa con respecto al otorgamiento de derechos conforme a las leyes de marcas para el uso de ciertos nombres comerciales, marcas de productos o marcas de servicios; o</li>
<li class="item">f) Requerimiento de indemnizaci&oacute;n de los licenciantes o autores de dicho material por parte de cualquier persona que transmita el material (o versiones modificadas del mismo) bajo presunciones contractuales de responsabilidad del destinatario por cualquier responsabilidad que dichas presunciones contractuales impongan directamente sobre los licenciantes y autores del material.</li>
</ul>
</p>
<p class="paragraph">
Cualquier otro t&eacute;rmino adicional no permisivo se considerar&aacute; una &#34;restricci&oacute;n adicional&#34; en el contexto de la secci&oacute;n 10. En el caso de que el Programa, tal cual usted lo recibi&oacute;, o cualquier parte del mismo contengan un aviso que indique que el mismo se rige seg&uacute;n esta Licencia junto con un t&eacute;rmino que constituya una restricci&oacute;n adicional, podr&aacute; eliminar dicho t&eacute;rmino. En el caso de que un documento de licencia contenga una restricci&oacute;n adicional pero permita la extensi&oacute;n de la licencia o la transmisi&oacute;n del programa conforme a esta Licencia, usted podr&aacute; agregar a la obra amparada cualquier material conforme a los t&eacute;rminos de dicho documento de licencia, siempre y cuando la restricci&oacute;n adicional no se mantenga tras la extensi&oacute;n de la licencia o la transmisi&oacute;n del programa.
</p>
<p class="paragraph">
En el caso de que usted agregue t&eacute;rminos a una obra amparada conforme a esta secci&oacute;n, deber&aacute; incluir en los archivos fuente correspondientes una declaraci&oacute;n de los t&eacute;rminos adicionales que se aplican a dichos archivos o un aviso que indique la ubicaci&oacute;n de los t&eacute;rminos aplicables.
</p>
<p class="paragraph">
Se podr&aacute;n establecer t&eacute;rminos adicionales, sean &eacute;stos permisivos o no permisivos, en una licencia escrita independiente, o a modo de excepciones; sea como fuere, se aplicar&aacute;n los requerimientos mencionados anteriormente.
</p>
<p class="subtitle">
8. Cancelaci&oacute;n.
</p>
<p class="paragraph">
Usted no est&aacute; autorizado a propagar o modificar una obra amparada de ning&uacute;n otro modo que no se estipule en esta Licencia. Cualquier intento no autorizado por propagarla o modificarla se considerar&aacute; nulo y conllevar&aacute; la cancelaci&oacute;n autom&aacute;tica de los derechos que le haya otorgado esta Licencia (incluida cualquier licencia de patente otorgada conforme al p&aacute;rrafo tercero de la secci&oacute;n 11).
</p>
<p class="paragraph">
No obstante, en el caso de que deje de violar las cl&aacute;usulas de esta Licencia, un titular de derechos de copyright particular podr&aacute; restituirle la licencia (a) en forma provisoria, hasta tanto dicho titular d&eacute; por finalizada su licencia en forma expresa y definitiva, y (b) en forma permanente, si dicho titular no lo notificara de la infracci&oacute;n por alg&uacute;n medio razonable antes de los 60 d&iacute;as posteriores a la cancelaci&oacute;n.
</p>
<p class="paragraph">
Asimismo, la licencia que le otorgue un titular de derechos de copyright particular se le restituir&aacute; en forma permanente si dicho titular lo notificara de la infracci&oacute;n por alg&uacute;n medio razonable, &eacute;sta fuera la primera vez que usted hubiese recibido una notificaci&oacute;n de violaci&oacute;n de esta Licencia (por cualquier obra) emitida por dicho titular, y usted subsanara la infracci&oacute;n en un plazo de 30 d&iacute;as a partir de la recepci&oacute;n de la notificaci&oacute;n.
</p>
<p class="paragraph">
La extinci&oacute;n de sus derechos conforme a esta secci&oacute;n no cancela las licencias de aquellos terceros a los que usted les haya otorgado copias o derechos conforme a esta Licencia. En el caso de que sus derechos se cancelen y no se le restituyan en forma permanente, usted no estar&aacute; capacitado para recibir nuevas licencias para el mismo material conforme a la secci&oacute;n 10.
</p>
<p class="subtitle">
9. Aceptaci&oacute;n innecesaria para la posesi&oacute;n de copias.
</p>
<p class="paragraph">
Usted no est&aacute; obligado a aceptar esta Licencia para poder recibir o ejecutar una copia del Programa. De modo similar, la propagaci&oacute;n secundaria de una obra amparada que se produzca &uacute;nicamente como consecuencia de una transferencia entre usuarios (peer to peer) a fin de recibir una copia tampoco requiere aceptaci&oacute;n. No obstante, esta Licencia es lo &uacute;nico que lo autoriza a propagar o modificar cualquier obra amparada. En el caso de que usted no acepte esta Licencia, los actos anteriores representar&aacute;n una violaci&oacute;n de las leyes de copyright. Por lo tanto, al modificar o propagar una obra amparada, usted expresa su aceptaci&oacute;n de esta Licencia para hacerlo.
</p>
<p class="subtitle">
10. Traspaso autom&aacute;tico de licencia a destinatarios subsiguientes.
</p>
<p class="paragraph">
Cada vez que usted transmite una obra amparada, el destinatario recibe autom&aacute;ticamente de los licenciantes originales una licencia para ejecutar, modificar y propagar la obra conforme a esta Licencia. Usted no es responsable de asegurar el cumplimiento de esta Licencia por parte de terceros.
</p>
<p class="paragraph">
Una &#34;transacci&oacute;n entre entidades&#34; es una transacci&oacute;n mediante la cual se transfiere el control de una organizaci&oacute;n o de todo el patrimonio de una organizaci&oacute;n, se subdivide una organizaci&oacute;n o se fusionan dos o m&aacute;s organizaciones. En el caso de que la propagaci&oacute;n de una obra amparada se deba a una transacci&oacute;n entre entidades, cada parte de la transacci&oacute;n que reciba una copia de la obra tambi&eacute;n recibir&aacute; todas las licencias para la obra que el predecesor de la parte tuviera o pudiera otorgar conforme al p&aacute;rrafo anterior, m&aacute;s el derecho de recibir de su predecesor la Fuente Correspondiente de la obra, si el predecesor la tuviera en su poder o pudiera obtenerla con un esfuerzo razonable.
</p>
<p class="paragraph">
Usted no puede imponer restricciones adicionales para el ejercicio de los derechos que se otorgan o consolidan conforme a esta Licencia. Por ejemplo, usted no puede imponer tarifas, regal&iacute;as u otros cargos a cambio del ejercicio de los derechos que se otorgan conforme a esta Licencia, as&iacute; como tampoco puede iniciar acciones legales (incluidas demandas y contrademandas en un pleito) sobre la base de una infracci&oacute;n de patentes por crear, usar, comercializar, ofrecer para la venta o importar el Programa o cualquier parte del mismo.
</p>
<p class="subtitle">
11. Patentes.
</p>
<p class="paragraph">
Un &#34;colaborador&#34; es un titular de derechos de copyright que autoriza el uso conforme a esta Licencia del Programa o de una obra sobre la cual se base el Programa. La obra cuya licencia se otorgue de esta manera se denomina &#34;versi&oacute;n en colaboraci&oacute;n&#34; del colaborador.
</p>
<p class="paragraph">
Los &#34;derechos de patente fundamentales&#34; de un colaborador son todos los derechos de patente bajo la titularidad o el control del colaborador, ya sea que se los hubiese adquirido previo al otorgamiento de esta Licencia o a partir del mismo, que puedan infringirse de alg&uacute;n modo permitido por esta Licencia para crear, usar o vender su versi&oacute;n en colaboraci&oacute;n, pero no incluyen derechos que se podr&iacute;an infringir &uacute;nicamente como consecuencia de modificaciones posteriores a la versi&oacute;n en colaboraci&oacute;n. A los efectos de esta definici&oacute;n, el &#34;control&#34; incluye el derecho de otorgar sublicencias de patente de un modo acorde a los requerimientos de esta Licencia.
</p>
<p class="paragraph">
Cada colaborador le otorga a usted una licencia de patente internacional no-exclusiva libre de regal&iacute;as conforme a los derechos de patente fundamentales del colaborador para crear, usar, comercializar, ofrecer para la venta, importar y ejecutar, modificar y propagar de alg&uacute;n otro modo el contenido de su versi&oacute;n en colaboraci&oacute;n.
</p>
<p class="paragraph">
En los tres p&aacute;rrafos que se incluyen a continuaci&oacute;n, una &#34;licencia de patente&#34; es cualquier contrato o acuerdo expreso, independientemente de su denominaci&oacute;n, mediante el cual se convenga no ejercer derechos de patente (como, por ejemplo, una autorizaci&oacute;n expresa para hacer uso de una patente o una cl&aacute;usula que establezca que no se iniciar&aacute;n acciones legales por infringir los derechos de patente). Por &#34;otorgar&#34; una licencia de patente de esta naturaleza a otra parte se entiende el acto de celebrar un contrato o acuerdo mediante el cual se conviene no ejercer derechos de patente en contra de dicha parte.
</p>
<p class="paragraph">
En el caso de que usted transmita una obra amparada, a sabiendas de que est&aacute; sujeta a una licencia de patente, y la Fuente Correspondiente de la obra no estuviera disponible para su reproducci&oacute;n, en forma gratuita y conforme a los t&eacute;rminos de esta Licencia, a trav&eacute;s de un servidor de red de acceso p&uacute;blico u otro medio igualmente accesible, usted deber&aacute; (1) poner la Fuente Correspondiente a disposici&oacute;n del destinatario subsiguiente, (2) renunciar al beneficio de la licencia de patente para esta obra en particular, o bien (3) tomar las medidas necesarias para extender la licencia de patente a los destinatarios subsiguientes de un modo acorde a los requerimientos de esta Licencia. La frase &#34;a sabiendas de que est&aacute; sujeta a una licencia de patente&#34; significa que usted efectivamente sabe que, de no ser por la licencia de patente, su transmisi&oacute;n de la obra amparada en un pa&iacute;s o el uso que pudiera darle el destinatario a la obra amparada en un pa&iacute;s infringir&iacute;an una o m&aacute;s patentes identificables en dicho pa&iacute;s que usted considera v&aacute;lidas por diversas razones.
</p>
<p class="paragraph">
En el caso de que, en relaci&oacute;n con una transacci&oacute;n o contrato individual, usted transmitiera una obra amparada o la propagara consiguiendo su transmisi&oacute;n y otorgara a algunas de las partes que reciban la obra amparada una licencia de patente que las autorizara a usar, propagar, modificar o trasmitir una copia espec&iacute;fica de la obra amparada, la licencia de patente que usted otorgue se extender&aacute; autom&aacute;ticamente a todos los destinatarios de la obra amparada y a las obras que se basen en ella.
</p>
<p class="paragraph">
Una licencia de patente se considera &#34;discriminatoria&#34; cuando no incluye dentro de su &aacute;mbito de cobertura uno o m&aacute;s de los derechos que se otorgan espec&iacute;ficamente conforme a esta Licencia, proh&iacute;be el uso de dichos derechos o se otorga como condici&oacute;n de que no se usen dichos derechos. Usted no debe transmitir una obra amparada si fuese una de las partes de un contrato con un tercero que se dedicara a la distribuci&oacute;n de software, conforme al cual usted debiera pagarle al tercero por la actividad que usted realice con respecto a la transmisi&oacute;n de la obra y el tercero le otorgara a cualquiera de las partes que reciban de usted la obra amparada una licencia de patente discriminatoria (a) en relaci&oacute;n con las copias de la obra amparada transmitidas por usted (o las copias que se hagan de esas copias), o (b) principalmente para compilaciones o productos espec&iacute;ficos que contengan la obra amparada y en relaci&oacute;n con &eacute;stos, a menos que usted hubiese celebrado dicho contrato o que la patente se hubiese otorgado antes del 28 de marzo de 2007.
</p>
<p class="paragraph">
Ninguna disposici&oacute;n de esta Licencia deber&aacute; interpretarse como excluyente o limitativa de ninguna licencia impl&iacute;cita u otras defensas legales contra infracciones a las que, de otro modo, usted pudiese tener derecho conforme a la ley de propiedad intelectual vigente.
</p>
<p class="subtitle">
12. Protecci&oacute;n de la libertad de terceros.
</p>
<p class="paragraph">
En el caso de que le fueran impuestas condiciones (ya sea por una orden judicial, un contrato o de alg&uacute;n otro modo) que contradijeran las condiciones de esta Licencia, usted no quedar&aacute; eximido de cumplir las condiciones de esta Licencia. En el caso de que no pueda transmitir una obra amparada de un modo que le permita cumplir simult&aacute;neamente con las obligaciones establecidas por esta Licencia y cualquier otra obligaci&oacute;n pertinente, no podr&aacute; transmitirla de ning&uacute;n modo. Por ejemplo, en el caso de que usted acepte t&eacute;rminos que lo obliguen a cobrar regal&iacute;as por retransmisi&oacute;n de aqu&eacute;llos a los que usted transmita el Programa, la &uacute;nica forma de satisfacer tanto dichos requerimientos como esta Licencia ser&aacute; abstenerse de transmitir el Programa.
</p>
<p class="subtitle">
13. Uso conjunto con la Licencia P&uacute;blica General Affero de GNU.
</p>
<p class="paragraph">
Independientemente de cualquier otra disposici&oacute;n de esta Licencia, usted tiene permiso para vincular o combinar cualquier obra amparada con una obra cuya licencia se otorgue conforme a la versi&oacute;n 3 de la Licencia P&uacute;blica General Affero de GNU en una &uacute;nica obra combinada y transmitir la obra resultante. Los t&eacute;rminos de esta Licencia seguir&aacute;n aplic&aacute;ndose a la parte que corresponda a la obra amparada, pero los requerimientos especiales de la secci&oacute;n 13 de la Licencia P&uacute;blica General Affero de GNU sobre la interacci&oacute;n a trav&eacute;s de una red se aplicar&aacute;n a la combinaci&oacute;n como tal.
</p>
<p class="subtitle">
14. Revisiones de esta Licencia.
</p>
<p class="paragraph">
La Fundaci&oacute;n para el Software Libre podr&aacute; publicar revisiones y/o versiones nuevas de la Licencia P&uacute;blica General de GNU de vez en cuando. Tales versiones ser&aacute;n de naturaleza similar a la versi&oacute;n actual, pero podr&aacute;n diferir en cuanto a los detalles para afrontar nuevos problemas o inquietudes.
</p>
<p class="paragraph">
Cada versi&oacute;n recibir&aacute; un n&uacute;mero de versi&oacute;n que la distinga. En el caso de que el Programa especifique que se rige por una versi&oacute;n determinada de la Licencia P&uacute;blica General de GNU &#34;o cualquier versi&oacute;n posterior&#34;, usted podr&aacute; optar por adoptar los t&eacute;rminos y condiciones de dicha versi&oacute;n espec&iacute;fica o de cualquier versi&oacute;n posterior que publique la Fundaci&oacute;n para el Software Libre. En el caso de que el Programa no especifique un n&uacute;mero de versi&oacute;n de la Licencia P&uacute;blica General de GNU, usted podr&aacute; regirse por cualquier versi&oacute;n que haya publicado la Fundaci&oacute;n para el Software Libre.
</p>
<p class="paragraph">
Si el Programa especificara que un apoderado puede decidir qu&eacute; versiones de la Licencia P&uacute;blica General de GNU pueden aplicarse en el futuro, la declaraci&oacute;n p&uacute;blica del apoderado sobre la aceptaci&oacute;n de una versi&oacute;n determinada lo autorizar&aacute; a usted, en forma permanente, a optar por dicha versi&oacute;n para el Programa.
</p>
<p class="paragraph">
Puede que las versiones posteriores de la licencia le otorguen permisos adicionales o diferentes. No obstante, no se les impondr&aacute;n obligaciones adicionales a ning&uacute;n autor o titular de derechos de copyright como resultado de la adopci&oacute;n de la versi&oacute;n posterior que usted elija.
</p>
<p class="subtitle">
15. Ausencia de garant&iacute;as.
</p>
<p class="paragraph">
EL PROGRAMA SE OFRECE SIN NING&Uacute;N TIPO DE GARANT&Iacute;AS, EN LA MEDIDA EN QUE LO PERMITAN LAS LEYES APLICABLES. SALVO DISPOSICI&Oacute;N CONTRARIA POR ESCRITO, LOS TITULARES DE DERECHOS DE COPYRIGHT Y/U OTRAS PARTES PROVEEN EL PROGRAMA "TAL CUAL" SIN GARANT&Iacute;AS DE NING&Uacute;N TIPO, YA SEAN EXPRESAS O IMPL&Iacute;CITAS, INCLUIDAS, AUNQUE NO EN FORMA TAXATIVA, LAS GARANT&Iacute;AS IMPL&Iacute;CITAS DE COMERCIABILIDAD Y APTITUD PARA UN PROP&Oacute;SITO DETERMINADO. USTED ASUME TODOS LOS RIESGOS CON RESPECTO A LA CALIDAD Y EL DESEMPE&Ntilde;O DEL PROGRAMA. EN EL CASO DE QUE EL PROGRAMA TUVIERA DEFECTOS, USTED ASUME EL COSTO DE TODAS LAS ACTIVIDADES DE MANTENIMIENTO, REPARACI&Oacute;N O CORRECCI&Oacute;N.
</p>
<p class="subtitle">
16. Limitaci&oacute;n de la responsabilidad.
</p>
<p class="paragraph">
EN NING&Uacute;N CASO, SALVO QUE AS&Iacute; LO DISPONGAN LAS LEYES APLICABLES O UN CONTRATO POR ESCRITO, UN TITULAR DE DERECHOS DE COPYRIGHT O UN TERCERO QUE MODIFIQUE Y/O TRANSMITA EL PROGRAMA SEG&Uacute;N SE AUTORIZA ANTERIORMENTE SER&Aacute; RESPONSABLE ANTE USTED DE CUALQUIER DA&Ntilde;O, INCLUIDOS DA&Ntilde;OS GENERALES, ESPECIALES, FORTUITOS O DERIVADOS, QUE PUEDA SURGIR DEL USO O LA INCAPACIDAD DE USO DEL PROGRAMA (INCLUIDOS, AUNQUE NO TAXATIVAMENTE, LA P&Eacute;RDIDA DE INFORMACI&Oacute;N, EL SUMINISTRO DE INFORMACI&Oacute;N IMPRECISA O LAS P&Eacute;RDIDAS QUE PUEDAN SUFRIR USTED O UN TERCERO O LA INCAPACIDAD DEL PROGRAMA PARA INTERACTUAR CON OTROS PROGRAMAS), AUN CUANDO DICHO TITULAR O TERCERO HUBIESE SIDO ADVERTIDO DE LA POSIBILIDAD DE TALES DA&Ntilde;OS.
</p>
<p class="subtitle">
17. Interpretaci&oacute;n de las secciones 15 y 16.
</p>
<p class="paragraph">
En el caso de que las cl&aacute;usulas de ausencia de garant&iacute;as y limitaci&oacute;n de la responsabilidad anteriores carecieran de validez legal a nivel local conforme a sus t&eacute;rminos, los juzgados deber&aacute;n aplicar las leyes locales que m&aacute;s se asimilen a una exenci&oacute;n absoluta de cualquier responsabilidad civil en relaci&oacute;n con el Programa, salvo que una copia del Programa estuviera acompa&ntilde;ada de una garant&iacute;a o presunci&oacute;n de responsabilidad a cambio de una tarifa.
</p>
<p class="subtitle">
FIN DE T&Eacute;RMINOS Y CONDICIONES
</p>
</body>
