<html>
<head>
<link rel="stylesheet" type="text/css" href="../css/tupi.css" />
</head>
<body class="tupi_background3">
<center><b>[ Under Translation ]</b></center>
<p class="title">Creemos un archivo de v&iacute;deo!</p>
<p class="paragraph">
Una vez consideres que todo est&aacute; listo para publicar tu obra de arte, es momento de crear el archivo de v&iacute;deo. Para ello, debes ingresar al <i>M&oacute;dulo de Animaci&oacute;n</i> y dar un clic sobre el bot&oacute;n <i>Exportar</i>. 
</p>
<center>
<img src="./images/exporting01.png"/>
<p class="paragraph">
<b>Fig #60.</b> Opci&oacute;n <i>Exportar</i> en el M&oacute;dulo de Animaci&oacute;n 
</p>
</center>
<p class="paragraph">
Un cuadro de di&aacute;logo te asistir&aacute; durante todo el proceso de exportaci&oacute;n. Lo primero que debes escoger, es el formato en el que quieres el v&iacute;deo de tu animaci&oacute;n: 
</p>
<center>
<img src="./images/exporting02.png"/>
<p class="paragraph">
<b>Fig #61.</b> Di&aacute;logo de Selecci&oacute;n de Formato
</p>
</center>
<p class="paragraph">
A continuaci&oacute;n, debes seleccionar las escenas que quieres exportar. En este caso, s&oacute;lo se trata de una:
</p>
<center>
<img src="./images/exporting03.png"/>
<p class="paragraph">
<b>Fig #62.</b> Di&aacute;logo de Selecci&oacute;n de Escenas 
</p>
</center>
<p class="paragraph">
Finalmente, selecciona el nombre del archivo, la ruta donde quieres exportarlo y si lo deseas, puedes cambiar la dimensi&oacute;n en la que quieres que el v&iacute;deo sea creado:
</p>
<center>
<img src="./images/exporting04.png"/>
<p class="paragraph">
<b>Fig #63.</b> Di&aacute;logo de Creaci&oacute;n de Archivo 
</p>
</center>
<p class="paragraph">
Una vez que hayas presionado el bot&oacute;n <i>Exportar</i>, tu v&iacute;deo estar&aacute; listo para ser visto por todo el mundo! Si lo deseas, puedes publicarlo en nuestra galer&iacute;a de proyectos, s&oacute;lo tienes que escribirnos comentando tu deseo de hacerlo p&uacute;blico, siguiendo nuestras instrucciones.
</p>
<center>
<img src="./images/final_video.png"/>
<p class="paragraph">
<b>Fig #64.</b> Resultado Final
</p>
</center>
<p class="paragraph">
Si quieres revisar el archivo fuente de este proyecto, puedes encontrarlo <a href="http://www.maefloresta.com/portal/files/butterfly.tup">aqu&iacute;</a>, as&iacute; como el <a href="http://www.maefloresta.com/portal/files/butterfly.avi">archivo de v&iacute;deo</a> listo para ver. No se trata de una obra de arte revolucionaria, pero esperamos que te motive a crear grandes proyectos! 
</p>

</body>
</html>
