<html>
<head>
<link rel="stylesheet" type="text/css" href="file:tupi.css" />
</head>
<body class="tupi_background3">
<p class="title">Adicionemos nuevos marcos</p>
<p class="paragraph">
Con nuestro primer marco terminado, es momento de adicionar el siguiente. Para ello, vamos a utilizar la <i>Tabla de Exposici&oacute;n</i>, ubicada a la derecha de nuestra <i>&Aacute;rea de Trabajo</i>.<br/> 
Con el cursor del rat&oacute;n, vamos a presionar en la posici&oacute;n #2 de la capa #1, como se aprecia en la imagen: 
</p>
<center>
<table>
<tr>
<td>
<img src="file:sketching17.png"/>
</td>
<td>
<img src="file:sketching18.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #48.</b> A&ntilde;adiendo un nuevo marco 
</p>
</center>
<p class="paragraph">
Cada vez que necesitemos un nuevo marco para trabajar, realizamos el mismo procedimiento. Es hora de agregar a nuestra mariposa en una nueva posici&oacute;n, pero antes, es momento de activar la opci&oacute;n de <i>Papel Cebolla</i> un marco hacia atr&aacute;s: 
</p>
<center>
<table>
<tr>
<td>
<img src="file:sketching19.png"/>
</td>
<td>
<img src="file:sketching20.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #49.</b> Activando el papel cebolla
</p>
</center>
<p class="paragraph">
Gracias a este recurso, vamos a poder utilizar los marcos anteriores como gu&iacute;a para saber en donde debemos ubicar los objetos o personajes que estamos animando. Notaste que antes de activar el <i>Papel Cebolla</i>, el marco #2 era totalmente blanco? pues bien, ahora luce como si fuera papel transparente: 
</p>
<center>
<img src="file:sketching21.png"/>
<p class="paragraph">
<b>Fig #50.</b> Primer marco reflejado en el segundo, gracias al papel cebolla
</p>
</center>
<p class="paragraph">
Bas&aacute;ndonos en la informaci&oacute;n del primer marco, dibujemos de nuevo la mariposa, esta vez, un poco m&aacute;s adelante:
</p>
<center>
<img src="file:sketching22.png"/>
<p class="paragraph">
<b>Fig #51.</b> Dibujando la mariposa en el segundo marco
</p>
</center>
<p class="paragraph">
Muy bien, ahora adicionamos un tercer marco, pero para darnos una mejor idea acerca de como ir dibujando nuestro personaje a medida que la animaci&oacute;n avanza, tambi&eacute;n vamos a activar la visibilidad de m&aacute;s marcos hacia atr&aacute;s (10 para este ejemplo) en nuestro cuadro de control del <i>Papel Cebolla</i>:
</p>
<center>
<table>
<tr>
<td>
<img src="file:sketching23.png"/>
</td>
<td>
<img src="file:sketching24.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #52.</b> Agregando un marco m&aacute;s y 10 capas de cebolla hacia atr&aacute;s
</p>
</center>
<p class="paragraph">
<b>Tip:</b> Recuerda que puedes activar la transparencia de marcos tanto hacia adelante, como hacia atr&aacute;s. Eres libre de usar tantos como te guste, lo importante es que aproveches esta funcionalidad para hacer que tus animaciones se vean tan fluidas como sea posible. 
</p>
<p class="paragraph">
Ahora sigamos con nuestro tercer marco, siguiendo exactamente los mismos pasos que dimos anteriormente:
</p>
<center>
<img src="file:sketching25.png"/>
<p class="paragraph">
<b>Fig #53.</b> Dibujando la mariposa en el marco #3
</p>
</center>
<p class="paragraph">
A este punto, es muy probable que te preguntes: Cu&aacute;ntos marcos va a necesitar mi animaci&oacute;n? Bueno, es una muy buena pregunta que aprender&aacute;s a responder t&uacute; mismo, con el tiempo y con mucha mucha pr&aacute;ctica. S&oacute;lo con la experiencia, aprender&aacute;s a calcular un valor aproximado de marcos para cada uno de tus proyectos. Por ahora, dibujaremos tantos como sean necesarios para cumplir con lo propuesto por nuestro gui&oacute;n: 
</p>
<center>
<img src="file:sketching26.png"/>
<p class="paragraph">
<b>Fig #54.</b> Dibujando la mariposa en el marco #6
</p>
</center>
<center>
<img src="file:sketching27.png"/>
<p class="paragraph">
<b>Fig #55.</b> Dibujando la mariposa en el marco #9
</p> 
</center>
<center>
<table>
<tr>
<td>
<img src="file:sketching28.png"/>
</td>
<td>
<img src="file:sketching29.png"/>
</td>
</tr>
<tr>
<td> 
<img src="file:sketching30.png"/> 
</td>
<td> 
<img src="file:sketching31.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #56.</b> Tomas de los marcos #21, #31, #45 y #56 
</p>
</center>
<p class="paragraph">
<b>Tip:</b> Para este peque&ntilde;o proyecto fue necesario dibujar 73 marcos.
</p>
<p class="paragraph">
Algo importante a tener en cuenta, es que no debes esperar a dibujar el &uacute;ltimo marco para poder visualizar como est&aacute; quedando tu animaci&oacute;n. De hecho, es una buena costumbre revisar el resultado cada cierto n&uacute;mero de marcos, para as&iacute;, garantizar que las ilustraciones que est&aacute;s plasmando a cada instante, realmente correspondan a lo que tienes en mente. <a href="preview_time.html">Demos un vistazo!</a>
</p>
</body>
</html>
