<html>
<head>
<link rel="stylesheet" type="text/css" href="file:tupi.css" />
</head>
<body class="tupi_background3">
<p class="title">Hora de dibujar</p>
<p class="paragraph">
Cuando nos encontremos trabajando en el <i>M&oacute;dulo de Ilustraci&oacute;n</i>, contaremos con el <i>L&aacute;piz</i> como herramienta de trabajo autom&aacute;ticamente y tendremos a nuestra disposici&oacute;n el primer marco de la animaci&oacute;n.
<center>
<img src="file:sketching01.png"/>
<p class="paragraph">
<b>Fig #36.</b> Ingresando al M&oacute;dulo de Ilustraci&oacute;n 
</p>
</center>
<p class="paragraph">
Ahora, vamos a trazar una l&iacute;nea gu&iacute;a que defina cual va a ser la trayectoria de nuestra mariposa, seg&uacute;n lo definimos en el gui&oacute;n y aprovechando que la herramienta <i>L&aacute;piz</i> ya se encuentra seleccionada: 
</p>
<center>
<img src="file:sketching02.png"/>
<p class="paragraph">
<b>Fig #37.</b> Trazando una l&iacute;nea gu&iacute;a 
</p>
</center>
<p class="paragraph">
Ten en cuenta que puedes ajustar la trayectoria de tu l&iacute;nea gu&iacute;a, utilizando la opci&oacute;n <i>Selecci&oacute;n de Nodos</i>, ubicada en la barra de herramientas: 
</p>
<center>
<img src="file:sketching03.png"/>
<p class="paragraph">
<b>Fig #38.</b> Activando Selecci&oacute;n de Nodos 
</p>
</center>
<p class="paragraph">
Cuando selecciones la l&iacute;nea que acabaste de trazar, se ver&aacute; as&iacute;:
</p>
<center>
<img src="file:sketching04.png"/>
<p class="paragraph">
<b>Fig #39.</b> Activando Selecci&oacute;n de Nodos
</p>
</center>
<p class="paragraph">
Ahora, modifica aquellos nodos en donde la l&iacute;nea gu&iacute;a requiera ser suavizada. Nuestro objetivo es conseguir que la curva que trazamos sea lo m&aacute;s parecida a la trayectoria que queremos para nuestra mariposa. Busca un resultado similar a este:
</p>
<center>
<img src="file:sketching05.png"/>
<p class="paragraph">
<b>Fig #40.</b> L&iacute;nea gu&iacute;a corregida
</p>
</center>
<p class="paragraph">
Es momento de dibujar a nuestra protagonista. Lo primero que vamos a hacer, es ajustar el grueso de la l&iacute;nea a nuestro gusto. Presiona el bot&oacute;n <i>Propiedades de Brocha</i> ubicado en la barra lateral izquierda:
</p>
<center>
<table>
<tr>
<td>
<img src="file:sketching06.png"/>
</td>
<td>
<img src="file:sketching07.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #41.</b> Propiedades de la Brocha 
</p>
</center>
<p class="paragraph">
Y ajusta el valor del grosor del <i>L&aacute;piz</i> de acuerdo al tipo de trazo con el que quieras trabajar: 
</p>
<center>
<img src="file:sketching08.png"/>
<p class="paragraph">
<b>Fig #42.</b> Asignando un nuevo grosor al L&aacute;piz 
</p>
</center>
<p class="paragraph">
Ahora s&oacute;lo nos falta escoger el color con el que queremos empezar a dibujar. Para ello, hacemos clic sobre el bot&oacute;n <i>Paleta de Colores</i>, ubicado en la barra lateral izquierda: 
<center>
<table>
<tr>
<td>
<img src="file:sketching10.png"/>
</td>
<td>
<img src="file:sketching09.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #43.</b> Paleta de Colores
</p>
</center>
<p class="paragraph">
Vamos a utilizar un tono caf&eacute; para el cuerpo y un tono azul para las alas. Comencemos con el caf&eacute;: 
</p>
<center>
<img src="file:sketching11.png"/>
<p class="paragraph">
<b>Fig #44.</b> Seleccionando el color caf&eacute; 
</p>
</center>
<p class="paragraph">
Muy bien, ahora escojamos la herramienta <i>L&aacute;piz</i> y comencemos a trazar:
</p>
<center>
<table>
<tr>
<td>
<img src="file:sketching13.png"/>
</td>
<td>
<img src="file:sketching12.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #45.</b> Dibujando el cuerpo de la mariposa 
</p>
</center>
<p class="paragraph">
Realizamos el cambio de color para las alas, y terminamos de trazar la primera posici&oacute;n de la mariposa. Recuerda que nos encontramos en el marco #1:
</p>
<center>
<table>
<tr>
<td>
<img src="file:sketching14.png"/>
</td>
<td>
<img src="file:sketching15.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #46.</b> Dibujando las alas de la mariposa
</p>
</center>
<p class="paragraph">
<b>Tip:</b> Debido a que esta versi&oacute;n se encuentra a&uacute;n en desarrollo, es probable que el programa se cierre inesperadamente en algunas ocasiones. Te recomendamos grabar tus ejercicios desde el inicio.
</p>
<center>
<img src="file:sketching16.png"/>
<p class="paragraph">
<b>Fig #47.</b> Guardando el proyecto
</p>
</center>
<p class="paragraph">
Ya tenemos listo el primer marco de nuestra animaci&oacute;n, ahora debemos <a href="adding_frames.html">crear los siguientes...</a>
</p>
</body>
</html>
