<html>
<head>
<link rel="stylesheet" type="text/css" href="../css/tupi.css" />
</head>
<body class="tupi_background3">
<p class="title">Primero, lo primero!</p>
<p class="paragraph">
&iexcl;Contemos una historia! &iquest;Ya tienes tu historia? Es el primer paso para crear un proyecto de animaci&oacute;n. Usualmente los novatos suelen empezar a dibujar sobre el primer marco del <i>M&oacute;dulo de Ilustraci&oacute;n</i>, sin tener la m&aacute;s m&iacute;nima idea de lo que va a suceder en el &uacute;ltimo marco; esta definitivamente no es una buena estrategia para lograr buenos resultados.<br/>
Como en cualquier tipo de proyecto, los de animaci&oacute;n tambi&eacute;n requieren de un nivel m&iacute;nimo de planificaci&oacute;n. Antes de sujetar la pluma o el rat&oacute;n de tu computador, toma unos instantes para pensar en lo que quieres hacer y preg&uacute;ntate: &iquest;Cu&aacute;l es la historia que quiero contar?
</p>
<p class="paragraph">
No importa que tan peque&ntilde;o sea tu proyecto, invierte unos minutos para pensar en los detalles que har&aacute;n parte de tu animaci&oacute;n, resuelve preguntas como: &iquest;Cu&aacute;les son los personajes? &iquest;C&oacute;mo se ver&aacute;n? &iquest;Por qu&eacute; lugar van a aparecer? &iquest;Hacia d&oacute;nde se van a desplazar? &iquest;Cu&aacute;ntas escenas voy a incluir? Entre m&aacute;s larga sea tu animaci&oacute;n, m&aacute;s cuidado debes tener con las respuestas a todas estas preguntas.<br/>
En el caso de los animadores profesionales, el resultado de esta planificaci&oacute;n se traduce en un documento que se conoce como gui&oacute;n, que no es otra cosa que un texto escrito en donde se cuenta una historia para que todo un equipo de trabajo pueda entenderla y hacerla realidad. Bueno, en tu caso, tu equipo de trabajo eres t&uacute; mismo, sin embargo, no por ello debes despreciar la idea de escribir tus propios guiones, pues es un buen ejercicio para hacerte un gran animador. Cuando pienses en la importancia de escribir tu gui&oacute;n, piensa en la importancia de los planos para un arquitecto o de las partituras para un m&uacute;sico.  
</p>
<p class="paragraph">
Para nuestro ejemplo, la idea que hemos escogido es bastante sencilla: vamos a crear una animaci&oacute;n muy simple de una mariposa movi&eacute;ndose por el escenario siguiendo una trayectoria similar a la de la siguiente imagen:
</p>
<center>
<img src="../images/butterfly.png"/>
<p class="paragraph">
<b>Fig #31.</b> Trayectoria de la mariposa (ejemplo b&aacute;sico)  
</p>
</center>
<p class="paragraph">
La mariposa aparecer&aacute; por el lado izquierdo de la pantalla y desaparecer&aacute; por la derecha, en cuesti&oacute;n de unos pocos segundos. Es todo. 
<br/>
Seguramente pensar&aacute;s que se pueden construir animaciones mucho m&aacute;s complejas e interesantes, pero no olvides que s&oacute;lo se trata de un ejemplo para que conozcas la herramienta. Cuando tengas dominio sobre ella, esperamos que hagas grandes producciones de animaci&oacute;n y nos dejes conocerlas! Es importante que no lo olvides, como animador, acost&uacute;mbrate a planear tus proyectos antes de lanzarte a dibujar.
<br/><br/>
Bueno, nosotros ya tenemos listo un mini gui&oacute;n para nuestro ejemplo, as&iacute; que <a href="new.html">manos a la obra!</a>
</p>
</center>
</body>
</html>
