<html>
<head>
<link rel="stylesheet" type="text/css" href="file:tupi.css" />
</head>
<body class="tupi_background5">
<p class="title">C&oacute;mo colaborar!</p>
<p class="paragraph">
Si quieres ayudar a que <b>Tup&iacute;</b> se convierta en la mejor herramienta libre para la creaci&oacute;n de proyectos de animaci&oacute;n en 2D, existen muchas formas de hacerlo. Te contamos algunas de ellas:
</p>
<p class="paragraph">
<b>Como animador</b>
     <ul>
        <li>Instala <b>Tup&iacute;</b> en tu equipo y vu&eacute;lvete un experto creando animaciones</li>
        <li>Cu&eacute;ntale a tus amigos animadores acerca de <b>Tup&iacute;</b></li>
        <li>Crea manuales, v&iacute;deos o cualquier tipo de contenido que sirva de apoyo a otros animadores que desean aprender</li>
        <li>Crea y publica peque&ntilde;os proyectos de animaci&oacute;n en nuestra galer&iacute;a</li>
        <li>Reporta las fallas que encuentres en el programa a trav&eacute;s de nuestra p&aacute;gina web</li>
        <li>Ingresa a nuestros foros a resolver tus dudas o a ayudar a otros animadores</li>
        <li>Realiza una donaci&oacute;n al proyecto. Desde USD 1 d&oacute;lar, cualquier aporte que hagas nos permitir&aacute; contratar a m&aacute;s desarrolladores, adquirir mejores equipos para programar y pagar el mantenimiento de nuestro sitio web. Tu apoyo ser&aacute; traducido en ciclos de desarrollo m&aacute;s cortos y mejores versiones de <b>Tup&iacute;</b></li>
     </ul>
</p>
<p class="paragraph">
<b>Como desarrollador</b>
     <ul>
        <li>Baja el c&oacute;digo fuente del proyecto y est&uacute;dialo</li>
        <li>Usando la herramienta <a href="http://www.stack.nl/~dimitri/doxygen/">Doxygen</a>, ay&uacute;danos a documentar los componentes de software de <b>Tup&iacute;</b></li>
        <li>Elabora y publica diagramas y ayudas visuales que faciliten a otros programadores a conocer la arquitectura de <b>Tup&iacute;</b> de manera m&aacute;s sencilla y r&aacute;pida</li>
        <li>Consulta el reporte de fallas y ay&uacute;danos a corregir los problemas que los animadores reportan. Crea parches con las mejoras y comp&aacute;rtelos con nuestro equipo de desarrollo</li>
        <li>Revisa el cronograma de actividades y ayuda a implementar alguna de las nuevas funcionalidades que se encuentre pendiente</li>
     </ul>
</p>
<p class="paragraph">
<b>Como docente</b>
     <ul>
        <li>Invita a tus alumnos a que conozcan y utilicen <b>Tup&iacute;</b></li>
        <li>Involucra la creaci&oacute;n de animaciones como parte de las actividades en tus cursos</li>
        <li>Participa e incentiva a tus alumnos en la creaci&oacute;n de peque&ntilde;as animaciones que sirvan como ejemplo para otros alumnos</li>
        <li>Desarrolla tutoriales e invita a tus alumnos a que participen de su creaci&oacute;n</li>
     </ul>
</p>
<p class="paragraph">
Independiente del rol que escojas, todos tus aportes como miembro de esta comunidad, hacen parte fundamental del proceso de desarrollo y mejoramiento de <b>Tup&iacute;</b>. &Uacute;nete al equipo!
</p>
</body>
</html>
