<html>
<head>
<link rel="stylesheet" type="text/css" href="../css/tupi.css" />
</head>
<body class="tupi_background1">
<p class="title">Animaci&oacute;n para Principiantes</p>
<p class="paragraph">
Animar es un arte. No. Animar es un arte divertido. Tambi&eacute;n podr&iacute;amos decir que animar es una t&eacute;cnica mediante la cual le das vida a personajes u objetos, pero lo cierto es, que animar es muchas cosas m&aacute;s... sobre todo: es magia!
Para hablar de animaci&oacute;n, debemos empezar por hablar de nuestros ojos. &iquest;No es extra&ntilde;o? Si, lo es... sin embargo, la capacidad de generar la sensaci&oacute;n de animaci&oacute;n parte de nuestra capacidad para ver, m&aacute;s espec&iacute;ficamente de la forma en que vemos. Ver es una ciencia!
</p>
<p class="paragraph">
Imagina que tienes una monta&ntilde;a de fotograf&iacute;as, ahora imagina que comienzas a verlas, una por una, tan r&aacute;pido como puedas. Cada vez que te concentras en una foto, tus ojos capturan la informaci&oacute;n y se la env&iacute;an a tu cerebro para que este la procese y t&uacute; la puedas interpretar: veo una casa, veo un barco, veo a mi t&iacute;o!, etc.
Normalmente las personas creen que "ver" es simplemente abrir los ojos, pero en realidad cada vez que "miras" sucede un gran intercambio de informaci&oacute;n entre tus ojos y tu cerebro, para que tu sientas que "ves". Este proceso no es f&aacute;cil de percibir porque sucede en un espacio de tiempo sumamente peque&ntilde;o, much&iacute;simo menos que un segundo.
</p>
<p class="paragraph">
Ahora bien, veamos que sucede cuando tomas la monta&ntilde;a de fotograf&iacute;as y comienzas a repasarlas de manera r&aacute;pida, una por una: por cada imagen que colocas frente a tus ojos, tu cerebro comienza a hacer una interpretaci&oacute;n de la misma, sin embargo, dado que est&aacute;s reemplazando cada imagen por una nueva,
si lo haces a la velocidad adecuada, tu cerebro no alcanza a interpretar la totalidad de la primera foto y sin embargo debe empezar a interpretar la imagen que sigue.
Cuando el flujo de fotos es lo suficientemente grande y pasa a gran velocidad, tu cerebro comienza a mezclar la informaci&oacute;n de una imagen, con la que sigue y con la que sigue, generando la sensaci&oacute;n de movimiento, es entonces cuando la magia sucede y podemos hablar de animaci&oacute;n.
</p>
<p class="paragraph">
Se calcula que el ojo humano solo es capaz de diferenciar hasta 24 im&aacute;genes si las trata de ver, una tras otra, durante un segundo. Si el n&uacute;mero de im&aacute;genes es igual o superior a 24, entonces el ojo comienza a percibir que los elementos que componen la imagen empiezan a adquirir movimiento.
</p>
<p class="paragraph">
Un momento. &iquest;Quiere decir esto que una pel&iacute;cula no es m&aacute;s que un enorme mont&oacute;n de fotograf&iacute;as que pasan frente a mis ojos a una velocidad impresionante? La respuesta corta es: Si! Sin embargo, debemos tener en cuenta que una pel&iacute;cula es algo un poco m&aacute;s complejo, pues es contenido audio-visual, lo que significa que tambi&eacute;n incluye sonido y una gran cantidad de detalles t&eacute;cnicos que dejaremos pendientes para despu&eacute;s.
</p>
<p class="paragraph">
En el mundo de la animaci&oacute;n, cada imagen que la compone se conoce como marco (<i>frame</i> en ingl&eacute;s), as&iacute; pues, la velocidad con la que se proyecta una pel&iacute;cula se mide en marcos por segundo (en ingl&eacute;s: <i>Frames Per Second</i> o <i>FPS</i>). Entre m&aacute;s marcos tenga una animaci&oacute;n, la ilusi&oacute;n de movimiento ser&aacute; mucho mejor y entre menos tenga, la sensaci&oacute;n de fluidez se ir&aacute; perdiendo.
</p>
<p class="paragraph">
En la actualidad, contamos con una gran variedad de t&eacute;cnicas de animaci&oacute;n, con las cuales podemos crear contenidos como los que vemos en pel&iacute;culas y v&iacute;deos. Estas son algunas de las t&eacute;cnicas:
<ul>
<li><b>Animaci&oacute;n 2D:</b> Se trata de una t&eacute;cnica basada en planos para la creaci&oacute;n de los marcos que har&aacute;n parte de la animaci&oacute;n. Hey! un momento, Qu&eacute; es un plano? Cuando pienses en un plano, piensa en una superficie uniforme, similar a una hoja de papel, a una cancha de f&uacute;tbol, al suelo de tu casa o inclusive piensa en una pared. S&eacute; que suena extra&ntilde;o, pero un plano no es m&aacute;s que una superficie plana.
Ahora, en t&eacute;rminos un poco m&aacute;s complicados, un plano es un &aacute;rea de trabajo en donde cuentas con dos dimensiones para desplazarte; si lo deseas, puedes pensar en esas dos dimensiones como arriba-abajo e izquierda-derecha. 
Esas dos dimensiones, son las que forman el t&eacute;rmino 2D (dos dimensiones) que la gente utiliza cuando habla de Animaci&oacute;n 2D, por cierto, una de las primeras t&eacute;cnicas de animaci&oacute;n en la historia.
Si te fijas en los bordes de una hoja de papel y te concentras en el borde inferior y en el borde izquierdo, notar&aacute;s que son como dos lineas rectas que se encuentran en la esquina inferior izquierda. Esas dos lineas rectas son las que determinan el plano sobre el cual puedes dibujar y t&eacute;cnicamente se conocen como ejes (en matem&aacute;ticas, suelen llamarlos <i>eje X</i> y <i>eje Y</i>).
Resumiendo, cuando pienses en animaci&oacute;n 2D, piensa en dibujos animados realizados sobre una superficie plana a partir de los trazos creados por un dibujante ya sea sobre un papel, o ya sea desde un programa de computador para animaci&oacute;n 2D. Dos buenos ejemplos de esta t&eacute;cnica son la mayor&iacute;a de series de TV que puedes ver en <a href="http://www.cartoonnetworkla.com/">Cartoon Network</a>	&reg;, as&iacute; como todos los <a href="http://es.wikipedia.org/wiki/Los_Cl%C3%A1sicos_de_Walt_Disney">cl&aacute;sicos de Walt Disney</a> &reg;. Demos un vistazo a otro ejemplo:
<br/>
</li>
<center>
<img src="../images/cibertito.png"/>
<p class="paragraph">
<b>Fig #1.</b> Corto Animado "<b>Cibertito's Crash</b>". T&eacute;cnica: Animaci&oacute;n 2D
</p>
</center>
<li><b>Animaci&oacute;n 3D:</b> Esta t&eacute;cnica es un poco similar a la anterior, con la diferencia de que ya no hablamos de dos dimensiones, sino de tres. Una forma sencilla de pensar en 3D es pensar en arriba-abajo, izquierda-derecha y adelante y atr&aacute;s. Por consiguiente, hablamos de tres ejes; en matem&aacute;ticas, suelen llamarlos <i>eje X</i>, <i>eje Y</i> y <i>eje Z</i>).
A diferencia de la t&eacute;cnica 2D, la animaci&oacute;n en tres dimensiones solo se puede realizar a trav&eacute;s de programas de computador especializados en el tema, los cuales se encargan de calcular todo lo necesario para generar cada marco que compone una animaci&oacute;n. 
Bajo esta t&eacute;cnica, el creador no se encarga de ilustrar figuras, sino m&aacute;s bien de modelar objetos y estructuras geom&eacute;tricas que luego articular&aacute; para que se puedan mover a trav&eacute;s de cada marco de la escena en construcci&oacute;n.
La animaci&oacute;n 3D es mucho m&aacute;s compleja que la animaci&oacute;n 2D, pues el software enfocado a la materia debe realizar los c&aacute;lculos por cada punto en el espacio, que hace parte de cada imagen. Dichos c&aacute;lculos incluyen: color, iluminaci&oacute;n y textura, entre otros.
Todo esto se traduce en cientos de miles de operaciones matem&aacute;ticas (algunas veces millones!) es decir, en muuuuchooo trabajo! Afortunadamente, lo hace el computador y no el animador. Los mejores ejemplos de animaci&oacute;n 3D puedes encontrarlos en pel&iacute;culas como: &#34;<a href="http://www.imdb.com/title/tt0114709/">Toy Story</a>&#34;, &#34;<a href="http://www.imdb.com/title/tt0266543/">Buscando a Nemo</a>&#34; y en cortos como "<a href="http://www.bigbuckbunny.org">Big Buck Bunny</a>", del cual podemos apreciar la siguiente escena:
<br/>
</li>
<center>
<img src="../images/bunny.png"/>
<p class="paragraph">
<b>Fig #2.</b> Corto Animado "<b>Big Buck Bunny</b>". T&eacute;cnica: Animaci&oacute;n 3D
</p>
</center>
<li><b>Stop Motion:</b> Esta t&eacute;cnica se basa en jugar con fotograf&iacute;as. Si tienes una c&aacute;mara, es lo &uacute;nico que necesitas para poder empezar! El procedimiento es muy sencillo, b&aacute;sicamente consiste en tomar una serie de fotograf&iacute;as de manera continua sobre una escena mientras se hacen peque&ntilde;os cambios sobre los elementos que la componen. Complejo? No, la verdad no lo es... pensemos en un ejemplo sencillo!
Toma una pelota o cualquier objeto que desees y ub&iacute;calo sobre una mesa. Ubica tu c&aacute;mara en una posici&oacute;n fija en direcci&oacute;n hacia la mesa y aseg&uacute;rate de que no se pueda mover f&aacute;cilmente, este punto es clave para lograr un buen efecto de animaci&oacute;n. Ten en cuenta que todas las fotos que vamos a tomar, ser&aacute;n capturadas desde la misma posici&oacute;n y desde el mismo &aacute;ngulo. 
Ahora, toma una primera foto de la pelota en su posici&oacute;n inicial, luego mu&eacute;vela en una direcci&oacute;n, pero s&oacute;lo un poquito y vuelve a tomar otra foto. Mu&eacute;vela nuevamente otro poco en la misma direcci&oacute;n en la que empezaste y toma una foto de nuevo. Repite este procedimiento varias veces hasta que la &uacute;ltima foto sea la de la pelota al borde de la mesa. Muy bien, ahora mira la pantalla de tu c&aacute;mara y comienza a repasar todas las fotos desde la primera hasta la &uacute;ltima siguiendo el mismo ritmo entre cada foto. Notar&aacute;s como se percibe la sensaci&oacute;n de que la pelota se mueve hacia el borde. Eso es Stop Motion!
Dos muy buenos ejemplos de la t&eacute;cnica de Stop Motion puedes encontrarlos en las pel&iacute;culas &#34;<a href="http://www.imdb.com/title/tt0121164/">El cad&aacute;ver de la novia</a>&#34; y &#34;<a href="http://www.imdb.com/title/tt0107688/">El extra&ntilde;o mundo de Jack</a>&#34;. Ahora revisemos una imagen de otro ejemplo sencillo:
<br/>
</li>
<center>
<img src="../images/great_escape.png"/>
<p class="paragraph">
<b>Fig #3.</b> Corto Animado "<b>El Gran Escape</b>". T&eacute;cnica: Stop Motion 
</p>
</center>
</ul>
<p class="paragraph">
Muy bien, ahora que ya tenemos un poco m&aacute;s claro el concepto de animaci&oacute;n, veamos de que se trata <b>Tup&iacute;</b>!</br>
Bueno, nuestra definici&oacute;n es bastante b&aacute;sica: se trata de Software Libre para el dise&ntilde;o y creaci&oacute;n de animaci&oacute;n en 2D. Un proyecto desarrollado por animadores, para animadores y que ahora, en esta nueva etapa vive en constante evoluci&oacute;n.<br/> 
&iquest;Quieres aprender a utilizarlo? &iquest;Qu&eacute; estamos esperando? <a href="components.html">Empecemos!</a>
</p>
</body>
</html>
