<html>
<head>
<link rel="stylesheet" type="text/css" href="../css/tupi.css" />
</head>
<body class="tupi_background2">
<p class="title">M&oacute;dulo de Reproducci&oacute;n</p>
<p class="paragraph">
A trav&eacute;s de este m&oacute;dulo puedes darle una mirada a tu proyecto a medida que lo construyes. Gracias a este recurso, puedes detectar en que puntos de la l&iacute;nea de tiempo tu animaci&oacute;n necesita de ajustes, adicionar m&aacute;s marcos o tal vez cambiar la velocidad a la que quieres que las im&aacute;genes fluyan, todo depende de ti, recuerda que eres el director!<br/>
</p>
<center>
<img src="./images/animation_shot.png"/>
<p class="paragraph">
<b>Fig #25.</b> Interfaz del M&oacute;dulo de Reproducci&oacute;n
</p>
</center>
<p class="paragraph">
<b>Tip:</b> Cada vez que desees consultar el <b>M&oacute;dulo de Reproducci&oacute;n</b>, s&oacute;lo debes presionar la tecla <b>Ctrl + 2</b>.
<center>
<img src="./images/animation_menu.png"/>
<p class="paragraph">
<b>Fig #26.</b> Acceso Directo M&oacute;dulo de Reproducci&oacute;n
</p>
</center>
</p>
<p class="paragraph">
Muy bien, ahora veamos cuales son las herramientas que hacen parte de este m&oacute;dulo:
</p>
<p class="paragraph">
<b>Panel de Control</b>
<br/>
Si alguna vez has usado un DVD, una grabadora o un equipo de sonido, seguramente ya sabes cual es la funci&oacute;n de este componente. Es correcto, gracias a este conjunto de botones puedes reproducir, detener y devolver tu proyecto de animaci&oacute;n todas las veces que quieras, que seguramente ser&aacute;n muchas, pues es a partir de la observaci&oacute;n continua y cuidadosa de tu trabajo, que detectas posibles errores en tu animaci&oacute;n y realizas los respectivos ajustes, logrando que el resultado sea cada vez m&aacute;s fluido y que con el tiempo, tus proyectos sean m&aacute;s sorprendentes.
</p>
<center>
<img src="./images/controls_panel.png"/>
<p class="paragraph">
<b>Fig #27.</b> Panel de Control
</p>
</center>
<p class="paragraph">
<b>Panel de Propiedades</b>
<br/>
En este panel, ubicado en la parte inferior del <i>M&oacute;dulo de Reproducci&oacute;n</i>, encontraremos los siguientes recursos:
<ol>
<li> <b>Informaci&oacute;n sobre la animaci&oacute;n.</b> Espec&iacute;ficamente, el <i>Nombre de la Escena</i> y el n&uacute;mero <i>Total de Marcos</i> que la conforman, en otras palabras, la suma total de todos los marcos que hemos dibujado.</li>
<li> <b>Control FPS.</b> Nos permite definir la velocidad de la animaci&oacute;n, haciendo uso del par&aacute;metro <i>Marcos Por Segundo</i> (<i>FPS: Frames Per Second</i>, en ingl&eacute;s).<br/><b>Tip:</b> Entre m&aacute;s grande sea el valor de este campo, m&aacute;s r&aacute;pida se ver&aacute; la animaci&oacute;n y entre menor sea, lucir&aacute;  m&aacute;s lenta. </li>
<li> <b>Opci&oacute;n de Repetici&oacute;n.</b> Este peque&ntilde;o cuadro de selecci&oacute;n, representa la posibilidad de reproducir nuestro v&iacute;deo de manera indefinida. Es decir, si lo dejamos habilitado y presionamos el bot&oacute;n de <i>Reproducir</i>, la animaci&oacute;n se repetir&aacute; una y otra vez, hasta que decidamos detenerla.</li>
<li> <b>Opci&oacute;n de Exportaci&oacute;n.</b> Nos permite convertir nuestro proyecto de animaci&oacute;n en un archivo de v&iacute;deo. Para una mejor comprensi&oacute;n de esta funcionalidad, dale un vistazo a la secci&oacute;n <a href="video_file.html">"Creemos un archivo de v&iacute;deo!"</a>.</li>
</ol>
</p>
<center>
<img src="./images/properties_panel.png"/>
<p class="paragraph">
<b>Fig #28.</b> Panel de Propiedades
</p>
</center>
</body>
</html>
